{"chapterNumber":16,"title":"Maintenance","version":"v25.12","sectionCount":20,"sections":[{"number":"16","title":"Maintenance","level":1,"content":"16 \nMaintenance \nMaintenance is defined as 'to keep in good condition or repair', and can be divided into four categories:\nReactive\nScheduled\nPreventative, and\nSpecial\n 16 \n 16 \n460\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.1 \nMaintenance Compliance \nSection B2.3.1 of the NZBC requires components to satisfy the requirements of the building code, for 50, 15, or\n5 years (according to their categorisation) with only Normal Maintenance.\nB2/AS1 Section 1.2.1 defines 'Normal Maintenance' as: \"work that is generally recognised as being necessary\nto achieve durability for a given building element.\"\nB2/AS1 Section 2.1 states that it is the responsibility of the person specifying the building element to\ndetermine Normal Maintenance requirements which may be based on the manufacturer's recommendations\nB2/AS1 section 2.1.3 gives examples of Normal Maintenance as:\na. Following the Manufacturer's maintenance requirements.\nb. Washing down surfaces, particularly exterior building elements subject to wind-blown salt spray.\nc. Re-coating exterior and interior protective finishes.\nIn general, NZ metal roofing materials exposed to rain washing can be expected to comply with NZBC B2 without\nmanual washing, or replacement of protective finishes - but unwashed areas, which includes all wall cladding,\nmay require maintenance.\nWhere access for maintenance of unwashed areas is impractical, the use of non-ferrous metal cladding may be\nadvantageous in meeting NZBC requirements.\n 16 \n 16.1 MAINTENANCE COMPLIANCE\n 1 \n 16 \n 16.1 \n461\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.2 \nInspection \nWhether or not regular washing is required by the manufacturer, inspection should be programmed to give early\nidentification of any problem areas. This should occur at all washing intervals or at least annually. Observations\nfrom this inspection can be used to determine frequency requirements of general washing, and whether any high-\nrisk areas, for instance around flues or outlets, sheltered areas of roofing, or areas contaminated by birds, require\nmore frequent attention.\n 16 \n 16.2 INSPECTION\n 2 \n 16 \n 16.2 \n462\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.3 \nReactive Maintenance \nReactive maintenance is the response to a maintenance need that is visually apparent. \nThe disadvantage of this model is that preventable permanent damage to the cladding may already have occurred.\nA proactive scheduled maintenance approach is preferable to achieve optimal life cycle costs of the cladding.\nSpray cans should not be used for repairing scratches on pre-painted cladding. Minor surface scratches are best\nleft because they become less noticeable as the coating weathers. If the scratch cannot be seen from the ground,\nit should be left alone.\n 16 \n 16.3 REACTIVE MAINTENANCE\n 3 \n 16 \n 16.3 \n463\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.4 \nScheduled Maintenance \nScheduled maintenance is routine maintenance that is performed at pre-planned regular intervals. Inspection\nshould always be an included part of scheduled maintenance.\nWashing Cladding\nThe accumulation of deposits on a metal surface may increase the time of wetness of that surface and also\nincrease the corrosivity of the wetness. Most exposed metal roofing will be adequately cleared of dirt by rain\nwashing, but that is not the case with unwashed areas. Unwashed areas include all wall cladding. It is particularly\napplicable to areas directly sheltered from the rain, which includes all surfaces that are above a line drawn at 45 deg \nto an overhang, such as a soffit, underside of a canopy, under spouting, or garage door head.\nManual washing is required to prevent the accumulation of dirt, debris or other material not removed by rain on\nthese surfaces, carried out at intervals as prescribed by the manufacturer.\nGenerally, metal wall cladding subject to some direct rain should be washed:\nevery 6 months in severe environments; and\nevery 12 months in moderate environments.\nGenerally, other unwashed areas should be washed:\nevery 3 months for severe environments; and\nevery 6 months for moderate environments.\nWashing can be carried out with water and a sponge, soft brush or broom, or water blaster up to 20 mPa, directed\naway from the overlap of the sheets. Detergent will help remove deposits if it can be applied without increasing\nthe risk of slip and fall.\n 16 \n 16.4 SCHEDULED MAINTENANCE\n 16 \n 16.4 \n464\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.5 \nPreventative Maintenance \nPreventative Maintenance is work that provides extra protection in high-risk and vulnerable areas and is intended\nto prevent or minimise later requirements for reactive maintenance. It can be achieved by enhancing the product\nbefore installation, or by maintaining such areas more regularly than the body of the cladding.\nWhere the underside of metal roof cladding is subject to contaminants such as salt at the gutter line, an eaves\nflashing should be inserted under the roof and over the gutter to prevent deposits which lead to 'inside out'\ncorrosion. This flashing can assist where dissimilar metals are used for gutters, or spouting where splashes and\ncontaminants can corrode the roof cladding. (See 8.5.4.4 Eaves Flashing). Where the gutter line micro-\nenvironment is likely to be severe, the exposed underside of metal cladding can be painted using a two-pack\nepoxy primer or elastomeric polyurethane paint before installation.\nThe most efficient protection of the eaves in severe marine areas is to use a high front spouting system where\nthe front face of the spouting meets or exceeds the height of the roofing crests. These can be custom folded if\nnecessary.\nSeagulls perching on ridging, parapets or aerials on buildings can cause damage from rubbish dropped onto the\nroof, and from their alkali droppings. Discouraging devices such as wire or spikes can be used to prevent this.\nUnpainted aluminium or AZ coatings are particularly vulnerable to alkali.\nRoof Cladding exposed to the elements from the underside should be included in the maintenance schedule for\nunwashed areas.\n 16 \n 16.5 PREVENTATIVE MAINTENANCE\n 5 \n 16 \n 16.5 \n465\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.6 \nSpecial Maintenance \nSpecial maintenance is related to preventative maintenance in that is focused on vulnerable areas.\nHigh-risk areas such as those around flues, near fumes from exhaust fans, under television aerials or overhanging\ntrees, or sites prone to mould, lichen, and bird droppings or debris may deteriorate faster than surrounding areas.\nProximity to a motorway can cause the collection of contaminants and fine dust, as can nearby earthworks.\nShavings from wood processing plants are often blown into crevices under flashings; the shavings retain\nmoisture and can create poultice corrosion. Such areas may require more frequent maintenance than adjacent\nareas.\nDetails that trap debris against the roof, such as loose cables or gutter leaf guards, can be removed to allow free\ndraining of these areas. Soil or lush vegetation at the base of wall cladding can also be removed to prolong the\nlife of the cladding material.\n 16 \n 16.6 SPECIAL MAINTENANCE\n 6 \n 16 \n 16.6 \n466\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.7 \nWashing \nRegular washing of pre-painted and metallic-coated roofing products increases their durability by reducing attacks\nfrom airborne salts and pollutants.\nWashing may be carried out with a hose and a soft bristle brush, using fresh water or a 10% solution of household\ndetergent and water followed by a thorough rinse with clean water. Alternatively, low-pressure water blasting can\nbe used at pressures up to 20 MPa, with the jet directed away from openings and sheet laps.\nStronger concentrations of cleaners than those recommended can damage coating surfaces, and avoid using\norganic solvents and abrasive cleaners. When cleaning coated surfaces, tar and similar substances may be\nremoved with mineral turpentine, but the surfaces should then be washed thoroughly with detergent and water.\nAlways clean coated surfaces from top to bottom, and rinse immediately and thoroughly with fresh, clean water\navoiding over-cleaning or scrubbing, which can damage painted surfaces.\nHard scrubbing of un-weathered bare AZ-coated steel cladding can remove the thin factory-applied clear acrylic\nfilm and cause differential weathering, affecting appearance.\nIf water runoff is used for drinking water, roof outlets must be disconnected before washing any roof or wall\ncladding using detergents. Care must also be taken not to contaminate waterways.\n16.7.1 \nLichen And Mould \nLichen is a naturally occurring phenomenon with its spores being dispersed by the wind. Lichen will grow even on\ninert materials such as G.R.P., glass, and painted or unpainted metal roofs.\nTime of wetness of a surface affects lichen and mould growth. Sheltered and shady environments are particularly\nconducive to its growth and although light-coloured roofs may stay wet for longer than dark roofs, it can equally\nproliferate in open areas on dark coloured roofs.\nLichen and mould retain moisture, are acidic, and have tiny roots that can penetrate a paint coating. Removal is\nnecessary to prevent damage to the organic coating, but recolonisation is very likely. Where lichen has been\ntreated, regular inspection should be undertaken to curtail spread of re-growth.\n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n467\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.7.1A Lichen Damaged Roof Cladding\nLichen growth can be removed by washing down the roof or wall cladding, and applying a 2% solution of sodium\nhypochlorite to all surfaces by low-pressure spray, broom or brush. The surface should be left for 5 minutes but\nshould then be rinsed and thoroughly washed down with cold water. \nHousehold bleach and other products, such as liquid pool chlorine, contain various concentrations of sodium\nhypochlorite. Some commercially available moss and lichen removal products have different active ingredients,\nsuch as Benzalkonium Chloride or organic compounds.\nBefore using the table below, read the product label to confirm the active ingredient and the concentration of\nSodium Hypochlorite in the product to be used.\n16.7.1B Water/Bleach Ratio\nWater/source ratio for a 2% sodium Hypochlorite Concentration\nProduct\nHousehold\nBleach\nOutdoor Cleaner\nConcentrate\nLiquid Pool\nChlorine\nCustom\n4.2%\n5.25%\n12.5%\n10\nDesired Total Volume(L)\nSource product required (L)\n1.9\n1.5\n0.64\n0.8\n9\n4.3\n3.4\n1.44\n1.8\n10\n4.8\n3.8\n1.6\n2\n12\n5.7\n4.6\n1.9\n2.4\n20\n9.5\n7.6\n3.2\n50\n23.8\n8\n10\n16.7.2 \n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n468\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nGraffiti \nMetal wall cladding, like most vertical surfaces, is subject to being defaced by graffiti. Graffiti removal is likely to\naffect the pre-painted finishes on metal roof and wall cladding, and before removal is attempted a small area\nshould be cleaned as a trial. Graffiti removers may soften the paint, remove the gloss or cause permanent\ndamage.\nDo not use MEK (methyl ethyl ketone), toluene, acetone or thinners. Overpainting or replacement are the\nalternative options.\nThere are clear anti-graffiti coatings available, but their compatibility with the pre-painted cladding must be\nchecked with their supplier.\n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n469\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.8 \nOverpainting \nAs with all surfaces, the overpaint performance on profiled metal surfaces is dependent on correct surface\npreparation as well as application. This clause provides generic recommendations; in all cases, the advice of the\npaint supplier should be studied and followed.\n16.8.1 \nPreparation for Overpainting \n1. Thoroughly clean the surface with fresh flowing water and a medium stiff nylon bristle broom, or water blast at\n20 MPa. When cleaning the profile to remove dirt, lichen, mould, or algae, care should be taken not to drive\nwater under laps or flashings. Detergent or proprietary roof wash may be added (if safe) to aid dirt removal, but\nif used should be flushed off with fresh water before drying.\n2. Rinse the profile thoroughly, as any remaining dirt will impair subsequent paint adhesion. Particular attention\nshould be given to the drip edge (where the final 15 mm is prone to heavy dirt build-up), and to the coating at\nthe front edge of tile profiles, as dirt collects in this area leading to mould, algae, and lichen growth.\n3. Fallout around flues and vents needs to be removed before painting.\n4. Allow the roof to dry.\n16.8.1.1 \nWhite Corrosion \nThorough washing will remove most light deposits, and coating loss may be compensated for with metal-rich\nprimer. Heavy deposits may require the same treatment as rust. \n16.8.1.2 \nRed Corrosion \nManually abrade the red rust down to bright metal, being careful not to overly remove adjacent metallic coatings.\nPrime with a metal-rich primer and overcoat with an anti-corrosive primer and compatible topcoat.\nThe use of rust neutralisers is an alternative but must be used with caution. Many are aggressive to remaining\nmetallic coatings, some retain corrosion salts which may cause undercut corrosion in the future, and some, if not\ncompletely removed after application, will accelerate corrosion. If considering this path, use it strictly according\nto the manufacturer's recommendations and requirements.\n16.8.2 \nPaint Application \nHigh-quality, 100% acrylic paint can give a service life of up to 10 years or more when applied to specification on\ncorrectly prepared metal surfaces. This lifespan will vary with colour, roof orientation and the aesthetic\nrequirements of the situation. Poor paint curing will downgrade durability.\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n470\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nFor many paints, a 50 dry film build is required to achieve optimal thickness, and typically this requires two\nlayers of top-coat.\nPaint should not be applied on wet days when condensation has not completely dried, or when ambient\ntemperatures are expected to reach less than 10 deg or more than 30 deg within the drying period. Windy days are also\nnot recommended, as curing is impaired.\nRidge ladders should be fitted with protective buffers or rubber pads as they can cause abrasion damage to pre-\ncoated metal cladding. Where it is possible the painter should walk in the pan, but when it is necessary to step on\nthe rib, (only at the purlin line) attention should be paid to sheet overlaps as these may spring up after a painter's\nweight is removed and reveal an unpainted line.\nDecking profiles have a tight roll-formed bend at the top of the upstand and care is necessary to ensure the\nspecified film build is applied in this area.\nBrush Application:\nThe use of nylon brushes is advisable, and these should be wetted with water prior to use to avoid clogging, and\nin warm weather should be washed out completely at every rest break, or wrapped in cling film and refrigerated.\nRoller Application:\nRoller application is not preferred for profiled metal roofing as it tends to apply an uneven paint film thickness.\nThe combined use of brush and roller can give good results with tray profiles.\nDampen the roller prior to use, apply with even pressure, and do not over-roll.\nSpray Application:\nSpray application in the hands of a skilled applicator can achieve the most consistent film builds. However,\nairless spray equipment can produce very high film builds giving rise to runs and uneven coatings. When using\nspray equipment on hot or windy days, the paint spray may dry before it has reached the metal, which leaves a\nsandy appearance and feel. This is not aesthetically acceptable and will not provide the even coating or durability\nrequired.\n16.8.3 \nUnpainted Cladding \nThe practice of leaving metal-coated roof cladding to weather before painting is no longer required. With the\nlatest developments in primers, roofs can now be painted immediately after installation.\nFor un-weathered AZ-coated cladding, only acrylic galvanised iron primers should be used, as solvent-borne\nprimers may damage the coating. A solvent-borne corrosion-resistant galvanised-iron primer should, however,\nbe used for optimum performance on weathered AZ or galvanised-coated cladding. Wash and allow to dry (see\npreparation above.\nApply primer.\nApply two coats of acrylic roofing paint in the selected colour to provide the required paint thickness.\n(Typically two brush-applied coats achieve 50 m).\n16.8.4 \n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n471\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nWeathered Pre-Painted Cladding \nRepainting painted cladding should be regarded as part of the maintenance programme to extend the life of all\nmetal cladding. \nThe optimal time to overpaint weathered pre-painted cladding is when the colour has faded excessively, or the\ntopcoat has eroded to the point that the primer is becoming exposed. \nThe gloss and weathering characteristics of oven-cured and air-dried paints are different, and over time a\nsignificant difference in colour may become apparent. Variations in natural light conditions will emphasise these\ndifferences producing unacceptable aesthetic variations. For this reason, the whole roof area should be painted\nand not patch-painted.\nIf the over-painting is carried out while the topcoat is still in sound condition, there is no need to use a primer.\nApply two coats of acrylic roofing paint in the selected colour to provide the paint thickness. (Typically two\nbrush-applied coats achieve 50 m ).\n16.8.5 \nUnweathered Pre-Painted Cladding \nIt is not easy to obtain adhesion to unweathered pre-painted metal cladding. To prepare such surfaces for\npainting, abrade all surfaces with fine grit sandpaper, stiff nylon bristle broom or similar, to improve the adhesion.\nCare should be exercised not to sand through the existing paint surface on external bends.\nIf the purpose of overpainting new cladding is to obtain a colour finish that is not available in pre-painted material,\nit is often more economical to order pre-primed material rather than try to overpaint an un-weathered pre-painted\nsurface.\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n472\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[460,461,462,463,464,465,466,467,468,469,470,471,472],"subsections":[{"number":"16.1","title":"Maintenance Compliance","level":2,"content":"16.1 \nMaintenance Compliance \nSection B2.3.1 of the NZBC requires components to satisfy the requirements of the building code, for 50, 15, or\n5 years (according to their categorisation) with only Normal Maintenance.\nB2/AS1 Section 1.2.1 defines 'Normal Maintenance' as: \"work that is generally recognised as being necessary\nto achieve durability for a given building element.\"\nB2/AS1 Section 2.1 states that it is the responsibility of the person specifying the building element to\ndetermine Normal Maintenance requirements which may be based on the manufacturer's recommendations\nB2/AS1 section 2.1.3 gives examples of Normal Maintenance as:\na. Following the Manufacturer's maintenance requirements.\nb. Washing down surfaces, particularly exterior building elements subject to wind-blown salt spray.\nc. Re-coating exterior and interior protective finishes.\nIn general, NZ metal roofing materials exposed to rain washing can be expected to comply with NZBC B2 without\nmanual washing, or replacement of protective finishes - but unwashed areas, which includes all wall cladding,\nmay require maintenance.\nWhere access for maintenance of unwashed areas is impractical, the use of non-ferrous metal cladding may be\nadvantageous in meeting NZBC requirements.\n 16 MAINTENANCE\n 16 \n 1 \n 16 \n 16.1 \n461\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[461]},{"number":"16.2","title":"Inspection","level":2,"content":"16.2 \nInspection \nWhether or not regular washing is required by the manufacturer, inspection should be programmed to give early\nidentification of any problem areas. This should occur at all washing intervals or at least annually. Observations\nfrom this inspection can be used to determine frequency requirements of general washing, and whether any high-\nrisk areas, for instance around flues or outlets, sheltered areas of roofing, or areas contaminated by birds, require\nmore frequent attention.\n 16 MAINTENANCE\n 16 \n 2 \n 16 \n 16.2 \n462\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[462]},{"number":"16.3","title":"Reactive Maintenance","level":2,"content":"16.3 \nReactive Maintenance \nReactive maintenance is the response to a maintenance need that is visually apparent. \nThe disadvantage of this model is that preventable permanent damage to the cladding may already have occurred.\nA proactive scheduled maintenance approach is preferable to achieve optimal life cycle costs of the cladding.\nSpray cans should not be used for repairing scratches on pre-painted cladding. Minor surface scratches are best\nleft because they become less noticeable as the coating weathers. If the scratch cannot be seen from the ground,\nit should be left alone.\n 16 MAINTENANCE\n 16 \n 3 \n 16 \n 16.3 \n463\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[463]},{"number":"16.4","title":"Scheduled Maintenance","level":2,"content":"16.4 \nScheduled Maintenance \nScheduled maintenance is routine maintenance that is performed at pre-planned regular intervals. Inspection\nshould always be an included part of scheduled maintenance.\nWashing Cladding\nThe accumulation of deposits on a metal surface may increase the time of wetness of that surface and also\nincrease the corrosivity of the wetness. Most exposed metal roofing will be adequately cleared of dirt by rain\nwashing, but that is not the case with unwashed areas. Unwashed areas include all wall cladding. It is particularly\napplicable to areas directly sheltered from the rain, which includes all surfaces that are above a line drawn at 45 deg \nto an overhang, such as a soffit, underside of a canopy, under spouting, or garage door head.\nManual washing is required to prevent the accumulation of dirt, debris or other material not removed by rain on\nthese surfaces, carried out at intervals as prescribed by the manufacturer.\nGenerally, metal wall cladding subject to some direct rain should be washed:\nevery 6 months in severe environments; and\nevery 12 months in moderate environments.\nGenerally, other unwashed areas should be washed:\nevery 3 months for severe environments; and\nevery 6 months for moderate environments.\nWashing can be carried out with water and a sponge, soft brush or broom, or water blaster up to 20 mPa, directed\naway from the overlap of the sheets. Detergent will help remove deposits if it can be applied without increasing\nthe risk of slip and fall.\n 16 MAINTENANCE\n 16 \n 16 \n 16.4 \n464\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[464]},{"number":"16.5","title":"Preventative Maintenance","level":2,"content":"16.5 \nPreventative Maintenance \nPreventative Maintenance is work that provides extra protection in high-risk and vulnerable areas and is intended\nto prevent or minimise later requirements for reactive maintenance. It can be achieved by enhancing the product\nbefore installation, or by maintaining such areas more regularly than the body of the cladding.\nWhere the underside of metal roof cladding is subject to contaminants such as salt at the gutter line, an eaves\nflashing should be inserted under the roof and over the gutter to prevent deposits which lead to 'inside out'\ncorrosion. This flashing can assist where dissimilar metals are used for gutters, or spouting where splashes and\ncontaminants can corrode the roof cladding. (See 8.5.4.4 Eaves Flashing). Where the gutter line micro-\nenvironment is likely to be severe, the exposed underside of metal cladding can be painted using a two-pack\nepoxy primer or elastomeric polyurethane paint before installation.\nThe most efficient protection of the eaves in severe marine areas is to use a high front spouting system where\nthe front face of the spouting meets or exceeds the height of the roofing crests. These can be custom folded if\nnecessary.\nSeagulls perching on ridging, parapets or aerials on buildings can cause damage from rubbish dropped onto the\nroof, and from their alkali droppings. Discouraging devices such as wire or spikes can be used to prevent this.\nUnpainted aluminium or AZ coatings are particularly vulnerable to alkali.\nRoof Cladding exposed to the elements from the underside should be included in the maintenance schedule for\nunwashed areas.\n 16 MAINTENANCE\n 16 \n 5 \n 16 \n 16.5 \n465\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[465]},{"number":"16.6","title":"Special Maintenance","level":2,"content":"16.6 \nSpecial Maintenance \nSpecial maintenance is related to preventative maintenance in that is focused on vulnerable areas.\nHigh-risk areas such as those around flues, near fumes from exhaust fans, under television aerials or overhanging\ntrees, or sites prone to mould, lichen, and bird droppings or debris may deteriorate faster than surrounding areas.\nProximity to a motorway can cause the collection of contaminants and fine dust, as can nearby earthworks.\nShavings from wood processing plants are often blown into crevices under flashings; the shavings retain\nmoisture and can create poultice corrosion. Such areas may require more frequent maintenance than adjacent\nareas.\nDetails that trap debris against the roof, such as loose cables or gutter leaf guards, can be removed to allow free\ndraining of these areas. Soil or lush vegetation at the base of wall cladding can also be removed to prolong the\nlife of the cladding material.\n 16 MAINTENANCE\n 16 \n 6 \n 16 \n 16.6 \n466\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[466]},{"number":"16.7","title":"Washing","level":2,"content":"16.7 \nWashing \nRegular washing of pre-painted and metallic-coated roofing products increases their durability by reducing attacks\nfrom airborne salts and pollutants.\nWashing may be carried out with a hose and a soft bristle brush, using fresh water or a 10% solution of household\ndetergent and water followed by a thorough rinse with clean water. Alternatively, low-pressure water blasting can\nbe used at pressures up to 20 MPa, with the jet directed away from openings and sheet laps.\nStronger concentrations of cleaners than those recommended can damage coating surfaces, and avoid using\norganic solvents and abrasive cleaners. When cleaning coated surfaces, tar and similar substances may be\nremoved with mineral turpentine, but the surfaces should then be washed thoroughly with detergent and water.\nAlways clean coated surfaces from top to bottom, and rinse immediately and thoroughly with fresh, clean water\navoiding over-cleaning or scrubbing, which can damage painted surfaces.\nHard scrubbing of un-weathered bare AZ-coated steel cladding can remove the thin factory-applied clear acrylic\nfilm and cause differential weathering, affecting appearance.\nIf water runoff is used for drinking water, roof outlets must be disconnected before washing any roof or wall\ncladding using detergents. Care must also be taken not to contaminate waterways.\n16.7.1 \nLichen And Mould \nLichen is a naturally occurring phenomenon with its spores being dispersed by the wind. Lichen will grow even on\ninert materials such as G.R.P., glass, and painted or unpainted metal roofs.\nTime of wetness of a surface affects lichen and mould growth. Sheltered and shady environments are particularly\nconducive to its growth and although light-coloured roofs may stay wet for longer than dark roofs, it can equally\nproliferate in open areas on dark coloured roofs.\nLichen and mould retain moisture, are acidic, and have tiny roots that can penetrate a paint coating. Removal is\nnecessary to prevent damage to the organic coating, but recolonisation is very likely. Where lichen has been\ntreated, regular inspection should be undertaken to curtail spread of re-growth.\n 16 MAINTENANCE\n 16 \n 7 \n 16 \n 16.7 \n467\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n16.7.1A Lichen Damaged Roof Cladding\nLichen growth can be removed by washing down the roof or wall cladding, and applying a 2% solution of sodium\nhypochlorite to all surfaces by low-pressure spray, broom or brush. The surface should be left for 5 minutes but\nshould then be rinsed and thoroughly washed down with cold water. \nHousehold bleach and other products, such as liquid pool chlorine, contain various concentrations of sodium\nhypochlorite. Some commercially available moss and lichen removal products have different active ingredients,\nsuch as Benzalkonium Chloride or organic compounds.\nBefore using the table below, read the product label to confirm the active ingredient and the concentration of\nSodium Hypochlorite in the product to be used.\n16.7.1B Water/Bleach Ratio\nWater/source ratio for a 2% sodium Hypochlorite Concentration\nProduct\nHousehold\nBleach\nOutdoor Cleaner\nConcentrate\nLiquid Pool\nChlorine\nCustom\n4.2%\n5.25%\n12.5%\n10\nDesired Total Volume(L)\nSource product required (L)\n1.9\n1.5\n0.64\n0.8\n9\n4.3\n3.4\n1.44\n1.8\n10\n4.8\n3.8\n1.6\n2\n12\n5.7\n4.6\n1.9\n2.4\n20\n9.5\n7.6\n3.2\n50\n23.8\n8\n10\n16.7.2 \n 16 MAINTENANCE\n 16 \n 7 \n 16 \n 16.7 \n468\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nGraffiti \nMetal wall cladding, like most vertical surfaces, is subject to being defaced by graffiti. Graffiti removal is likely to\naffect the pre-painted finishes on metal roof and wall cladding, and before removal is attempted a small area\nshould be cleaned as a trial. Graffiti removers may soften the paint, remove the gloss or cause permanent\ndamage.\nDo not use MEK (methyl ethyl ketone), toluene, acetone or thinners. Overpainting or replacement are the\nalternative options.\nThere are clear anti-graffiti coatings available, but their compatibility with the pre-painted cladding must be\nchecked with their supplier.\n 16 MAINTENANCE\n 16 \n 7 \n 16 \n 16.7 \n469\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[467,468,469],"subsections":[{"number":"16.7.1","title":"Lichen And Mould","level":3,"content":"16.7 \nWashing \nRegular washing of pre-painted and metallic-coated roofing products increases their durability by reducing attacks\nfrom airborne salts and pollutants.\nWashing may be carried out with a hose and a soft bristle brush, using fresh water or a 10% solution of household\ndetergent and water followed by a thorough rinse with clean water. Alternatively, low-pressure water blasting can\nbe used at pressures up to 20 MPa, with the jet directed away from openings and sheet laps.\nStronger concentrations of cleaners than those recommended can damage coating surfaces, and avoid using\norganic solvents and abrasive cleaners. When cleaning coated surfaces, tar and similar substances may be\nremoved with mineral turpentine, but the surfaces should then be washed thoroughly with detergent and water.\nAlways clean coated surfaces from top to bottom, and rinse immediately and thoroughly with fresh, clean water\navoiding over-cleaning or scrubbing, which can damage painted surfaces.\nHard scrubbing of un-weathered bare AZ-coated steel cladding can remove the thin factory-applied clear acrylic\nfilm and cause differential weathering, affecting appearance.\nIf water runoff is used for drinking water, roof outlets must be disconnected before washing any roof or wall\ncladding using detergents. Care must also be taken not to contaminate waterways.\n16.7.1 \nLichen And Mould \nLichen is a naturally occurring phenomenon with its spores being dispersed by the wind. Lichen will grow even on\ninert materials such as G.R.P., glass, and painted or unpainted metal roofs.\nTime of wetness of a surface affects lichen and mould growth. Sheltered and shady environments are particularly\nconducive to its growth and although light-coloured roofs may stay wet for longer than dark roofs, it can equally\nproliferate in open areas on dark coloured roofs.\nLichen and mould retain moisture, are acidic, and have tiny roots that can penetrate a paint coating. Removal is\nnecessary to prevent damage to the organic coating, but recolonisation is very likely. Where lichen has been\ntreated, regular inspection should be undertaken to curtail spread of re-growth.\n 16 MAINTENANCE\n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n467\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[467]},{"number":"16.7.1A","title":"Lichen Damaged Roof Cladding","level":3,"content":"Lichen growth can be removed by washing down the roof or wall cladding, and applying a 2% solution of sodium\nhypochlorite to all surfaces by low-pressure spray, broom or brush. The surface should be left for 5 minutes but\nshould then be rinsed and thoroughly washed down with cold water. \nHousehold bleach and other products, such as liquid pool chlorine, contain various concentrations of sodium\nhypochlorite. Some commercially available moss and lichen removal products have different active ingredients,\nsuch as Benzalkonium Chloride or organic compounds.\nBefore using the table below, read the product label to confirm the active ingredient and the concentration of\nSodium Hypochlorite in the product to be used.\n16.7.1B Water/Bleach Ratio\nWater/source ratio for a 2% sodium Hypochlorite Concentration\nProduct\nHousehold\nBleach\nOutdoor Cleaner\nConcentrate\nLiquid Pool\nChlorine\nCustom\n4.2%\n5.25%\n12.5%\n10\nDesired Total Volume(L)\nSource product required (L)\n1.9\n1.5\n0.64\n0.8\n9\n4.3\n3.4\n1.44\n1.8\n10\n4.8\n3.8\n1.6\n2\n12\n5.7\n4.6\n1.9\n2.4\n20\n9.5\n7.6\n3.2\n50\n23.8\n8\n10\n16.7.2 \n 16 MAINTENANCE\n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n468\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[468],"images":[{"filename":"section-detail-792.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/section-detail-792.png","caption":"","dimensions":{"width":296,"height":241}}]},{"number":"16.7.1B","title":"Water/Bleach Ratio","level":3,"content":"16.7.1A Lichen Damaged Roof Cladding\nLichen growth can be removed by washing down the roof or wall cladding, and applying a 2% solution of sodium\nhypochlorite to all surfaces by low-pressure spray, broom or brush. The surface should be left for 5 minutes but\nshould then be rinsed and thoroughly washed down with cold water. \nHousehold bleach and other products, such as liquid pool chlorine, contain various concentrations of sodium\nhypochlorite. Some commercially available moss and lichen removal products have different active ingredients,\nsuch as Benzalkonium Chloride or organic compounds.\nBefore using the table below, read the product label to confirm the active ingredient and the concentration of\nSodium Hypochlorite in the product to be used.\nWater/source ratio for a 2% sodium Hypochlorite Concentration\nProduct\nHousehold\nBleach\nOutdoor Cleaner\nConcentrate\nLiquid Pool\nChlorine\nCustom\n4.2%\n5.25%\n12.5%\n10\nDesired Total Volume(L)\nSource product required (L)\n1.9\n1.5\n0.64\n0.8\n9\n4.3\n3.4\n1.44\n1.8\n10\n4.8\n3.8\n1.6\n2\n12\n5.7\n4.6\n1.9\n2.4\n20\n9.5\n7.6\n3.2\n50\n23.8\n8\n10\n16.7.2 \n 16 MAINTENANCE\n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n468\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[468]},{"number":"16.7.2","title":"Graffiti","level":3,"content":"16.7.1A Lichen Damaged Roof Cladding\nLichen growth can be removed by washing down the roof or wall cladding, and applying a 2% solution of sodium\nhypochlorite to all surfaces by low-pressure spray, broom or brush. The surface should be left for 5 minutes but\nshould then be rinsed and thoroughly washed down with cold water. \nHousehold bleach and other products, such as liquid pool chlorine, contain various concentrations of sodium\nhypochlorite. Some commercially available moss and lichen removal products have different active ingredients,\nsuch as Benzalkonium Chloride or organic compounds.\nBefore using the table below, read the product label to confirm the active ingredient and the concentration of\nSodium Hypochlorite in the product to be used.\n16.7.1B Water/Bleach Ratio\nWater/source ratio for a 2% sodium Hypochlorite Concentration\nProduct\nHousehold\nBleach\nOutdoor Cleaner\nConcentrate\nLiquid Pool\nChlorine\nCustom\n4.2%\n5.25%\n12.5%\n10\nDesired Total Volume(L)\nSource product required (L)\n1.9\n1.5\n0.64\n0.8\n9\n4.3\n3.4\n1.44\n1.8\n10\n4.8\n3.8\n1.6\n2\n12\n5.7\n4.6\n1.9\n2.4\n20\n9.5\n7.6\n3.2\n50\n23.8\n8\n10\n16.7.2 \n 16 MAINTENANCE\n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n468\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nGraffiti \nMetal wall cladding, like most vertical surfaces, is subject to being defaced by graffiti. Graffiti removal is likely to\naffect the pre-painted finishes on metal roof and wall cladding, and before removal is attempted a small area\nshould be cleaned as a trial. Graffiti removers may soften the paint, remove the gloss or cause permanent\ndamage.\nDo not use MEK (methyl ethyl ketone), toluene, acetone or thinners. Overpainting or replacement are the\nalternative options.\nThere are clear anti-graffiti coatings available, but their compatibility with the pre-painted cladding must be\nchecked with their supplier.\n 16 MAINTENANCE\n 16 \n 16.7 WASHING\n 7 \n 16 \n 16.7 \n469\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[468,469]}]},{"number":"16.8","title":"Overpainting","level":2,"content":"16.8 \nOverpainting \nAs with all surfaces, the overpaint performance on profiled metal surfaces is dependent on correct surface\npreparation as well as application. This clause provides generic recommendations; in all cases, the advice of the\npaint supplier should be studied and followed.\n16.8.1 \nPreparation for Overpainting \n1. Thoroughly clean the surface with fresh flowing water and a medium stiff nylon bristle broom, or water blast at\n20 MPa. When cleaning the profile to remove dirt, lichen, mould, or algae, care should be taken not to drive\nwater under laps or flashings. Detergent or proprietary roof wash may be added (if safe) to aid dirt removal, but\nif used should be flushed off with fresh water before drying.\n2. Rinse the profile thoroughly, as any remaining dirt will impair subsequent paint adhesion. Particular attention\nshould be given to the drip edge (where the final 15 mm is prone to heavy dirt build-up), and to the coating at\nthe front edge of tile profiles, as dirt collects in this area leading to mould, algae, and lichen growth.\n3. Fallout around flues and vents needs to be removed before painting.\n4. Allow the roof to dry.\n16.8.1.1 \nWhite Corrosion \nThorough washing will remove most light deposits, and coating loss may be compensated for with metal-rich\nprimer. Heavy deposits may require the same treatment as rust. \n16.8.1.2 \nRed Corrosion \nManually abrade the red rust down to bright metal, being careful not to overly remove adjacent metallic coatings.\nPrime with a metal-rich primer and overcoat with an anti-corrosive primer and compatible topcoat.\nThe use of rust neutralisers is an alternative but must be used with caution. Many are aggressive to remaining\nmetallic coatings, some retain corrosion salts which may cause undercut corrosion in the future, and some, if not\ncompletely removed after application, will accelerate corrosion. If considering this path, use it strictly according\nto the manufacturer's recommendations and requirements.\n16.8.2 \nPaint Application \nHigh-quality, 100% acrylic paint can give a service life of up to 10 years or more when applied to specification on\ncorrectly prepared metal surfaces. This lifespan will vary with colour, roof orientation and the aesthetic\nrequirements of the situation. Poor paint curing will downgrade durability.\n 16 MAINTENANCE\n 16 \n 8 \n 16 \n 16.8 \n470\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nFor many paints, a 50 dry film build is required to achieve optimal thickness, and typically this requires two\nlayers of top-coat.\nPaint should not be applied on wet days when condensation has not completely dried, or when ambient\ntemperatures are expected to reach less than 10 deg or more than 30 deg within the drying period. Windy days are also\nnot recommended, as curing is impaired.\nRidge ladders should be fitted with protective buffers or rubber pads as they can cause abrasion damage to pre-\ncoated metal cladding. Where it is possible the painter should walk in the pan, but when it is necessary to step on\nthe rib, (only at the purlin line) attention should be paid to sheet overlaps as these may spring up after a painter's\nweight is removed and reveal an unpainted line.\nDecking profiles have a tight roll-formed bend at the top of the upstand and care is necessary to ensure the\nspecified film build is applied in this area.\nBrush Application:\nThe use of nylon brushes is advisable, and these should be wetted with water prior to use to avoid clogging, and\nin warm weather should be washed out completely at every rest break, or wrapped in cling film and refrigerated.\nRoller Application:\nRoller application is not preferred for profiled metal roofing as it tends to apply an uneven paint film thickness.\nThe combined use of brush and roller can give good results with tray profiles.\nDampen the roller prior to use, apply with even pressure, and do not over-roll.\nSpray Application:\nSpray application in the hands of a skilled applicator can achieve the most consistent film builds. However,\nairless spray equipment can produce very high film builds giving rise to runs and uneven coatings. When using\nspray equipment on hot or windy days, the paint spray may dry before it has reached the metal, which leaves a\nsandy appearance and feel. This is not aesthetically acceptable and will not provide the even coating or durability\nrequired.\n16.8.3 \nUnpainted Cladding \nThe practice of leaving metal-coated roof cladding to weather before painting is no longer required. With the\nlatest developments in primers, roofs can now be painted immediately after installation.\nFor un-weathered AZ-coated cladding, only acrylic galvanised iron primers should be used, as solvent-borne\nprimers may damage the coating. A solvent-borne corrosion-resistant galvanised-iron primer should, however,\nbe used for optimum performance on weathered AZ or galvanised-coated cladding. Wash and allow to dry (see\npreparation above.\nApply primer.\nApply two coats of acrylic roofing paint in the selected colour to provide the required paint thickness.\n(Typically two brush-applied coats achieve 50 m).\n16.8.4 \n 16 MAINTENANCE\n 16 \n 8 \n 16 \n 16.8 \n471\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nWeathered Pre-Painted Cladding \nRepainting painted cladding should be regarded as part of the maintenance programme to extend the life of all\nmetal cladding. \nThe optimal time to overpaint weathered pre-painted cladding is when the colour has faded excessively, or the\ntopcoat has eroded to the point that the primer is becoming exposed. \nThe gloss and weathering characteristics of oven-cured and air-dried paints are different, and over time a\nsignificant difference in colour may become apparent. Variations in natural light conditions will emphasise these\ndifferences producing unacceptable aesthetic variations. For this reason, the whole roof area should be painted\nand not patch-painted.\nIf the over-painting is carried out while the topcoat is still in sound condition, there is no need to use a primer.\nApply two coats of acrylic roofing paint in the selected colour to provide the paint thickness. (Typically two\nbrush-applied coats achieve 50 m ).\n16.8.5 \nUnweathered Pre-Painted Cladding \nIt is not easy to obtain adhesion to unweathered pre-painted metal cladding. To prepare such surfaces for\npainting, abrade all surfaces with fine grit sandpaper, stiff nylon bristle broom or similar, to improve the adhesion.\nCare should be exercised not to sand through the existing paint surface on external bends.\nIf the purpose of overpainting new cladding is to obtain a colour finish that is not available in pre-painted material,\nit is often more economical to order pre-primed material rather than try to overpaint an un-weathered pre-painted\nsurface.\n 16 MAINTENANCE\n 16 \n 8 \n 16 \n 16.8 \n472\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[470,471,472],"subsections":[{"number":"16.8.1","title":"Preparation for Overpainting","level":3,"content":"16.8 \nOverpainting \nAs with all surfaces, the overpaint performance on profiled metal surfaces is dependent on correct surface\npreparation as well as application. This clause provides generic recommendations; in all cases, the advice of the\npaint supplier should be studied and followed.\n16.8.1 \nPreparation for Overpainting \n1. Thoroughly clean the surface with fresh flowing water and a medium stiff nylon bristle broom, or water blast at\n20 MPa. When cleaning the profile to remove dirt, lichen, mould, or algae, care should be taken not to drive\nwater under laps or flashings. Detergent or proprietary roof wash may be added (if safe) to aid dirt removal, but\nif used should be flushed off with fresh water before drying.\n2. Rinse the profile thoroughly, as any remaining dirt will impair subsequent paint adhesion. Particular attention\nshould be given to the drip edge (where the final 15 mm is prone to heavy dirt build-up), and to the coating at\nthe front edge of tile profiles, as dirt collects in this area leading to mould, algae, and lichen growth.\n3. Fallout around flues and vents needs to be removed before painting.\n4. Allow the roof to dry.\n16.8.1.1 \nWhite Corrosion \nThorough washing will remove most light deposits, and coating loss may be compensated for with metal-rich\nprimer. Heavy deposits may require the same treatment as rust. \n16.8.1.2 \nRed Corrosion \nManually abrade the red rust down to bright metal, being careful not to overly remove adjacent metallic coatings.\nPrime with a metal-rich primer and overcoat with an anti-corrosive primer and compatible topcoat.\nThe use of rust neutralisers is an alternative but must be used with caution. Many are aggressive to remaining\nmetallic coatings, some retain corrosion salts which may cause undercut corrosion in the future, and some, if not\ncompletely removed after application, will accelerate corrosion. If considering this path, use it strictly according\nto the manufacturer's recommendations and requirements.\n16.8.2 \nPaint Application \nHigh-quality, 100% acrylic paint can give a service life of up to 10 years or more when applied to specification on\ncorrectly prepared metal surfaces. This lifespan will vary with colour, roof orientation and the aesthetic\nrequirements of the situation. Poor paint curing will downgrade durability.\n 16 MAINTENANCE\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n470\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[470]},{"number":"16.8.1.1","title":"White Corrosion","level":3,"content":"16.8 \nOverpainting \nAs with all surfaces, the overpaint performance on profiled metal surfaces is dependent on correct surface\npreparation as well as application. This clause provides generic recommendations; in all cases, the advice of the\npaint supplier should be studied and followed.\n16.8.1 \nPreparation for Overpainting \n1. Thoroughly clean the surface with fresh flowing water and a medium stiff nylon bristle broom, or water blast at\n20 MPa. When cleaning the profile to remove dirt, lichen, mould, or algae, care should be taken not to drive\nwater under laps or flashings. Detergent or proprietary roof wash may be added (if safe) to aid dirt removal, but\nif used should be flushed off with fresh water before drying.\n2. Rinse the profile thoroughly, as any remaining dirt will impair subsequent paint adhesion. Particular attention\nshould be given to the drip edge (where the final 15 mm is prone to heavy dirt build-up), and to the coating at\nthe front edge of tile profiles, as dirt collects in this area leading to mould, algae, and lichen growth.\n3. Fallout around flues and vents needs to be removed before painting.\n4. Allow the roof to dry.\n16.8.1.1 \nWhite Corrosion \nThorough washing will remove most light deposits, and coating loss may be compensated for with metal-rich\nprimer. Heavy deposits may require the same treatment as rust. \n16.8.1.2 \nRed Corrosion \nManually abrade the red rust down to bright metal, being careful not to overly remove adjacent metallic coatings.\nPrime with a metal-rich primer and overcoat with an anti-corrosive primer and compatible topcoat.\nThe use of rust neutralisers is an alternative but must be used with caution. Many are aggressive to remaining\nmetallic coatings, some retain corrosion salts which may cause undercut corrosion in the future, and some, if not\ncompletely removed after application, will accelerate corrosion. If considering this path, use it strictly according\nto the manufacturer's recommendations and requirements.\n16.8.2 \nPaint Application \nHigh-quality, 100% acrylic paint can give a service life of up to 10 years or more when applied to specification on\ncorrectly prepared metal surfaces. This lifespan will vary with colour, roof orientation and the aesthetic\nrequirements of the situation. Poor paint curing will downgrade durability.\n 16 MAINTENANCE\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n470\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[470]},{"number":"16.8.1.2","title":"Red Corrosion","level":3,"content":"16.8 \nOverpainting \nAs with all surfaces, the overpaint performance on profiled metal surfaces is dependent on correct surface\npreparation as well as application. This clause provides generic recommendations; in all cases, the advice of the\npaint supplier should be studied and followed.\n16.8.1 \nPreparation for Overpainting \n1. Thoroughly clean the surface with fresh flowing water and a medium stiff nylon bristle broom, or water blast at\n20 MPa. When cleaning the profile to remove dirt, lichen, mould, or algae, care should be taken not to drive\nwater under laps or flashings. Detergent or proprietary roof wash may be added (if safe) to aid dirt removal, but\nif used should be flushed off with fresh water before drying.\n2. Rinse the profile thoroughly, as any remaining dirt will impair subsequent paint adhesion. Particular attention\nshould be given to the drip edge (where the final 15 mm is prone to heavy dirt build-up), and to the coating at\nthe front edge of tile profiles, as dirt collects in this area leading to mould, algae, and lichen growth.\n3. Fallout around flues and vents needs to be removed before painting.\n4. Allow the roof to dry.\n16.8.1.1 \nWhite Corrosion \nThorough washing will remove most light deposits, and coating loss may be compensated for with metal-rich\nprimer. Heavy deposits may require the same treatment as rust. \n16.8.1.2 \nRed Corrosion \nManually abrade the red rust down to bright metal, being careful not to overly remove adjacent metallic coatings.\nPrime with a metal-rich primer and overcoat with an anti-corrosive primer and compatible topcoat.\nThe use of rust neutralisers is an alternative but must be used with caution. Many are aggressive to remaining\nmetallic coatings, some retain corrosion salts which may cause undercut corrosion in the future, and some, if not\ncompletely removed after application, will accelerate corrosion. If considering this path, use it strictly according\nto the manufacturer's recommendations and requirements.\n16.8.2 \nPaint Application \nHigh-quality, 100% acrylic paint can give a service life of up to 10 years or more when applied to specification on\ncorrectly prepared metal surfaces. This lifespan will vary with colour, roof orientation and the aesthetic\nrequirements of the situation. Poor paint curing will downgrade durability.\n 16 MAINTENANCE\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n470\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[470]},{"number":"16.8.2","title":"Paint Application","level":3,"content":"16.8 \nOverpainting \nAs with all surfaces, the overpaint performance on profiled metal surfaces is dependent on correct surface\npreparation as well as application. This clause provides generic recommendations; in all cases, the advice of the\npaint supplier should be studied and followed.\n16.8.1 \nPreparation for Overpainting \n1. Thoroughly clean the surface with fresh flowing water and a medium stiff nylon bristle broom, or water blast at\n20 MPa. When cleaning the profile to remove dirt, lichen, mould, or algae, care should be taken not to drive\nwater under laps or flashings. Detergent or proprietary roof wash may be added (if safe) to aid dirt removal, but\nif used should be flushed off with fresh water before drying.\n2. Rinse the profile thoroughly, as any remaining dirt will impair subsequent paint adhesion. Particular attention\nshould be given to the drip edge (where the final 15 mm is prone to heavy dirt build-up), and to the coating at\nthe front edge of tile profiles, as dirt collects in this area leading to mould, algae, and lichen growth.\n3. Fallout around flues and vents needs to be removed before painting.\n4. Allow the roof to dry.\n16.8.1.1 \nWhite Corrosion \nThorough washing will remove most light deposits, and coating loss may be compensated for with metal-rich\nprimer. Heavy deposits may require the same treatment as rust. \n16.8.1.2 \nRed Corrosion \nManually abrade the red rust down to bright metal, being careful not to overly remove adjacent metallic coatings.\nPrime with a metal-rich primer and overcoat with an anti-corrosive primer and compatible topcoat.\nThe use of rust neutralisers is an alternative but must be used with caution. Many are aggressive to remaining\nmetallic coatings, some retain corrosion salts which may cause undercut corrosion in the future, and some, if not\ncompletely removed after application, will accelerate corrosion. If considering this path, use it strictly according\nto the manufacturer's recommendations and requirements.\n16.8.2 \nPaint Application \nHigh-quality, 100% acrylic paint can give a service life of up to 10 years or more when applied to specification on\ncorrectly prepared metal surfaces. This lifespan will vary with colour, roof orientation and the aesthetic\nrequirements of the situation. Poor paint curing will downgrade durability.\n 16 MAINTENANCE\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n470\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[470]},{"number":"16.8.3","title":"Unpainted Cladding","level":3,"content":"For many paints, a 50 dry film build is required to achieve optimal thickness, and typically this requires two\nlayers of top-coat.\nPaint should not be applied on wet days when condensation has not completely dried, or when ambient\ntemperatures are expected to reach less than 10 deg or more than 30 deg within the drying period. Windy days are also\nnot recommended, as curing is impaired.\nRidge ladders should be fitted with protective buffers or rubber pads as they can cause abrasion damage to pre-\ncoated metal cladding. Where it is possible the painter should walk in the pan, but when it is necessary to step on\nthe rib, (only at the purlin line) attention should be paid to sheet overlaps as these may spring up after a painter's\nweight is removed and reveal an unpainted line.\nDecking profiles have a tight roll-formed bend at the top of the upstand and care is necessary to ensure the\nspecified film build is applied in this area.\nBrush Application:\nThe use of nylon brushes is advisable, and these should be wetted with water prior to use to avoid clogging, and\nin warm weather should be washed out completely at every rest break, or wrapped in cling film and refrigerated.\nRoller Application:\nRoller application is not preferred for profiled metal roofing as it tends to apply an uneven paint film thickness.\nThe combined use of brush and roller can give good results with tray profiles.\nDampen the roller prior to use, apply with even pressure, and do not over-roll.\nSpray Application:\nSpray application in the hands of a skilled applicator can achieve the most consistent film builds. However,\nairless spray equipment can produce very high film builds giving rise to runs and uneven coatings. When using\nspray equipment on hot or windy days, the paint spray may dry before it has reached the metal, which leaves a\nsandy appearance and feel. This is not aesthetically acceptable and will not provide the even coating or durability\nrequired.\n16.8.3 \nUnpainted Cladding \nThe practice of leaving metal-coated roof cladding to weather before painting is no longer required. With the\nlatest developments in primers, roofs can now be painted immediately after installation.\nFor un-weathered AZ-coated cladding, only acrylic galvanised iron primers should be used, as solvent-borne\nprimers may damage the coating. A solvent-borne corrosion-resistant galvanised-iron primer should, however,\nbe used for optimum performance on weathered AZ or galvanised-coated cladding. Wash and allow to dry (see\npreparation above.\nApply primer.\nApply two coats of acrylic roofing paint in the selected colour to provide the required paint thickness.\n(Typically two brush-applied coats achieve 50 m).\n16.8.4 \n 16 MAINTENANCE\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n471\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[471]},{"number":"16.8.4","title":"Weathered Pre-Painted Cladding","level":3,"content":"For many paints, a 50 dry film build is required to achieve optimal thickness, and typically this requires two\nlayers of top-coat.\nPaint should not be applied on wet days when condensation has not completely dried, or when ambient\ntemperatures are expected to reach less than 10 deg or more than 30 deg within the drying period. Windy days are also\nnot recommended, as curing is impaired.\nRidge ladders should be fitted with protective buffers or rubber pads as they can cause abrasion damage to pre-\ncoated metal cladding. Where it is possible the painter should walk in the pan, but when it is necessary to step on\nthe rib, (only at the purlin line) attention should be paid to sheet overlaps as these may spring up after a painter's\nweight is removed and reveal an unpainted line.\nDecking profiles have a tight roll-formed bend at the top of the upstand and care is necessary to ensure the\nspecified film build is applied in this area.\nBrush Application:\nThe use of nylon brushes is advisable, and these should be wetted with water prior to use to avoid clogging, and\nin warm weather should be washed out completely at every rest break, or wrapped in cling film and refrigerated.\nRoller Application:\nRoller application is not preferred for profiled metal roofing as it tends to apply an uneven paint film thickness.\nThe combined use of brush and roller can give good results with tray profiles.\nDampen the roller prior to use, apply with even pressure, and do not over-roll.\nSpray Application:\nSpray application in the hands of a skilled applicator can achieve the most consistent film builds. However,\nairless spray equipment can produce very high film builds giving rise to runs and uneven coatings. When using\nspray equipment on hot or windy days, the paint spray may dry before it has reached the metal, which leaves a\nsandy appearance and feel. This is not aesthetically acceptable and will not provide the even coating or durability\nrequired.\n16.8.3 \nUnpainted Cladding \nThe practice of leaving metal-coated roof cladding to weather before painting is no longer required. With the\nlatest developments in primers, roofs can now be painted immediately after installation.\nFor un-weathered AZ-coated cladding, only acrylic galvanised iron primers should be used, as solvent-borne\nprimers may damage the coating. A solvent-borne corrosion-resistant galvanised-iron primer should, however,\nbe used for optimum performance on weathered AZ or galvanised-coated cladding. Wash and allow to dry (see\npreparation above.\nApply primer.\nApply two coats of acrylic roofing paint in the selected colour to provide the required paint thickness.\n(Typically two brush-applied coats achieve 50 m).\n16.8.4 \n 16 MAINTENANCE\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n471\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[471]},{"number":"16.8.5","title":"Unweathered Pre-Painted Cladding","level":3,"content":"Weathered Pre-Painted Cladding \nRepainting painted cladding should be regarded as part of the maintenance programme to extend the life of all\nmetal cladding. \nThe optimal time to overpaint weathered pre-painted cladding is when the colour has faded excessively, or the\ntopcoat has eroded to the point that the primer is becoming exposed. \nThe gloss and weathering characteristics of oven-cured and air-dried paints are different, and over time a\nsignificant difference in colour may become apparent. Variations in natural light conditions will emphasise these\ndifferences producing unacceptable aesthetic variations. For this reason, the whole roof area should be painted\nand not patch-painted.\nIf the over-painting is carried out while the topcoat is still in sound condition, there is no need to use a primer.\nApply two coats of acrylic roofing paint in the selected colour to provide the paint thickness. (Typically two\nbrush-applied coats achieve 50 m ).\n16.8.5 \nUnweathered Pre-Painted Cladding \nIt is not easy to obtain adhesion to unweathered pre-painted metal cladding. To prepare such surfaces for\npainting, abrade all surfaces with fine grit sandpaper, stiff nylon bristle broom or similar, to improve the adhesion.\nCare should be exercised not to sand through the existing paint surface on external bends.\nIf the purpose of overpainting new cladding is to obtain a colour finish that is not available in pre-painted material,\nit is often more economical to order pre-primed material rather than try to overpaint an un-weathered pre-painted\nsurface.\n 16 MAINTENANCE\n 16 \n 16.8 OVERPAINTING\n 8 \n 16 \n 16.8 \n472\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[472]}]}]}]}