{"chapterNumber":10,"title":"Internal Moisture","version":"v25.12","sectionCount":74,"sections":[{"number":"10","title":"Internal Moisture","level":1,"content":"10 \nInternal Moisture \nThe science of internal moisture control is concerned with the need to manage and control condensation, mould\ngrowth, and corrosion. \nThe outdoor environment, the building design, and occupant behaviour affect humidity in the living spaces, which\nultimately affects humidity in the ceiling space. \nThis section of the COP focusses predominantly on managing humidity in the ceiling space of dwellings. Shorter\nsections also cover the design of non-residential roof and wall cladding, which may also be affected by excessive\ninternal moisture. \n 10 \n 10 \n304\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.1 \nNZBC Clause E3: Internal Moisture (Extract) \nSource: Acceptable Solutions and Verifications for New Zealand Building Clause E3 Internal moisture.\n10.1.1 \nE3 Objective \nSafeguard people against illness, injury, or loss of amenity that could result from the accumulation of internal\nmoisture.\n10.1.2 \nE3 Functional Requirements \nBuildings must be constructed in a way to avoid the likelihood of:\nfungal growth on linings and other building elements, and\ndamage to building elements due to the presence of moisture.\n10.1.3 \nE3 Performance Requirements \nNZBC Clause E3 requires building practices to ensure an adequate combination of thermal resistance,\nventilation, and space temperature in all habitable spaces, bathrooms, laundries, and other spaces where\nmoisture may be generated or accumulate.\n10.1.4 \nCompliance \nNew Zealand Building Code clause E3.3 a) requires buildings to be constructed to avoid the likelihood of fungal\ngrowth on linings and other building elements. Acceptable Solution E3/AS1 1.0.1 says fungal growth can be\navoided by minimising internal condensation. While it gives no prescriptive solutions for achieving this, it has\nbeen shown that venting ceiling spaces has a significant effect not only in minimising the growth of mould in\nceiling spaces and ceilings, but also improves the air quality within the occupied spaces of a dwelling.\nIncreased levels of ceiling insulation results in less heat escape into the ceiling cavity. This lowers the\ntemperature of the ceiling cavity, which lowers the dew point, increasing the frequency and severity of\ncondensation. This can not only cause problems with mould growth and occupant health, but excess moisture\ncan also affect the durability of the roof and the structure.\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n305\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nIn addition, E2.3.6 requires that excess moisture present at the completion of construction must be capable of\nbeing dissipated without permanent damage to building elements. This is particularly relevant to dwellings with\nconcrete floors or party walls which will exude moisture for extended periods during the curing process.\nThe COP requires details that enable free passage of air from eaves to ridge of all roofs of dwellings and requires\nspecial ventilation design for:\nflat roofs,\nsarked roofs,\nskillion roofs,\nbarrel curved and prickle-ridged roofs, and\nroofs with ceilings which allow easy passage of moisture vapour.\nLong (over 12 m spans), shallow-pitched (less than 12 deg ) roofs should also be designed to allow natural\nventilation.\nGenerally, there is no need to make provision for moisture control in industrial and most commercial buildings\ndue to them being either well-ventilated or climate-controlled. In buildings with valuable or delicate stock, the\npossibility of dripping condensation needs to be assessed.\n10.1.4A Mould Caused by Excess\nMoisture\n10.1.4B Durability Issues Due to Excess\nMoisture\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n306\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nRoofs in cold areas where numbers of people may come in wet at the end of the day, such as ski lodges and\ntramping huts, require specific design.\nBuildings designed to accommodate large numbers of people (such as theatres, sports areas and educational\nbuildings) and areas creating particularly high moisture levels (e.g. swimming pools) should have ventilation\nsolutions designed by a specialist engineer.\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n307\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.2 \nWhy Manage Internal Moisture \nInternal air quality is a major cause of respiratory illness, which has been reported as costing the country $6\nbillion per annum, with respiratory-related illnesses accounting for one in ten of overnight hospital admissions.\nDust mites grow up to ten times faster in damp environments and contribute to allergic reactions and asthma.\nThe most recent BRANZ Home Condition Survey identified mould ranging from moderate to severe in 22% of New\nZealand houses. Mould was worst in rental accommodation, where much of our most vulnerable population live.\nIn addition to the health effects, excessive internal moisture impacts material durability. In the roof space, this\ncan affect the roof cladding, underlay, purlins, trusses, fasteners, and seriously affect the durability and structural\nintegrity of those components without being apparent to the occupants.\n 10 \n 10.2 WHY MANAGE INTERNAL MOISTURE\n 2 \n 10 \n 10.2 \n308\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.3 \nSpecial Requirements \nBuildings of the following types using metal cladding should have a sealed vapour barrier and are outside the\nscope of this Code of Practice. They require specific design.\nSwimming pools.\nBuildings containing liquids stored in open containers.\nBuildings where water is used in manufacturing, cleaning or storage processes.\nIce rinks, cold stores and freezers.\nBuildings where unvented gas heating is used.\n 10 \n 10.3 SPECIAL REQUIREMENTS\n 3 \n 10 \n 10.3 \n309\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.4 \nCondensation \nCondensation is a natural phenomenon and building materials are capable of withstanding repeated short-term\nepisodes of wetness. Problems arise in ceiling spaces when more water vapour enters than exits, and materials\nstay wet for long periods, or where standing water accumulates.\nThe primary purpose of roof cladding is to act as a rain screen so that no water enters the building from the\noutside. It is, however, equally important to ensure that the building is kept dry from inside. Because metal is a\ngood heat conductor and is not absorbent, condensation forms on metal cladding under conditions of high\nhumidity when surface temperatures drop below the dew point.\nThe solutions in the Code of Practice apply to cold roofs, where there is a gap between the ceiling insulation and\nthe roofing material. 10.12.2 Warm Roofs require specific design to avoid internal moisture problems. They are\ndiscussed in more detail under 15.5 Warm Roofs.\n 10 \n 10.4 CONDENSATION\n 10 \n 10.4 \n310\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.5 \nBuilding Airtightness \n10.5A NZS 3602:1975 (Lapsed)\nChanging building techniques and materials - eg, impervious cladding and linings, and aluminium joinery - have\nled to buildings becoming progressively more airtight. Many of these changes have been led by the desire to\nincrease energy efficiency. Other building changes include unsealed downlights, which can allow ready entry of\nwater vapour into the ceiling space, and the demise of the open fireplace which provided considerable ventilation\nto the living areas of a home.\nOccupant behaviour has also changed. More families shower daily and then leave the house unoccupied and\nclosed-up for much of the day and night. Less activity means a low level of air changes per hour.\nThese changes can lead to internal moisture problems. As water vapour is lighter than other atmospheric gases,\nmuch of the moisture tends to migrate upwards into the ceiling cavity.\n 10 \n 10.5 BUILDING AIRTIGHTNESS\n 5 \n 10 \n 10.5 \n311\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.5B BRANZ Survey showing changes in permeability on NZ houses over time\nPre 1960 60-69\n70-79\n80-89\n90-99 2000's\nAir changes per hour @ 50Pa\n0\n5\n10\n15\n20\n25\n30\n35\n 10 \n 10.5 BUILDING AIRTIGHTNESS\n 5 \n 10 \n 10.5 \n312\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.6 \nInsulation \nThe increase in ceiling insulation standards helps prevent heat leakage into the ceiling space, but it does not\naffect the passage of water vapour. Ceiling insulation excludes more heat from the ceiling cavity, resulting in\ncolder cavity air temperatures. Warmer air can hold more water vapour than cold air. Therefore, colder\ntemperatures in the ceiling cavity lead to an increased risk of condensation.\n10.6.1 \nInsulation Position \nInsulation must be positioned so that there is a gap of at least 20 mm between insulation and roofing. On flat\nceilings, or buildings without eaves, it must be placed so the gap is maintained at the eaves or an eaves\ninsulation barrier should be fitted. To achieve this, an eaves insulation barrier may be required.\n10.6.2 \nOther Insulation \nReflective foils are not defined as insulating, because they are only somewhat effective against radiative heat\nloss and have little impact on conductive and convective mechanisms. They also increase the potential for\nelectrocution. As they are non-absorbent, they are not permitted as residential roofing underlay in New Zealand.\nWhen Polyester blanket insulation is used in conjunction with metal roof cladding, special roofing screws should\nbe used to avoid binding.\nComposite insulated metal panels are described in 15.5 Warm Roofs.\nInsulation must not be laid over the purlins as this compromises the air gap and the efficiency of the insulation\nwhere the roofing compresses it.\n 10 \n 10.6 INSULATION\n 6 \n 10 \n 10.6 \n313\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.7 \nClimate \nBeing narrow, mountainous, islands lying in the path of strong prevailing winds, New Zealand is subject to high\nrainfall and high humidity. Compared to much of the world - where 70% relative humidity is considered the\nthreshold of corrosion and health problems - New Zealand has very high humidity, particularly in northern\nregions, where the mean annual humidity levels are often around 80% or more. This means the dew point\n(temperature at which condensation begins to form) is also higher than in colder but drier climates.\nThe design requirements to deal with this environment are specific to New Zealand, which is reflected in our\nbuilding practices. It is not advisable to use design or installation practices from countries with different\nenvironmental conditions without a comprehensive assessment of the management of internal moisture under\nNZ conditions.\n10.7.1 \nHumidity \nRelative humidity (RH, given in per cent [%]), is the most widely known method: It gives the content of water\nvapour in the air relative to the maximum amount of water this parcel of air can hold at its present temperature.\nOther measures are absolute humidity and water vapour pressure.\n 10 \n 10.7 CLIMATE\n 7 \n 10 \n 10.7 \n314\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.8 \nMoisture Sources \nEveryday household activities, heating, indoor plants, pets and construction activities all contribute to indoor\nmoisture.\n10.8.1 \nOccupant Behaviour \nThe occupants of the building create a significant amount of water vapour. Therefore, the air inside in a building\ntypically has a higher moisture content than the external atmosphere.\nBathing and showering, cooking, heating, indoor laundries, and unvented clothes drying are the most obvious\nsources of water; respiration, perspiration, indoor plants, and pets also produce moisture.\nAreas for moisture-generating activities should be well ventilated and the entire building should be mechanically\nventilated to outside the structure. Proposed changes to NZBC G4/AS1 will require venting to the outside of\nappliances such as showers, baths, and cooktops.\n10.8.1A Everyday Activities Release\nMoisture Vapour\n10.8.1B Approximate Amount of Water\nVapour from Occupant Behaviour\nOccupant\nbehaviour\nEstimated Amount of Water\nReleased (per 2.5\ninhabitants)\nCooking\n(unventilated)\n3.0 L / day.\nBaths / Showers\n1.5 L/day. \nClothes Washing\n0.5 L/ day.\nClothes drying\n(unvented)\n5.0 L/ load.\nDishwashing\n1.0 L / day.\nPortable gas\nheater\nup to 1.6 litres per 1kg of gas\nburned.\nBreathing \n(average)\n3 litres per day.\nBreathing asleep\n(per hour)\n(average)\n50 ml.\nPerspiration \n0.5 litre per day.\nPot Plants\nThe same amount as the\ninput\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n315\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.8.2 \nHeating \nSome other sources of moisture are best avoided altogether, particularly unvented gas heating and kerosene\nheaters. Burning 1 kg of gas can release 1.6 litres of moisture into the atmosphere.\n10.8.3 \nMechanical Venting \nSupply-driven and exhaust-driven mechanical ventilation systems can pressurise or depressurise internal\natmospheres in different areas of the building. Supply-driven systems can be problematic as increased internal\npressures can drive moist air into the attic through openings in the ceiling.\nExhaust-driven systems can de-pressurise internal areas and increase the intake of moist external air, e.g. ground\nmoisture via a vented cavity. Unbalanced mechanical ventilation can also encourage moisture migration by\ncreating negative pressures in the ceiling cavity. These systems need to be well designed and maintained to avoid\nthe risk of affecting internal moisture. A balanced mechanical ventilation system, where both intake and exhaust\nare connected to the outside, is the preferred system and will be most effective when the thermal envelope of the\nbuilding is airtight.\n10.8.4 \nConstruction Moisture \nDuring construction, timber can become wet and take some time to dry out. Some activities, such as plastering\nand painting, also release water vapour.\nConcrete floors are particularly prolific sources of moisture. During curing, a 100 mm thick concrete slab\nreleases approximately 10 litres of water vapour per square metre of surface area. The curing period depends on\nvarious factors, but as a rule of thumb, a concrete floor cures at a depth-rate of 25 mm per month. Therefore, a\nconcrete slab can affect internal moisture levels for a considerable period.\nAll new buildings, particularly those with concrete floors, must be kept well ventilated (at much higher levels than\nrequired during normal use) until moisture levels of construction materials have stabilised.\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n316\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.8.4A Mould Damage\nThis building suffered mould damage to underlay and roof truss even before occupants moved in.\n10.8.5 \nGround Moisture \nGround moisture can infiltrate living spaces by way of the floor or directly to the ceiling space by way of vented\ncavities. The cavity should be constructed to prevent the migration of water vapour into the ceiling space. Wet\nsubfloors can be isolated by laying polythene tightly over the surface and taping all joints. More information can\nbe obtained from the Good Repair Guide: Damp Subfloors (BRANZ).\nConcrete floors must be installed over a damp-proof membrane (DPM) to ensure that moisture from within the\nground does not penetrate the slab. This membrane can be formed by a polyethene sheet that is taped at the laps\nand laid over compacted hard fill topped by a sand blinding layer. The DPM must be installed under the full extent\nof the slab, under any internal or perimeter foundations, extend up to the external edge of the floor slab, and\nlapped and sealed under the wall damp-proofing system.\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n317\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.9 \nMinimising Ingress of Water Vapour into the Ceiling Cavity \nThe first line of defence for managing roof space moisture levels is maintaining low relative humidity in the\ndwelling areas. The second line is preventing excessive amounts of moisture entering the ceiling cavity. It is\nrecommended that all ceilings are square stopped and all penetrations (cables, pipes, hatches, etc.) are caulked.\nOnly use downlights that are airtight and have a gasket\nA gloss painted plasterboard ceiling presents some resistance to the passage of water vapour but is not a\ncomplete barrier. Vapour will also find its way through any minor gaps in architectural details, and it is air\ntransport through gaps that is responsible for 95% of the passage of water vapour into the ceiling space.\nCeiling tiles and tongue and groove ceilings are considerably more porous than plasterboard. Unsealed\ndownlights can be a major source of moisture movement into the ceiling cavity and should be avoided where\npossible.\nSee BRANZ Facts Roof Ventilation #3 .\nIn some older New Zealand homes, vapour barriers have been used to limit entry of moist air into the ceiling\nspace, but control of air movement into the cavity and removal of damp air by ventilation is a more practical\napproach.\nCavity systems prescribed under E2AS1 9.1.8.1, except those behind masonry veneer, are classified as drained\nnot ventilated. That means they must be closed at the top to restrict air movement between the cavity and the\nroof space. Closing a cavity off at the top still allows reasonable ventilation of the cavity while preventing\nexcessive amounts of moisture rising to the ceiling space. Alternatively, wall cavities can be vented externally.\n 10 \n 10.9 MINIMISING INGRESS OF WATER VAPOUR INTO THE CEILING\nCAVITY\n 9 \n 10 \n 10.9 \n318\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10 \nVentilation Pathways \nBecause of the cooking, washing, and respiration of the inhabitants, the humidity in the ceiling cavity is most\noften greater than that of the surrounding atmosphere. The space may also be colder than the ambient air at\nnight due to 10.12.3 Night Sky Radiation\nWarm air naturally rises but has little tendency to move laterally, except when a strong wind blows into roof vents\nor causes substantial differences in air pressure on opposite sides of the building. That is why eave-to-ridge\nventilation is more effective under typical conditions than side-to-side ventilation.\nVentilation of a cavity space is desired to reduce the accumulation of condensation and assist in removing\nexcess heat. Natural ventilation via the ribs of metal roof and wall cladding can achieve this adequately in normal\ncircumstances, but additional provisions are often necessary. In all cases, air must flow naturally through the\nprofile crests without barriers such as profiled foam filler strips at the eaves and apex, or impingement of bulk\ninsulation.\n10.10A Ventilation pathway: Eaves\nwith Underlay\nVentilation Path\n10.10B Ventilation pathway: Eaves with\nFleece\nFleece-lined\nVentilation pathway\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n319\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nMany roofs not overtly displaying the signs of excessive moisture build-up would benefit from increased\nA printable bulletin is available at: BEF01Position of Eaves Flashing to Underlay.\n10.10C Ventilation pathway: Ridge\nwith Underlay\nSoft edge flashing.\nRoofer to incorporate 20mm x \n500mm slots, with 300mm \nunslotted spacing between \nthem, to additional ridge \nunderlay for passive airflow \nthrough the roof structure.\nNotched Ridge\nVentilation \npath\nVentilation \npath\n10.10D Ventilation Pathway: Ridge with\nFleece\nSoft edge flashing.\nVentilation \npath\nVentilation \npath\n10.10E Ventilation Pathway: Top Plate\nwith Underlay\nReduce height of perimeter insulation to \nmaintain 25 mm min airflow clearance. \nAlternatively use an Eaves ventilator or heel \ntruss\nVentilation path\n10.10F Ventilation Pathway: Top Plate\nwith Fleece\nVentilation path\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n320\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nExtract:\n\"Eaves flashings are traditionally laid between the underlay and the eaves purlin. This is not always\nnecessary, or even desirable...\"\nSimple techniques to provide a clear path for air to enter, travel along and exit the roof cavity can include:\nEaves:\nAllow air entry by soffit vents, over-fascia or behind-fascia vents, or by using fleece-lined roofing material.\nEnsuring that insulation does not impinge on the underside of the roof at the eaves. This can be achieved by\nusing a heeled truss, eaves baffle, or both.\nBody:\nEnsuring that the air can travel under the roof. If insulation is flush with the underside of the purlins it can\nbe done using a vented batten between the purlin and the underlay, or by using fleece lined roofing material.\nApex:\nMaking the roof underlay discontinuous at the apex by cutting or slitting the underlay and using a vented\nsoft edge or vented ridge.\nSarked roofs must have a gap in the sarking at eaves and apex, or by an alternative eaves-to-apex passage.\nWith skillion roof or flat roof construction, the air volume is significantly reduced, so moisture saturation levels\nare more quickly reached. Also with these roof types, air flow paths are more easily obstructed. In skillion roofs\nwith tongue and groove ceilings, a layer of roof underlay immediately above the ceiling will provide a vapour\ncheck and air barrier to compensate for the porosity of the ceiling. For more advice on skillion roof ventilation,\nsee https://www.branz.co.nz/pubs/branz-facts/roof-ventilation/4-skillion-roofs/\nRoofs continuous over an apex, such as barrel curved roofs or roofs with prickled ridges, must have adequate\nventilation to prevent the accumulation of moisture at the apex.\nLong low-pitched roofs will benefit from increased ventilation which may also assist in minimising thermally\ninduced expansion noise. Ventilation typically increases as the roof pitch increases. Air movement through the\ncrests depends on the spacing and area of the crests, roof pitch, and overall length of the sheeting. Corrugate and\ntrapezoidal roofing provide more ventilation than secret-fix roofing. Ventilation through the crests still depends\non air being allowed to enter at the eaves and escape at the apex.\nTrough or tray section roofs have smaller ventilation channels and may require additional ventilation.\nThe use of profiled closures at eaves or ridge will create a substantial air barrier, and alternative ventilation paths\nmust be created.\nAdditional roof space ventilation may take the form of:\nlouvre vents in gable-ends,\nsoffit vents,\nproprietary ridge vents,\nventilated soft edge strips on transverse flashings, or\nmechanical or wind-powered vents positioned close to the apex.\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n321\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nWhere eave-vent intakes and ridge-vent exits are both employed, the area of the ridge vents should be less than\nthat of the eave vents. More air escaping at the ridge than entering at the eaves can lower the pressure of the\nattic cavity and encourage more ingress of moist air from the dwelling area.\nIn pitches of 30 deg or less cross venting from eaves to eaves alone is generally enough when combined with natural\npassive ventilation at the apex.\nA common rule of thumb is to have a total ventilation cross-section area equal to 1/300 of the ceiling area. In NZ\nbuildings, much smaller ratios have proven sufficient in most cases.\nIncreasing roof space ventilation above the insulation has only a small effect on R values. Ventilation of spaces\nabove bulk insulation is not only desirable but prevents insulation losing effectiveness due to absorbing\nmoisture.\nPartial filling of a ceiling cavity with bulk insulation in flat roofs can severely reduce the amount of free air\navailable to absorb incoming water vapour, thereby increasing saturation levels. Adding insulation while re-roofing\nmust be done with due consideration; unless the amount of ventilation of the cavity is increased or a vapour\ncheck layer is used below the insulation, internal moisture problems can occur.\n10.10.1 \nMethods of Ventilation \nThe primary purpose of ventilation is to replace the moist air in the ceiling cavity with drier air from outdoors.\nAs warm, wet air tends to rise, a vent placed in the soffit or at the lower end of a roof will normally operate as an\nintake vent and a vent at the apex as an exhaust vent, but wind direction can reverse this relationship. Gable-end\nvents or vents aligned horizontally will act as an intake or exhaust depending on the wind direction.\n10.10.1.1 \nSoffit Vents \nSoffit vents can be made in a range of styles to suit the application. As wind pressure differentials are highest at\nthe eaves, they are an efficient ventilation solution and they are also very weather resistant. Soffit vents should\nalways be installed to allow free movement of air into the cavity and should not be blocked on the interior side by\ninsulation or other material.\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n322\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.1.1A Mono-Pitch Sarked Roof to Parapet with Vented Battens\nVented Batten\nSoffit Vent\nPly sarking\nunderlay\nParapet cap\n20mm gap\nCeiling\nSynthetic self support\nIn some applications, vented battens may be needed to increase airflow\n10.10.1.2 \nFascia Vents \nVents above the fascia may require repositioning of the fascia to allow for their depth. Fascia vents should be\nused in conjunction with a high fronted spouting so that the ends of the sheet and the vent are not exposed to\ndriven rain.\n10.10.1.3 \nRidge Vents \nRidge vents, such as continuous or intermittent ridge vents or vented head apron flashings, should always be used\nin conjunction with intake vents at a lower level.\nTo prevent creating negative pressures which can draw more moist internal air into the ceiling space, the free\nsurface area of ridge vents should always be less than that of eaves vents.\nSaturated water vapour can enter the building when commercial ridge vents are subjected to negative pressures\nor at times of high humidity associated with mist or fog. Such water vapour can form condensation on the\nstructural framework and appear as a leak. Ridge vents without adequate intake vents can also lead to leakage.\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n323\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.1.3A Sarked Roof to Ridge Vent\nInsulation\nSoffit\nSoffit vent\nPly sarking\nSynthetic underlay\n20mm gap\nFolded ridge\nCeiling\nSoft Edge\nVented\n10.10.1.4 \nVented Soft Edge \nTypical soft edge is either soft aluminium or perforated aluminium a with PIB rubber backer. The latter is more\ncommon. The PIB rubber, when dressed down on a hot day, can adhere to the roofing surface and prevent the\nescape of air at the apex. By removing all or most of the PIB backing this is avoided, and the perforations in the\naluminium become an effective pathway for trickle ventilation, while still being an effective baffle against wind-\nblown moisture. This product is marketed as vented soft edge and is available from all suppliers.\n10.10.1.4A Vented Soft Edge on Corrugate\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n324\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.1.4B Vented Soft Edge From Underneath \n10.10.1.5 \nTurbine Vents \nWind-driven turbine vents rely on wind to rotate the fan blades. This creates a low-pressure area, so they draw air\nfrom the ventilated area at a greater rate than stationary vents. The amount of air movement can be dampened\nbut is normally uncontrolled; it is developed as a function of wind speed as well as turbine size and efficiency.\nTurbine vents, unlike commercial ridge vents, are unaffected by wind direction and they are less prone to leaking.\n10.10.2 \nBattens \nBattens may be required to create a separation space between the roofing and the underlay. In some applications,\nthey may need to be ventilated to achieve sufficient airflow.\nThe type and number of fixings required to fix the counter battens to the roof structure must meet the design wind\nload, or the roof fasteners should be long enough to achieve the required penetration into the purlin below.\nBattens or counter battens, if not fixed by extended cladding fasteners, can be fixed using countersunk purlin\nscrews or if fixed with hex headed screws, they should be counter-bored before installation to avoid damage to\nthe roof cladding.\nSteel top hat, C or Z sections are also used as counter battens but require an additional insulating spacer to\navoid thermal bridging.\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n325\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.2A Using Z Counter Battens with Insulating Spacers\nZed\nThermal Break\nRoof\nAbsorbent underlay\nInsulation\nSafety mesh\nFoil\nSteel purlin\n20mm \ngap\ncounterbatten\n10.10.3 \nApplied Fleeces \nRoof sheeting is now available with a synthetic fleece applied directly to the underside of the profile. This works\nin the same manner as roofing underlay, absorbing condensation into the fleece and releasing it into the\natmosphere when ambient conditions improve.\nThe fleece follows the contours of the profile. By removing the separate layer of underlay, every crest becomes a\npathway for ventilation. On a gable roof, this will approximately double the air changes in a roof over conventional\nconstruction, without the height disruption, cost, or inconvenience of a ventilated batten.\nAnother advantage of these products is that they greatly increase speed of lay of a roof, and avoid delays due to\nexcessive wind. They are available on all corrugate and trapezoidal profiles.\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n326\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.11 \nUnderlay \nCondensation that forms on the cold under-surface of the roof system must be contained until ambient\nconditions allow it to evaporate. Containment is normally achieved by using an absorbent roofing underlay. It is\nthe role of roofing underlay to absorb moisture temporarily and then release it back into the atmosphere.\nA printable bulletin about installing underlay when reroofing is\navailable at: BU01 Double laying of Underlay on Re-roof\nExtract:\n\"...we recommend that no more than a single layer of compliant underlay (laps\nexcluded) is present on a profiled metal roof.\"\nA common misconception holds that the roofing underlay acts as a drainage plane, channelling condensation\nfrom the underside of the metal roof to the gutter. In practice, most of the condensation forms on the underside\nof the underlay. Although roofing underlays are permeable, they still form a substantial vapour check, and as they\nare in contact with the roof, they are at a similar temperature. Any condensation that does form on the underside\nof the roof and falls onto the underlay generally only tracks down the underlay as far as the next purlin, where it is\ntrapped and absorbed by the underlay. Underlay is also affected by holes from roofing fasteners, making it\nunreliable as a \"second roof\".\nAs it is designed to execute its primary purpose of aiding in the management of internal moisture, underlay\nshould not be used as a compensation for unreliable weatherproofing design and installation\n10.11A Roof Cavity Condensation\nSmall Space:Condensation on \nunderside of cladding;often not muc\nbecause of small air volume.\nCondensation on top can be large \nwhen air is moist and calm.\nPermeable underlay in contact with \ncladding gets cold. The resulting \ncondensation get absorbed by the \nunderlay, which can be significant if \nthe attic air is moist.\nPermeable underlay stays a \nbit warmer, no condensation\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n327\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.11B Condensation Under Roofing Underlay\nMost condensation on the underside of the roof system occurs under the roofing underlay.\nThe presence of pooling condensate on the upper side of a roofing underlay indicates that the absorptive capacity\nof the underlay has been exceeded. Not only the underlay will be saturated, but so will the ceiling structural\nmembers and insulation; mould, corrosion, and decay are inevitable. The cure is to decrease the amount of\nmoisture entering the ceiling cavity or increase ventilation of the ceiling space.\n10.11C Chronic Condensation \nChronic condensation problem caused by induction of moist air into the ceiling cavity. Although the underlay here\nis doing a good job of containing the surface water, the timber trusses, insulation, and ceiling below the underlay\nwere saturated with water.\nUnderlay also acts as a partial air barrier. (Rigid air barriers are also available.) Water will generally only go where\ngravity or air pressure takes it. By effectively reducing the space behind cladding, the underlay allows rapid\npressure equalisation on each side of the cladding, thereby reducing the ability of water to enter the space.\n10.11.1 \nUnderlay Standards \n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n328\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nPermeable underlays must comply with NZS 2295, Amendment 1:2017, as shown in Properties of Roofing\nUnderlay, or have an appropriate product certification such as a Codemark certificate.\nReflective foil underlays must comply with AS/NZS 4200.1:2017\n10.11.1A Minimum Requirements for Underlays for Metal Roof Cladding\nClassification\nR1\nR3\nR2\nR4\nGrade\nHeavyweightHeavyweight\nSelf-\nsupport\nSelf-\nsupport\nType\nKraft\nSynthetic\nKraft\nSynthetic\nApplication\nResidential or light commercial\nbuildings\nProperty\nUnit\nAbsorbency\ng/m\n 150\n 150\n 150\n 150\nWater Vapour\nResistance\nMN s/g 7\n 0.5\n 7\n 0.5\nWater resistance\nmm\nhead\n 100\n 100\n 100\n 100\nTensile Strength\nMD\nKN/m\n 9\n 3\n 11\n 3\nTensile Strength CD KN/m\n 4.5\n 2\n 6\n 2.5\nEdge Tear\nResistance MD\nN\n 40\n 100\n 70\n 150\nEdge Tear\nResistance CD\nN\n 35\n 80\n 55\n 130\nBased on Table B1 of NZS 2295 Amendment 1:2017.\nSelf-supporting (S/S) is defined as strong enough to support its own weight up to a 1200 mm span.\npH between 5.5 and 8.0.\nKraft-based underlays shall have shrinkage less than 0.5% and a maximum run length of 10 m.\nSynthetic underlays may have any run length.\nAny underlay is regarded as fire-retardant if it has a Flammability Index (FI) of 5 or less when tested to AS/NZS\n1530 Part 2.\n10.11.2 \nUnderlay Requirements \nThe NZBC requires underlays under profiled metal roofing and direct-fixed metal wall cladding on lined residential\nbuildings to be both permeable and absorbent. \nUnderlays fixed to the dry side of a lined drained cavity may be permeable and non-absorbent. \nUnderlays are not required in unlined structures, but in such cases non-permeable, non-absorbent underlays such\nas foil are typically used to increase reflectivity and to minimise condensation.\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n329\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nIn some wall and roof applications, the underlay is required to be Fire Retardant with Flammability Index 5 when\ntested to AS1530.2. Refer NZBC C/AS3-AS6, clause 4.17.8 \nUnderlays designated as self-supporting can be laid without support at spans up to 1.2 m.\nOther requirements for underlays vary for different cladding systems, but the important features of absorbency,\npermeability, water resistance, tensile strength, edge tear resistance, PH, and durability are important to comply\nwith the requirements of the NZBC.\nThe Code of Practice recommends synthetic self-supporting fire-retardant underlays for residential roofing\napplications.\n10.11.3 \nTypes Of Underlay \nApart from their fire retardance and ability to self-support, underlays are classified according to their absorbency\nand permeability.\nPermeable and Absorbent:\nKraft paper-based - bitumen impregnated paper\nSynthetic - 2 or 3 layers, using permeable synthetic film strengthened by sandwiched non-woven fabric.\nPermeable, non-absorbent:\nSynthetic permeable non-absorbent underlays are mainly used as wall wrap inside a drained cavity or with\ndirect fixed absorbent claddings.\nNon-Permeable, non-absorbent:\nfoil - Reflective aluminium foil over a flexible substrate. These can be either double-sided or white-faced.\n10.11.4 \nUnderlay Usage \nIn lined buildings and dwellings, an absorbent permeable underlay is required under metal roofs. The same applies\nto direct-fixed steel wall cladding, but underlays used behind a drained cavity are not required to be absorbent.\nFor aesthetic reasons, a foil-faced (or white-faced) vapour check layer may be used in unlined commercial or\nindustrial applications to reduce heat radiation from the roof cladding and provide enhancement of light. For\ninsulated applications, foil is normally used as a vapour check under the insulation and an absorbent permeable\nunderlay used above with a 20 mm gap from the roof cladding.\nOn non-residential dwellings, profiled roof-light sheeting running in continuous lengths from the ridge can have\nmultiple skins to avoid condensation dripping from the sheeting or plastic sheet with a spacer can be used to\nlessen condensation. Roof underlays should not be laid continuously under translucent roof or wall cladding.\n10.11.5 \nUnderlay Durability \n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n330\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nNZBC Clause B2.3.1 requires non-structural building elements and those that are moderately difficult to replace\nto have a durability of 15 years, or, if difficult to replace, to have the same durability as the more durable elements\nof a system. Alternatively, the design should allow the replacement of the less durable elements without\nremoving the more durable components.\nCompliance with NZBC B2, therefore, requires roofing underlay to have durability equal to that of the roof\ncladding and no less than 15 years.\nWhen finishing on an eaves flashing the eaves flashing should finish on the horizontal face of the eaves flashing\nso that is is not exposed to UV or able to flap in the wind.\nAll underlays, particularly those made from synthetics (including some foils), may be vulnerable to degradation\nfrom fumes and reflected UV. Advice should be requested from the supplier when they are to be used in a\nsituation where they may be exposed to fumes or reflected UV.\n10.11.6 \nInstalling Underlay \nUnderlay can be laid vertically or horizontally. Side laps must be a minimum of 150 mm for roofs and 75 mm for\nwalls; end laps must be a minimum of 150 mm for both roof and wall cladding. At the eaves, the underlay should\nterminate on the upper side of the eaves flashing or overhang fascia by no more than 20 mm.\nThe COP recommends that all underlay is terminated at the ridge, and if not it should be slit or slotted to allow\npassive ventilation of the ceiling cavity.\nThe COP allows roof and wall underlay to be laid either vertically or horizontally in all cases. However, that is in\ndivergence with E2/AS1, so it is advised for buildings within the scope of E2/AS1 (ie, buildings designed within\nthe scope of NZS 3604) that the requirements of the local BCA (Building Consent Authority) is sought before\ndiverging from E2/AS1.\nRips smaller than 75 mm on walls or roofs can be repaired using a compatible flashing tape, but roof underlay\ndamage greater than this requires a new piece of underlay captured by the cladding fastenings.\nFlue penetrations must have a minimum distance of 50 mm from the outer liner to any underlay or flammable\nmaterial.\nE2/AS1 requires self-support underlay laid horizontally on support to be used at pitches below 10 deg . That is not a\nrequirement of the COP as underlay support is no substitute for good ventilation design and effective\nweathertight details.\nWhen using vented battens, the underlay should be positioned on the upper side of the batten, directly under the\nroof cladding. Having the underlay directly under the roof allows the battens to vent the roof cavity directly and\nallows the underlay to perform its normal design function; putting roofing underlay under ventilated battens\nimpedes roof cavity ventilation\nWith re-roofs in any material, it is not acceptable to lay a new roof over existing underlay or underlay support,\nunless the latter is in \"as new\" condition. See 14.19 Fixing Aluminium Sheeting.\nWall underlays must have a minimum side lap of 150 mm and an end lap of 75 mm. Wall underlay on a drained\ncavity should be on the dry (inside) face of the cavity, and be rigid enough to restrain wall insulation from\ncontacting the cladding, or have secondary strapping to achieve such.\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n331\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.11.6.1 \nHorizontal Laying \nHorizontally laid underlay must be supported if used under long-run metal roofing, unless both edges are\nsupported by purlins. Under metal tiles, self-supporting underlay can be laid over the roof trusses at spans up to\n1.2 m.\nUnderlay laid horizontally must be laid starting at the lowest point of the roof, running over the bottom purlin and\nmust overlap into the gutter by a maximum of 20 mm to prevent wicking. When an eaves flashing is used the\nunderlay should terminate on the downslope of the flashing.\nTo lay roof underlay horizontally, more than one roll can be progressively unrolled, one roofing sheet width at a\ntime. Running multiple rolls straight can, however, be difficult in windy conditions.\n10.11.6.2 \nVertical Laying \nThe laps on vertically laid roof underlay may face in either direction, as the direction of lay is usually dictated by\nconstruction sequencing or wind direction at the time of laying.\nThe bottom end of vertically laid roof underlay must overlap into the gutter by a maximum of 20 mm to prevent\nwicking. When an eaves flashing is used the underlay should terminate on the downslope of the flashing.\n10.11.6.3 \nUnderlay Support \nSelf-supporting underlays in lined roof spaces may be laid unsupported at spans up to 1.2 m. Other underlays\nmust be supported. Underlay support may be safety mesh, hexagonal galvanised wire netting, builders' tape, or\nother suitably strong and durable material.\nSafety mesh must be designed and installed to comply with the requirements of the AS/NZS 4389:2015\nCorroded galvanised safety mesh and wire netting can be damaging to any metal roofing and especially to pre-\npainted aluminium. Pre-painted aluminium cladding must be protected from contact with potentially corroding\nsteel including netting, staples, or fasteners, See 14.19 Fixing Aluminium Sheeting\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n332\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.12 \nAdditional Information \n10.12.1 \nCold Roofs \nWith cold roof construction, the under-surface temperature of the metal roofing will at times be quite low, so the\nprimary tool of managing condensation is controlling the concentration of water vapour in the attic space. Some\ncondensation is inevitable, and it must be managed to ensure the wetness is not excessive in either degree or\nduration - allowing moisture to accumulate.\nIn typical cold roof construction, the insulation is at ceiling level and there is an air gap between the insulation\nand the roof surface.\n10.12.2 \nWarm Roofs \nWith Warm Roofs, the insulation is in direct continuous contact with the underside of the roof. The most\ncommon form of Warm Roof in New Zealand is pre-formed insulation panel. Other proprietary systems may\nconsist of several layers with a vapour control layer on the underside.\nWarm roofs do not inherently have the same natural ventilation as a cold roof, so the internal environment may\nrequire management to prevent condensation problems.\n10.12.3 \nNight Sky Radiation \nRoof cladding absorbs radiation from the sun and the attic space becomes warmer; some of this\nheat is radiated into a clear sky at night.\nBecause all objects radiate heat to cooler objects, night sky radiation will occur when there are no\nclouds in the sky. The radiation rate depends on the emittance of the roof cladding.\nRadiation to the sky can cause the cladding temperature to drop as much as 5C below that of the\nsurrounding air; that causes dew when the surface temperature reaches dew point or frost if the\ntemperature falls below zero.\n10.12.4 \nThe Mechanics of Condensation \nWater exists in 3 states: solid (ice), liquid (water), and gas (water vapour).\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n333\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.12.4A Hydrogen Bonding\nWater molecules in liquid form bonds, which create a dense material.\nIn ice and liquid water, individual HO molecules bond together in a special way, called 'hydrogen bonding'.\nIn gas form, the kinetic energy of the molecules has overcome these hydrogen bonds, and so the individual water\nmolecules are free to move. The water molecule itself is light compared with other gases in the atmosphere, so it\ntends to migrate upwards, ie, into the roof space.\nWater vapour may condense into a liquid form when the concentration rises or the temperature drops. The\ntemperature at which air can hold no more water is called the 'Dew Point'. The water vapour capacity of air is\nrelative to temperature.\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n334\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.12.4B Shower Condensation\nThe high humidity created while showering causes condensation on even relatively warm surfaces because of the\nhigh concentration of vapour.\n10.12.4C Condensation on a Cold Surface\nIn warm conditions, condensation will form on a cold surface, even when the concentration of water vapour in the\natmosphere is low.\n10.12.5 \nRelative Humidity \nRH is strongly dependent on temperature. For instance, a parcel of air at 15 deg C and 50% RH is cooled down to\nhaving increased. Relative Humidity expresses how close the air is to being saturated with water vapour. Warm\nair can hold more moisture in absolute terms, cold air less. If the air becomes saturated (RH 100%) water vapour\nwill condense as mist in the air or as water on adjacent cold surfaces. \nRelative humidity is a suitable measure when the risk of condensation on surfaces or mould growth is to be\nevaluated. \n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n335\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.12.6 \nAbsolute Humidity \nAbsolute Humidity is measured in grams of water per volume of air (grams per cubic metre [g/m ]). It is not\ntemperature dependent and in the example above the absolute humidity would remain unchanged at around 6.4\ng/m , regardless of the temperature change.\nAbsolute humidity is a suitable measure if one is looking for sources or sinks of water in an environment where\ntemperature is changing. If the absolute humidity is cycling during the day, eg, increases in a roof cavity as the\ntemperature rises during the day. It could indicate that moisture is released by the building materials during the\nday and absorbed or condenses during the cooler nights. \n10.12.7 \nWater Vapour Pressure \nWater Vapour Pressure is more based on the fundamental physics and expresses the contribution (ie, the partial\npressure) of water vapour to the total pressure of an air mix. For example, at a pressure of 1000 Pa (1kPa), the\npartial pressure of nitrogen may be 700 Pa, the partial pressure of oxygen 200 Pa and the partial pressure of water\nvapour 99 Pa, and other gases 1 Pa. \nThis parameter is useful to evaluate moisture migration from one point in the building to another. \n3\n3\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n336\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336],"subsections":[{"number":"10.1","title":"NZBC Clause E3: Internal Moisture (Extract)","level":2,"content":"10.1 \nNZBC Clause E3: Internal Moisture (Extract) \nSource: Acceptable Solutions and Verifications for New Zealand Building Clause E3 Internal moisture.\n10.1.1 \nE3 Objective \nSafeguard people against illness, injury, or loss of amenity that could result from the accumulation of internal\nmoisture.\n10.1.2 \nE3 Functional Requirements \nBuildings must be constructed in a way to avoid the likelihood of:\nfungal growth on linings and other building elements, and\ndamage to building elements due to the presence of moisture.\n10.1.3 \nE3 Performance Requirements \nNZBC Clause E3 requires building practices to ensure an adequate combination of thermal resistance,\nventilation, and space temperature in all habitable spaces, bathrooms, laundries, and other spaces where\nmoisture may be generated or accumulate.\n10.1.4 \nCompliance \nNew Zealand Building Code clause E3.3 a) requires buildings to be constructed to avoid the likelihood of fungal\ngrowth on linings and other building elements. Acceptable Solution E3/AS1 1.0.1 says fungal growth can be\navoided by minimising internal condensation. While it gives no prescriptive solutions for achieving this, it has\nbeen shown that venting ceiling spaces has a significant effect not only in minimising the growth of mould in\nceiling spaces and ceilings, but also improves the air quality within the occupied spaces of a dwelling.\nIncreased levels of ceiling insulation results in less heat escape into the ceiling cavity. This lowers the\ntemperature of the ceiling cavity, which lowers the dew point, increasing the frequency and severity of\ncondensation. This can not only cause problems with mould growth and occupant health, but excess moisture\ncan also affect the durability of the roof and the structure.\n 10 INTERNAL MOISTURE\n 10 \n 1 \n 10 \n 10.1 \n305\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nIn addition, E2.3.6 requires that excess moisture present at the completion of construction must be capable of\nbeing dissipated without permanent damage to building elements. This is particularly relevant to dwellings with\nconcrete floors or party walls which will exude moisture for extended periods during the curing process.\nThe COP requires details that enable free passage of air from eaves to ridge of all roofs of dwellings and requires\nspecial ventilation design for:\nflat roofs,\nsarked roofs,\nskillion roofs,\nbarrel curved and prickle-ridged roofs, and\nroofs with ceilings which allow easy passage of moisture vapour.\nLong (over 12 m spans), shallow-pitched (less than 12 deg ) roofs should also be designed to allow natural\nventilation.\nGenerally, there is no need to make provision for moisture control in industrial and most commercial buildings\ndue to them being either well-ventilated or climate-controlled. In buildings with valuable or delicate stock, the\npossibility of dripping condensation needs to be assessed.\n10.1.4A Mould Caused by Excess\nMoisture\n10.1.4B Durability Issues Due to Excess\nMoisture\n 10 INTERNAL MOISTURE\n 10 \n 1 \n 10 \n 10.1 \n306\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nRoofs in cold areas where numbers of people may come in wet at the end of the day, such as ski lodges and\ntramping huts, require specific design.\nBuildings designed to accommodate large numbers of people (such as theatres, sports areas and educational\nbuildings) and areas creating particularly high moisture levels (e.g. swimming pools) should have ventilation\nsolutions designed by a specialist engineer.\n 10 INTERNAL MOISTURE\n 10 \n 1 \n 10 \n 10.1 \n307\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[305,306,307],"subsections":[{"number":"10.1.1","title":"E3 Objective","level":3,"content":"10.1 \nNZBC Clause E3: Internal Moisture (Extract) \nSource: Acceptable Solutions and Verifications for New Zealand Building Clause E3 Internal moisture.\n10.1.1 \nE3 Objective \nSafeguard people against illness, injury, or loss of amenity that could result from the accumulation of internal\nmoisture.\n10.1.2 \nE3 Functional Requirements \nBuildings must be constructed in a way to avoid the likelihood of:\nfungal growth on linings and other building elements, and\ndamage to building elements due to the presence of moisture.\n10.1.3 \nE3 Performance Requirements \nNZBC Clause E3 requires building practices to ensure an adequate combination of thermal resistance,\nventilation, and space temperature in all habitable spaces, bathrooms, laundries, and other spaces where\nmoisture may be generated or accumulate.\n10.1.4 \nCompliance \nNew Zealand Building Code clause E3.3 a) requires buildings to be constructed to avoid the likelihood of fungal\ngrowth on linings and other building elements. Acceptable Solution E3/AS1 1.0.1 says fungal growth can be\navoided by minimising internal condensation. While it gives no prescriptive solutions for achieving this, it has\nbeen shown that venting ceiling spaces has a significant effect not only in minimising the growth of mould in\nceiling spaces and ceilings, but also improves the air quality within the occupied spaces of a dwelling.\nIncreased levels of ceiling insulation results in less heat escape into the ceiling cavity. This lowers the\ntemperature of the ceiling cavity, which lowers the dew point, increasing the frequency and severity of\ncondensation. This can not only cause problems with mould growth and occupant health, but excess moisture\ncan also affect the durability of the roof and the structure.\n 10 INTERNAL MOISTURE\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n305\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[305]},{"number":"10.1.2","title":"E3 Functional Requirements","level":3,"content":"10.1 \nNZBC Clause E3: Internal Moisture (Extract) \nSource: Acceptable Solutions and Verifications for New Zealand Building Clause E3 Internal moisture.\n10.1.1 \nE3 Objective \nSafeguard people against illness, injury, or loss of amenity that could result from the accumulation of internal\nmoisture.\n10.1.2 \nE3 Functional Requirements \nBuildings must be constructed in a way to avoid the likelihood of:\nfungal growth on linings and other building elements, and\ndamage to building elements due to the presence of moisture.\n10.1.3 \nE3 Performance Requirements \nNZBC Clause E3 requires building practices to ensure an adequate combination of thermal resistance,\nventilation, and space temperature in all habitable spaces, bathrooms, laundries, and other spaces where\nmoisture may be generated or accumulate.\n10.1.4 \nCompliance \nNew Zealand Building Code clause E3.3 a) requires buildings to be constructed to avoid the likelihood of fungal\ngrowth on linings and other building elements. Acceptable Solution E3/AS1 1.0.1 says fungal growth can be\navoided by minimising internal condensation. While it gives no prescriptive solutions for achieving this, it has\nbeen shown that venting ceiling spaces has a significant effect not only in minimising the growth of mould in\nceiling spaces and ceilings, but also improves the air quality within the occupied spaces of a dwelling.\nIncreased levels of ceiling insulation results in less heat escape into the ceiling cavity. This lowers the\ntemperature of the ceiling cavity, which lowers the dew point, increasing the frequency and severity of\ncondensation. This can not only cause problems with mould growth and occupant health, but excess moisture\ncan also affect the durability of the roof and the structure.\n 10 INTERNAL MOISTURE\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n305\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[305]},{"number":"10.1.3","title":"E3 Performance Requirements","level":3,"content":"10.1 \nNZBC Clause E3: Internal Moisture (Extract) \nSource: Acceptable Solutions and Verifications for New Zealand Building Clause E3 Internal moisture.\n10.1.1 \nE3 Objective \nSafeguard people against illness, injury, or loss of amenity that could result from the accumulation of internal\nmoisture.\n10.1.2 \nE3 Functional Requirements \nBuildings must be constructed in a way to avoid the likelihood of:\nfungal growth on linings and other building elements, and\ndamage to building elements due to the presence of moisture.\n10.1.3 \nE3 Performance Requirements \nNZBC Clause E3 requires building practices to ensure an adequate combination of thermal resistance,\nventilation, and space temperature in all habitable spaces, bathrooms, laundries, and other spaces where\nmoisture may be generated or accumulate.\n10.1.4 \nCompliance \nNew Zealand Building Code clause E3.3 a) requires buildings to be constructed to avoid the likelihood of fungal\ngrowth on linings and other building elements. Acceptable Solution E3/AS1 1.0.1 says fungal growth can be\navoided by minimising internal condensation. While it gives no prescriptive solutions for achieving this, it has\nbeen shown that venting ceiling spaces has a significant effect not only in minimising the growth of mould in\nceiling spaces and ceilings, but also improves the air quality within the occupied spaces of a dwelling.\nIncreased levels of ceiling insulation results in less heat escape into the ceiling cavity. This lowers the\ntemperature of the ceiling cavity, which lowers the dew point, increasing the frequency and severity of\ncondensation. This can not only cause problems with mould growth and occupant health, but excess moisture\ncan also affect the durability of the roof and the structure.\n 10 INTERNAL MOISTURE\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n305\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[305]},{"number":"10.1.4","title":"Compliance","level":3,"content":"10.1 \nNZBC Clause E3: Internal Moisture (Extract) \nSource: Acceptable Solutions and Verifications for New Zealand Building Clause E3 Internal moisture.\n10.1.1 \nE3 Objective \nSafeguard people against illness, injury, or loss of amenity that could result from the accumulation of internal\nmoisture.\n10.1.2 \nE3 Functional Requirements \nBuildings must be constructed in a way to avoid the likelihood of:\nfungal growth on linings and other building elements, and\ndamage to building elements due to the presence of moisture.\n10.1.3 \nE3 Performance Requirements \nNZBC Clause E3 requires building practices to ensure an adequate combination of thermal resistance,\nventilation, and space temperature in all habitable spaces, bathrooms, laundries, and other spaces where\nmoisture may be generated or accumulate.\n10.1.4 \nCompliance \nNew Zealand Building Code clause E3.3 a) requires buildings to be constructed to avoid the likelihood of fungal\ngrowth on linings and other building elements. Acceptable Solution E3/AS1 1.0.1 says fungal growth can be\navoided by minimising internal condensation. While it gives no prescriptive solutions for achieving this, it has\nbeen shown that venting ceiling spaces has a significant effect not only in minimising the growth of mould in\nceiling spaces and ceilings, but also improves the air quality within the occupied spaces of a dwelling.\nIncreased levels of ceiling insulation results in less heat escape into the ceiling cavity. This lowers the\ntemperature of the ceiling cavity, which lowers the dew point, increasing the frequency and severity of\ncondensation. This can not only cause problems with mould growth and occupant health, but excess moisture\ncan also affect the durability of the roof and the structure.\n 10 INTERNAL MOISTURE\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n305\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[305]},{"number":"10.1.4A","title":"Mould Caused by Excess Moisture","level":3,"content":"In addition, E2.3.6 requires that excess moisture present at the completion of construction must be capable of\nbeing dissipated without permanent damage to building elements. This is particularly relevant to dwellings with\nconcrete floors or party walls which will exude moisture for extended periods during the curing process.\nThe COP requires details that enable free passage of air from eaves to ridge of all roofs of dwellings and requires\nspecial ventilation design for:\nflat roofs,\nsarked roofs,\nskillion roofs,\nbarrel curved and prickle-ridged roofs, and\nroofs with ceilings which allow easy passage of moisture vapour.\nLong (over 12 m spans), shallow-pitched (less than 12 deg ) roofs should also be designed to allow natural\nventilation.\nGenerally, there is no need to make provision for moisture control in industrial and most commercial buildings\ndue to them being either well-ventilated or climate-controlled. In buildings with valuable or delicate stock, the\npossibility of dripping condensation needs to be assessed.\nMoisture\n10.1.4B Durability Issues Due to Excess\nMoisture\n 10 INTERNAL MOISTURE\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n306\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[306],"images":[{"filename":"mould-caused-by-excess-moisture-detail-05.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/mould-caused-by-excess-moisture-detail-05.png","caption":"","dimensions":{"width":228,"height":166}},{"filename":"mould-caused-by-excess-moisture-detail-06.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/mould-caused-by-excess-moisture-detail-06.png","caption":"","dimensions":{"width":231,"height":164}},{"filename":"mould-caused-by-excess-moisture-detail-07.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/mould-caused-by-excess-moisture-detail-07.png","caption":"","dimensions":{"width":211,"height":163}}]},{"number":"10.1.4B","title":"Durability Issues Due to Excess Moisture","level":3,"content":"In addition, E2.3.6 requires that excess moisture present at the completion of construction must be capable of\nbeing dissipated without permanent damage to building elements. This is particularly relevant to dwellings with\nconcrete floors or party walls which will exude moisture for extended periods during the curing process.\nThe COP requires details that enable free passage of air from eaves to ridge of all roofs of dwellings and requires\nspecial ventilation design for:\nflat roofs,\nsarked roofs,\nskillion roofs,\nbarrel curved and prickle-ridged roofs, and\nroofs with ceilings which allow easy passage of moisture vapour.\nLong (over 12 m spans), shallow-pitched (less than 12 deg ) roofs should also be designed to allow natural\nventilation.\nGenerally, there is no need to make provision for moisture control in industrial and most commercial buildings\ndue to them being either well-ventilated or climate-controlled. In buildings with valuable or delicate stock, the\npossibility of dripping condensation needs to be assessed.\n10.1.4A Mould Caused by Excess\nMoisture\nMoisture\n 10 INTERNAL MOISTURE\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n306\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nRoofs in cold areas where numbers of people may come in wet at the end of the day, such as ski lodges and\ntramping huts, require specific design.\nBuildings designed to accommodate large numbers of people (such as theatres, sports areas and educational\nbuildings) and areas creating particularly high moisture levels (e.g. swimming pools) should have ventilation\nsolutions designed by a specialist engineer.\n 10 INTERNAL MOISTURE\n 10 \n 10.1 NZBC CLAUSE E3: INTERNAL MOISTURE (EXTRACT)\n 1 \n 10 \n 10.1 \n307\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[306,307]}]},{"number":"10.2","title":"Why Manage Internal Moisture","level":2,"content":"10.2 \nWhy Manage Internal Moisture \nInternal air quality is a major cause of respiratory illness, which has been reported as costing the country $6\nbillion per annum, with respiratory-related illnesses accounting for one in ten of overnight hospital admissions.\nDust mites grow up to ten times faster in damp environments and contribute to allergic reactions and asthma.\nThe most recent BRANZ Home Condition Survey identified mould ranging from moderate to severe in 22% of New\nZealand houses. Mould was worst in rental accommodation, where much of our most vulnerable population live.\nIn addition to the health effects, excessive internal moisture impacts material durability. In the roof space, this\ncan affect the roof cladding, underlay, purlins, trusses, fasteners, and seriously affect the durability and structural\nintegrity of those components without being apparent to the occupants.\n 10 INTERNAL MOISTURE\n 10 \n 2 \n 10 \n 10.2 \n308\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[308]},{"number":"10.3","title":"Special Requirements","level":2,"content":"10.3 \nSpecial Requirements \nBuildings of the following types using metal cladding should have a sealed vapour barrier and are outside the\nscope of this Code of Practice. They require specific design.\nSwimming pools.\nBuildings containing liquids stored in open containers.\nBuildings where water is used in manufacturing, cleaning or storage processes.\nIce rinks, cold stores and freezers.\nBuildings where unvented gas heating is used.\n 10 INTERNAL MOISTURE\n 10 \n 3 \n 10 \n 10.3 \n309\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[309]},{"number":"10.4","title":"Condensation","level":2,"content":"10.4 \nCondensation \nCondensation is a natural phenomenon and building materials are capable of withstanding repeated short-term\nepisodes of wetness. Problems arise in ceiling spaces when more water vapour enters than exits, and materials\nstay wet for long periods, or where standing water accumulates.\nThe primary purpose of roof cladding is to act as a rain screen so that no water enters the building from the\noutside. It is, however, equally important to ensure that the building is kept dry from inside. Because metal is a\ngood heat conductor and is not absorbent, condensation forms on metal cladding under conditions of high\nhumidity when surface temperatures drop below the dew point.\nThe solutions in the Code of Practice apply to cold roofs, where there is a gap between the ceiling insulation and\nthe roofing material. 10.12.2 Warm Roofs require specific design to avoid internal moisture problems. They are\ndiscussed in more detail under 15.5 Warm Roofs.\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10.4 \n310\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[310]},{"number":"10.5","title":"Building Airtightness","level":2,"content":"10.5 \nBuilding Airtightness \n10.5A NZS 3602:1975 (Lapsed)\nChanging building techniques and materials - eg, impervious cladding and linings, and aluminium joinery - have\nled to buildings becoming progressively more airtight. Many of these changes have been led by the desire to\nincrease energy efficiency. Other building changes include unsealed downlights, which can allow ready entry of\nwater vapour into the ceiling space, and the demise of the open fireplace which provided considerable ventilation\nto the living areas of a home.\nOccupant behaviour has also changed. More families shower daily and then leave the house unoccupied and\nclosed-up for much of the day and night. Less activity means a low level of air changes per hour.\nThese changes can lead to internal moisture problems. As water vapour is lighter than other atmospheric gases,\nmuch of the moisture tends to migrate upwards into the ceiling cavity.\n 10 INTERNAL MOISTURE\n 10 \n 5 \n 10 \n 10.5 \n311\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.5B BRANZ Survey showing changes in permeability on NZ houses over time\nPre 1960 60-69\n70-79\n80-89\n90-99 2000's\nAir changes per hour @ 50Pa\n0\n5\n10\n15\n20\n25\n30\n35\n 10 INTERNAL MOISTURE\n 10 \n 5 \n 10 \n 10.5 \n312\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[311,312],"subsections":[{"number":"10.5A","title":"NZS 3602:1975 (Lapsed)","level":3,"content":"10.5 \nBuilding Airtightness \nChanging building techniques and materials - eg, impervious cladding and linings, and aluminium joinery - have\nled to buildings becoming progressively more airtight. Many of these changes have been led by the desire to\nincrease energy efficiency. Other building changes include unsealed downlights, which can allow ready entry of\nwater vapour into the ceiling space, and the demise of the open fireplace which provided considerable ventilation\nto the living areas of a home.\nOccupant behaviour has also changed. More families shower daily and then leave the house unoccupied and\nclosed-up for much of the day and night. Less activity means a low level of air changes per hour.\nThese changes can lead to internal moisture problems. As water vapour is lighter than other atmospheric gases,\nmuch of the moisture tends to migrate upwards into the ceiling cavity.\n 10 INTERNAL MOISTURE\n 10 \n 10.5 BUILDING AIRTIGHTNESS\n 5 \n 10 \n 10.5 \n311\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[311],"images":[{"filename":"nzs-3602-1975-lapsed-detail-03.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/nzs-3602-1975-lapsed-detail-03.png","caption":"","dimensions":{"width":586,"height":264}}]},{"number":"10.5B","title":"BRANZ Survey showing changes in permeability on NZ houses over time","level":3,"content":"Pre 1960 60-69\n70-79\n80-89\n90-99 2000's\nAir changes per hour @ 50Pa\n0\n5\n10\n15\n20\n25\n30\n35\n 10 INTERNAL MOISTURE\n 10 \n 10.5 BUILDING AIRTIGHTNESS\n 5 \n 10 \n 10.5 \n312\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[312]}]},{"number":"10.6","title":"Insulation","level":2,"content":"10.6 \nInsulation \nThe increase in ceiling insulation standards helps prevent heat leakage into the ceiling space, but it does not\naffect the passage of water vapour. Ceiling insulation excludes more heat from the ceiling cavity, resulting in\ncolder cavity air temperatures. Warmer air can hold more water vapour than cold air. Therefore, colder\ntemperatures in the ceiling cavity lead to an increased risk of condensation.\n10.6.1 \nInsulation Position \nInsulation must be positioned so that there is a gap of at least 20 mm between insulation and roofing. On flat\nceilings, or buildings without eaves, it must be placed so the gap is maintained at the eaves or an eaves\ninsulation barrier should be fitted. To achieve this, an eaves insulation barrier may be required.\n10.6.2 \nOther Insulation \nReflective foils are not defined as insulating, because they are only somewhat effective against radiative heat\nloss and have little impact on conductive and convective mechanisms. They also increase the potential for\nelectrocution. As they are non-absorbent, they are not permitted as residential roofing underlay in New Zealand.\nWhen Polyester blanket insulation is used in conjunction with metal roof cladding, special roofing screws should\nbe used to avoid binding.\nComposite insulated metal panels are described in 15.5 Warm Roofs.\nInsulation must not be laid over the purlins as this compromises the air gap and the efficiency of the insulation\nwhere the roofing compresses it.\n 10 INTERNAL MOISTURE\n 10 \n 6 \n 10 \n 10.6 \n313\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[313],"subsections":[{"number":"10.6.1","title":"Insulation Position","level":3,"content":"10.6 \nInsulation \nThe increase in ceiling insulation standards helps prevent heat leakage into the ceiling space, but it does not\naffect the passage of water vapour. Ceiling insulation excludes more heat from the ceiling cavity, resulting in\ncolder cavity air temperatures. Warmer air can hold more water vapour than cold air. Therefore, colder\ntemperatures in the ceiling cavity lead to an increased risk of condensation.\n10.6.1 \nInsulation Position \nInsulation must be positioned so that there is a gap of at least 20 mm between insulation and roofing. On flat\nceilings, or buildings without eaves, it must be placed so the gap is maintained at the eaves or an eaves\ninsulation barrier should be fitted. To achieve this, an eaves insulation barrier may be required.\n10.6.2 \nOther Insulation \nReflective foils are not defined as insulating, because they are only somewhat effective against radiative heat\nloss and have little impact on conductive and convective mechanisms. They also increase the potential for\nelectrocution. As they are non-absorbent, they are not permitted as residential roofing underlay in New Zealand.\nWhen Polyester blanket insulation is used in conjunction with metal roof cladding, special roofing screws should\nbe used to avoid binding.\nComposite insulated metal panels are described in 15.5 Warm Roofs.\nInsulation must not be laid over the purlins as this compromises the air gap and the efficiency of the insulation\nwhere the roofing compresses it.\n 10 INTERNAL MOISTURE\n 10 \n 10.6 INSULATION\n 6 \n 10 \n 10.6 \n313\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[313]},{"number":"10.6.2","title":"Other Insulation","level":3,"content":"10.6 \nInsulation \nThe increase in ceiling insulation standards helps prevent heat leakage into the ceiling space, but it does not\naffect the passage of water vapour. Ceiling insulation excludes more heat from the ceiling cavity, resulting in\ncolder cavity air temperatures. Warmer air can hold more water vapour than cold air. Therefore, colder\ntemperatures in the ceiling cavity lead to an increased risk of condensation.\n10.6.1 \nInsulation Position \nInsulation must be positioned so that there is a gap of at least 20 mm between insulation and roofing. On flat\nceilings, or buildings without eaves, it must be placed so the gap is maintained at the eaves or an eaves\ninsulation barrier should be fitted. To achieve this, an eaves insulation barrier may be required.\n10.6.2 \nOther Insulation \nReflective foils are not defined as insulating, because they are only somewhat effective against radiative heat\nloss and have little impact on conductive and convective mechanisms. They also increase the potential for\nelectrocution. As they are non-absorbent, they are not permitted as residential roofing underlay in New Zealand.\nWhen Polyester blanket insulation is used in conjunction with metal roof cladding, special roofing screws should\nbe used to avoid binding.\nComposite insulated metal panels are described in 15.5 Warm Roofs.\nInsulation must not be laid over the purlins as this compromises the air gap and the efficiency of the insulation\nwhere the roofing compresses it.\n 10 INTERNAL MOISTURE\n 10 \n 10.6 INSULATION\n 6 \n 10 \n 10.6 \n313\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[313]}]},{"number":"10.7","title":"Climate","level":2,"content":"10.7 \nClimate \nBeing narrow, mountainous, islands lying in the path of strong prevailing winds, New Zealand is subject to high\nrainfall and high humidity. Compared to much of the world - where 70% relative humidity is considered the\nthreshold of corrosion and health problems - New Zealand has very high humidity, particularly in northern\nregions, where the mean annual humidity levels are often around 80% or more. This means the dew point\n(temperature at which condensation begins to form) is also higher than in colder but drier climates.\nThe design requirements to deal with this environment are specific to New Zealand, which is reflected in our\nbuilding practices. It is not advisable to use design or installation practices from countries with different\nenvironmental conditions without a comprehensive assessment of the management of internal moisture under\nNZ conditions.\n10.7.1 \nHumidity \nRelative humidity (RH, given in per cent [%]), is the most widely known method: It gives the content of water\nvapour in the air relative to the maximum amount of water this parcel of air can hold at its present temperature.\nOther measures are absolute humidity and water vapour pressure.\n 10 INTERNAL MOISTURE\n 10 \n 7 \n 10 \n 10.7 \n314\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[314],"subsections":[{"number":"10.7.1","title":"Humidity","level":3,"content":"10.7 \nClimate \nBeing narrow, mountainous, islands lying in the path of strong prevailing winds, New Zealand is subject to high\nrainfall and high humidity. Compared to much of the world - where 70% relative humidity is considered the\nthreshold of corrosion and health problems - New Zealand has very high humidity, particularly in northern\nregions, where the mean annual humidity levels are often around 80% or more. This means the dew point\n(temperature at which condensation begins to form) is also higher than in colder but drier climates.\nThe design requirements to deal with this environment are specific to New Zealand, which is reflected in our\nbuilding practices. It is not advisable to use design or installation practices from countries with different\nenvironmental conditions without a comprehensive assessment of the management of internal moisture under\nNZ conditions.\n10.7.1 \nHumidity \nRelative humidity (RH, given in per cent [%]), is the most widely known method: It gives the content of water\nvapour in the air relative to the maximum amount of water this parcel of air can hold at its present temperature.\nOther measures are absolute humidity and water vapour pressure.\n 10 INTERNAL MOISTURE\n 10 \n 10.7 CLIMATE\n 7 \n 10 \n 10.7 \n314\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[314]}]},{"number":"10.8","title":"Moisture Sources","level":2,"content":"10.8 \nMoisture Sources \nEveryday household activities, heating, indoor plants, pets and construction activities all contribute to indoor\nmoisture.\n10.8.1 \nOccupant Behaviour \nThe occupants of the building create a significant amount of water vapour. Therefore, the air inside in a building\ntypically has a higher moisture content than the external atmosphere.\nBathing and showering, cooking, heating, indoor laundries, and unvented clothes drying are the most obvious\nsources of water; respiration, perspiration, indoor plants, and pets also produce moisture.\nAreas for moisture-generating activities should be well ventilated and the entire building should be mechanically\nventilated to outside the structure. Proposed changes to NZBC G4/AS1 will require venting to the outside of\nappliances such as showers, baths, and cooktops.\n10.8.1A Everyday Activities Release\nMoisture Vapour\n10.8.1B Approximate Amount of Water\nVapour from Occupant Behaviour\nOccupant\nbehaviour\nEstimated Amount of Water\nReleased (per 2.5\ninhabitants)\nCooking\n(unventilated)\n3.0 L / day.\nBaths / Showers\n1.5 L/day. \nClothes Washing\n0.5 L/ day.\nClothes drying\n(unvented)\n5.0 L/ load.\nDishwashing\n1.0 L / day.\nPortable gas\nheater\nup to 1.6 litres per 1kg of gas\nburned.\nBreathing \n(average)\n3 litres per day.\nBreathing asleep\n(per hour)\n(average)\n50 ml.\nPerspiration \n0.5 litre per day.\nPot Plants\nThe same amount as the\ninput\n 10 INTERNAL MOISTURE\n 10 \n 8 \n 10 \n 10.8 \n315\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.8.2 \nHeating \nSome other sources of moisture are best avoided altogether, particularly unvented gas heating and kerosene\nheaters. Burning 1 kg of gas can release 1.6 litres of moisture into the atmosphere.\n10.8.3 \nMechanical Venting \nSupply-driven and exhaust-driven mechanical ventilation systems can pressurise or depressurise internal\natmospheres in different areas of the building. Supply-driven systems can be problematic as increased internal\npressures can drive moist air into the attic through openings in the ceiling.\nExhaust-driven systems can de-pressurise internal areas and increase the intake of moist external air, e.g. ground\nmoisture via a vented cavity. Unbalanced mechanical ventilation can also encourage moisture migration by\ncreating negative pressures in the ceiling cavity. These systems need to be well designed and maintained to avoid\nthe risk of affecting internal moisture. A balanced mechanical ventilation system, where both intake and exhaust\nare connected to the outside, is the preferred system and will be most effective when the thermal envelope of the\nbuilding is airtight.\n10.8.4 \nConstruction Moisture \nDuring construction, timber can become wet and take some time to dry out. Some activities, such as plastering\nand painting, also release water vapour.\nConcrete floors are particularly prolific sources of moisture. During curing, a 100 mm thick concrete slab\nreleases approximately 10 litres of water vapour per square metre of surface area. The curing period depends on\nvarious factors, but as a rule of thumb, a concrete floor cures at a depth-rate of 25 mm per month. Therefore, a\nconcrete slab can affect internal moisture levels for a considerable period.\nAll new buildings, particularly those with concrete floors, must be kept well ventilated (at much higher levels than\nrequired during normal use) until moisture levels of construction materials have stabilised.\n 10 INTERNAL MOISTURE\n 10 \n 8 \n 10 \n 10.8 \n316\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.8.4A Mould Damage\nThis building suffered mould damage to underlay and roof truss even before occupants moved in.\n10.8.5 \nGround Moisture \nGround moisture can infiltrate living spaces by way of the floor or directly to the ceiling space by way of vented\ncavities. The cavity should be constructed to prevent the migration of water vapour into the ceiling space. Wet\nsubfloors can be isolated by laying polythene tightly over the surface and taping all joints. More information can\nbe obtained from the Good Repair Guide: Damp Subfloors (BRANZ).\nConcrete floors must be installed over a damp-proof membrane (DPM) to ensure that moisture from within the\nground does not penetrate the slab. This membrane can be formed by a polyethene sheet that is taped at the laps\nand laid over compacted hard fill topped by a sand blinding layer. The DPM must be installed under the full extent\nof the slab, under any internal or perimeter foundations, extend up to the external edge of the floor slab, and\nlapped and sealed under the wall damp-proofing system.\n 10 INTERNAL MOISTURE\n 10 \n 8 \n 10 \n 10.8 \n317\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[315,316,317],"subsections":[{"number":"10.8.1","title":"Occupant Behaviour","level":3,"content":"10.8 \nMoisture Sources \nEveryday household activities, heating, indoor plants, pets and construction activities all contribute to indoor\nmoisture.\n10.8.1 \nOccupant Behaviour \nThe occupants of the building create a significant amount of water vapour. Therefore, the air inside in a building\ntypically has a higher moisture content than the external atmosphere.\nBathing and showering, cooking, heating, indoor laundries, and unvented clothes drying are the most obvious\nsources of water; respiration, perspiration, indoor plants, and pets also produce moisture.\nAreas for moisture-generating activities should be well ventilated and the entire building should be mechanically\nventilated to outside the structure. Proposed changes to NZBC G4/AS1 will require venting to the outside of\nappliances such as showers, baths, and cooktops.\n10.8.1A Everyday Activities Release\nMoisture Vapour\n10.8.1B Approximate Amount of Water\nVapour from Occupant Behaviour\nOccupant\nbehaviour\nEstimated Amount of Water\nReleased (per 2.5\ninhabitants)\nCooking\n(unventilated)\n3.0 L / day.\nBaths / Showers\n1.5 L/day. \nClothes Washing\n0.5 L/ day.\nClothes drying\n(unvented)\n5.0 L/ load.\nDishwashing\n1.0 L / day.\nPortable gas\nheater\nup to 1.6 litres per 1kg of gas\nburned.\nBreathing \n(average)\n3 litres per day.\nBreathing asleep\n(per hour)\n(average)\n50 ml.\nPerspiration \n0.5 litre per day.\nPot Plants\nThe same amount as the\ninput\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n315\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[315],"images":[{"filename":"occupant-behaviour-detail-03.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/occupant-behaviour-detail-03.png","caption":"","dimensions":{"width":281,"height":286}}]},{"number":"10.8.1A","title":"Everyday Activities Release Moisture Vapour","level":3,"content":"10.8 \nMoisture Sources \nEveryday household activities, heating, indoor plants, pets and construction activities all contribute to indoor\nmoisture.\n10.8.1 \nOccupant Behaviour \nThe occupants of the building create a significant amount of water vapour. Therefore, the air inside in a building\ntypically has a higher moisture content than the external atmosphere.\nBathing and showering, cooking, heating, indoor laundries, and unvented clothes drying are the most obvious\nsources of water; respiration, perspiration, indoor plants, and pets also produce moisture.\nAreas for moisture-generating activities should be well ventilated and the entire building should be mechanically\nventilated to outside the structure. Proposed changes to NZBC G4/AS1 will require venting to the outside of\nappliances such as showers, baths, and cooktops.\nMoisture Vapour\n10.8.1B Approximate Amount of Water\nVapour from Occupant Behaviour\nOccupant\nbehaviour\nEstimated Amount of Water\nReleased (per 2.5\ninhabitants)\nCooking\n(unventilated)\n3.0 L / day.\nBaths / Showers\n1.5 L/day. \nClothes Washing\n0.5 L/ day.\nClothes drying\n(unvented)\n5.0 L/ load.\nDishwashing\n1.0 L / day.\nPortable gas\nheater\nup to 1.6 litres per 1kg of gas\nburned.\nBreathing \n(average)\n3 litres per day.\nBreathing asleep\n(per hour)\n(average)\n50 ml.\nPerspiration \n0.5 litre per day.\nPot Plants\nThe same amount as the\ninput\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n315\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[315]},{"number":"10.8.1B","title":"Approximate Amount of Water Vapour from Occupant Behaviour","level":3,"content":"10.8 \nMoisture Sources \nEveryday household activities, heating, indoor plants, pets and construction activities all contribute to indoor\nmoisture.\n10.8.1 \nOccupant Behaviour \nThe occupants of the building create a significant amount of water vapour. Therefore, the air inside in a building\ntypically has a higher moisture content than the external atmosphere.\nBathing and showering, cooking, heating, indoor laundries, and unvented clothes drying are the most obvious\nsources of water; respiration, perspiration, indoor plants, and pets also produce moisture.\nAreas for moisture-generating activities should be well ventilated and the entire building should be mechanically\nventilated to outside the structure. Proposed changes to NZBC G4/AS1 will require venting to the outside of\nappliances such as showers, baths, and cooktops.\n10.8.1A Everyday Activities Release\nMoisture Vapour\nVapour from Occupant Behaviour\nOccupant\nbehaviour\nEstimated Amount of Water\nReleased (per 2.5\ninhabitants)\nCooking\n(unventilated)\n3.0 L / day.\nBaths / Showers\n1.5 L/day. \nClothes Washing\n0.5 L/ day.\nClothes drying\n(unvented)\n5.0 L/ load.\nDishwashing\n1.0 L / day.\nPortable gas\nheater\nup to 1.6 litres per 1kg of gas\nburned.\nBreathing \n(average)\n3 litres per day.\nBreathing asleep\n(per hour)\n(average)\n50 ml.\nPerspiration \n0.5 litre per day.\nPot Plants\nThe same amount as the\ninput\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n315\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[315]},{"number":"10.8.2","title":"Heating","level":3,"content":"10.8.2 \nHeating \nSome other sources of moisture are best avoided altogether, particularly unvented gas heating and kerosene\nheaters. Burning 1 kg of gas can release 1.6 litres of moisture into the atmosphere.\n10.8.3 \nMechanical Venting \nSupply-driven and exhaust-driven mechanical ventilation systems can pressurise or depressurise internal\natmospheres in different areas of the building. Supply-driven systems can be problematic as increased internal\npressures can drive moist air into the attic through openings in the ceiling.\nExhaust-driven systems can de-pressurise internal areas and increase the intake of moist external air, e.g. ground\nmoisture via a vented cavity. Unbalanced mechanical ventilation can also encourage moisture migration by\ncreating negative pressures in the ceiling cavity. These systems need to be well designed and maintained to avoid\nthe risk of affecting internal moisture. A balanced mechanical ventilation system, where both intake and exhaust\nare connected to the outside, is the preferred system and will be most effective when the thermal envelope of the\nbuilding is airtight.\n10.8.4 \nConstruction Moisture \nDuring construction, timber can become wet and take some time to dry out. Some activities, such as plastering\nand painting, also release water vapour.\nConcrete floors are particularly prolific sources of moisture. During curing, a 100 mm thick concrete slab\nreleases approximately 10 litres of water vapour per square metre of surface area. The curing period depends on\nvarious factors, but as a rule of thumb, a concrete floor cures at a depth-rate of 25 mm per month. Therefore, a\nconcrete slab can affect internal moisture levels for a considerable period.\nAll new buildings, particularly those with concrete floors, must be kept well ventilated (at much higher levels than\nrequired during normal use) until moisture levels of construction materials have stabilised.\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n316\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[316]},{"number":"10.8.3","title":"Mechanical Venting","level":3,"content":"10.8.2 \nHeating \nSome other sources of moisture are best avoided altogether, particularly unvented gas heating and kerosene\nheaters. Burning 1 kg of gas can release 1.6 litres of moisture into the atmosphere.\n10.8.3 \nMechanical Venting \nSupply-driven and exhaust-driven mechanical ventilation systems can pressurise or depressurise internal\natmospheres in different areas of the building. Supply-driven systems can be problematic as increased internal\npressures can drive moist air into the attic through openings in the ceiling.\nExhaust-driven systems can de-pressurise internal areas and increase the intake of moist external air, e.g. ground\nmoisture via a vented cavity. Unbalanced mechanical ventilation can also encourage moisture migration by\ncreating negative pressures in the ceiling cavity. These systems need to be well designed and maintained to avoid\nthe risk of affecting internal moisture. A balanced mechanical ventilation system, where both intake and exhaust\nare connected to the outside, is the preferred system and will be most effective when the thermal envelope of the\nbuilding is airtight.\n10.8.4 \nConstruction Moisture \nDuring construction, timber can become wet and take some time to dry out. Some activities, such as plastering\nand painting, also release water vapour.\nConcrete floors are particularly prolific sources of moisture. During curing, a 100 mm thick concrete slab\nreleases approximately 10 litres of water vapour per square metre of surface area. The curing period depends on\nvarious factors, but as a rule of thumb, a concrete floor cures at a depth-rate of 25 mm per month. Therefore, a\nconcrete slab can affect internal moisture levels for a considerable period.\nAll new buildings, particularly those with concrete floors, must be kept well ventilated (at much higher levels than\nrequired during normal use) until moisture levels of construction materials have stabilised.\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n316\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[316]},{"number":"10.8.4","title":"Construction Moisture","level":3,"content":"10.8.2 \nHeating \nSome other sources of moisture are best avoided altogether, particularly unvented gas heating and kerosene\nheaters. Burning 1 kg of gas can release 1.6 litres of moisture into the atmosphere.\n10.8.3 \nMechanical Venting \nSupply-driven and exhaust-driven mechanical ventilation systems can pressurise or depressurise internal\natmospheres in different areas of the building. Supply-driven systems can be problematic as increased internal\npressures can drive moist air into the attic through openings in the ceiling.\nExhaust-driven systems can de-pressurise internal areas and increase the intake of moist external air, e.g. ground\nmoisture via a vented cavity. Unbalanced mechanical ventilation can also encourage moisture migration by\ncreating negative pressures in the ceiling cavity. These systems need to be well designed and maintained to avoid\nthe risk of affecting internal moisture. A balanced mechanical ventilation system, where both intake and exhaust\nare connected to the outside, is the preferred system and will be most effective when the thermal envelope of the\nbuilding is airtight.\n10.8.4 \nConstruction Moisture \nDuring construction, timber can become wet and take some time to dry out. Some activities, such as plastering\nand painting, also release water vapour.\nConcrete floors are particularly prolific sources of moisture. During curing, a 100 mm thick concrete slab\nreleases approximately 10 litres of water vapour per square metre of surface area. The curing period depends on\nvarious factors, but as a rule of thumb, a concrete floor cures at a depth-rate of 25 mm per month. Therefore, a\nconcrete slab can affect internal moisture levels for a considerable period.\nAll new buildings, particularly those with concrete floors, must be kept well ventilated (at much higher levels than\nrequired during normal use) until moisture levels of construction materials have stabilised.\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n316\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[316]},{"number":"10.8.4A","title":"Mould Damage","level":3,"content":"This building suffered mould damage to underlay and roof truss even before occupants moved in.\n10.8.5 \nGround Moisture \nGround moisture can infiltrate living spaces by way of the floor or directly to the ceiling space by way of vented\ncavities. The cavity should be constructed to prevent the migration of water vapour into the ceiling space. Wet\nsubfloors can be isolated by laying polythene tightly over the surface and taping all joints. More information can\nbe obtained from the Good Repair Guide: Damp Subfloors (BRANZ).\nConcrete floors must be installed over a damp-proof membrane (DPM) to ensure that moisture from within the\nground does not penetrate the slab. This membrane can be formed by a polyethene sheet that is taped at the laps\nand laid over compacted hard fill topped by a sand blinding layer. The DPM must be installed under the full extent\nof the slab, under any internal or perimeter foundations, extend up to the external edge of the floor slab, and\nlapped and sealed under the wall damp-proofing system.\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n317\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[317],"images":[{"filename":"mould-damage-detail-03.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/mould-damage-detail-03.png","caption":"","dimensions":{"width":604,"height":451}}]},{"number":"10.8.5","title":"Ground Moisture","level":3,"content":"10.8.4A Mould Damage\nThis building suffered mould damage to underlay and roof truss even before occupants moved in.\n10.8.5 \nGround Moisture \nGround moisture can infiltrate living spaces by way of the floor or directly to the ceiling space by way of vented\ncavities. The cavity should be constructed to prevent the migration of water vapour into the ceiling space. Wet\nsubfloors can be isolated by laying polythene tightly over the surface and taping all joints. More information can\nbe obtained from the Good Repair Guide: Damp Subfloors (BRANZ).\nConcrete floors must be installed over a damp-proof membrane (DPM) to ensure that moisture from within the\nground does not penetrate the slab. This membrane can be formed by a polyethene sheet that is taped at the laps\nand laid over compacted hard fill topped by a sand blinding layer. The DPM must be installed under the full extent\nof the slab, under any internal or perimeter foundations, extend up to the external edge of the floor slab, and\nlapped and sealed under the wall damp-proofing system.\n 10 INTERNAL MOISTURE\n 10 \n 10.8 MOISTURE SOURCES\n 8 \n 10 \n 10.8 \n317\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[317]}]},{"number":"10.9","title":"Minimising Ingress of Water Vapour into the Ceiling Cavity","level":2,"content":"10.9 \nMinimising Ingress of Water Vapour into the Ceiling Cavity \nThe first line of defence for managing roof space moisture levels is maintaining low relative humidity in the\ndwelling areas. The second line is preventing excessive amounts of moisture entering the ceiling cavity. It is\nrecommended that all ceilings are square stopped and all penetrations (cables, pipes, hatches, etc.) are caulked.\nOnly use downlights that are airtight and have a gasket\nA gloss painted plasterboard ceiling presents some resistance to the passage of water vapour but is not a\ncomplete barrier. Vapour will also find its way through any minor gaps in architectural details, and it is air\ntransport through gaps that is responsible for 95% of the passage of water vapour into the ceiling space.\nCeiling tiles and tongue and groove ceilings are considerably more porous than plasterboard. Unsealed\ndownlights can be a major source of moisture movement into the ceiling cavity and should be avoided where\npossible.\nSee BRANZ Facts Roof Ventilation #3 .\nIn some older New Zealand homes, vapour barriers have been used to limit entry of moist air into the ceiling\nspace, but control of air movement into the cavity and removal of damp air by ventilation is a more practical\napproach.\nCavity systems prescribed under E2AS1 9.1.8.1, except those behind masonry veneer, are classified as drained\nnot ventilated. That means they must be closed at the top to restrict air movement between the cavity and the\nroof space. Closing a cavity off at the top still allows reasonable ventilation of the cavity while preventing\nexcessive amounts of moisture rising to the ceiling space. Alternatively, wall cavities can be vented externally.\n 10 INTERNAL MOISTURE\n 10 \nCAVITY\n 9 \n 10 \n 10.9 \n318\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[318]},{"number":"10.10","title":"Ventilation Pathways","level":2,"content":"10.10 \nVentilation Pathways \nBecause of the cooking, washing, and respiration of the inhabitants, the humidity in the ceiling cavity is most\noften greater than that of the surrounding atmosphere. The space may also be colder than the ambient air at\nnight due to 10.12.3 Night Sky Radiation\nWarm air naturally rises but has little tendency to move laterally, except when a strong wind blows into roof vents\nor causes substantial differences in air pressure on opposite sides of the building. That is why eave-to-ridge\nventilation is more effective under typical conditions than side-to-side ventilation.\nVentilation of a cavity space is desired to reduce the accumulation of condensation and assist in removing\nexcess heat. Natural ventilation via the ribs of metal roof and wall cladding can achieve this adequately in normal\ncircumstances, but additional provisions are often necessary. In all cases, air must flow naturally through the\nprofile crests without barriers such as profiled foam filler strips at the eaves and apex, or impingement of bulk\ninsulation.\n10.10A Ventilation pathway: Eaves\nwith Underlay\n10 mm gap\n10 mm gap\nVentilation Path\n10.10B Ventilation pathway: Eaves with\nFleece\nFleece-lined\nVentilation pathway\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n319\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nMany roofs not overtly displaying the signs of excessive moisture build-up would benefit from increased\nA printable bulletin is available at: BEF01Position of Eaves Flashing to Underlay.\n10.10C Ventilation pathway: Ridge\nwith Underlay\nSoft edge flashing.\nRoofer to incorporate 20mm x \n500mm slots, with 300mm \nunslotted spacing between \nthem, to additional ridge \nunderlay for passive airflow \nthrough the roof structure.\nNotched Ridge\nVentilation \npath\nVentilation \npath\n10.10D Ventilation Pathway: Ridge with\nFleece\nSoft edge flashing.\nVentilation \npath\nVentilation \npath\n10.10E Ventilation Pathway: Top Plate\nwith Underlay\nReduce height of perimeter insulation to \nmaintain 25 mm min airflow clearance. \nAlternatively use an Eaves ventilator or heel \ntruss\nVentilation path\n10.10F Ventilation Pathway: Top Plate\nwith Fleece\nVentilation path\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n320\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nExtract:\n\"Eaves flashings are traditionally laid between the underlay and the eaves purlin. This is not always\nnecessary, or even desirable...\"\nSimple techniques to provide a clear path for air to enter, travel along and exit the roof cavity can include:\nEaves:\nAllow air entry by soffit vents, over-fascia or behind-fascia vents, or by using fleece-lined roofing material.\nEnsuring that insulation does not impinge on the underside of the roof at the eaves. This can be achieved by\nusing a heeled truss, eaves baffle, or both.\nBody:\nEnsuring that the air can travel under the roof. If insulation is flush with the underside of the purlins it can\nbe done using a vented batten between the purlin and the underlay, or by using fleece lined roofing material.\nApex:\nMaking the roof underlay discontinuous at the apex by cutting or slitting the underlay and using a vented\nsoft edge or vented ridge.\nSarked roofs must have a gap in the sarking at eaves and apex, or by an alternative eaves-to-apex passage.\nWith skillion roof or flat roof construction, the air volume is significantly reduced, so moisture saturation levels\nare more quickly reached. Also with these roof types, air flow paths are more easily obstructed. In skillion roofs\nwith tongue and groove ceilings, a layer of roof underlay immediately above the ceiling will provide a vapour\ncheck and air barrier to compensate for the porosity of the ceiling. For more advice on skillion roof ventilation,\nsee https://www.branz.co.nz/pubs/branz-facts/roof-ventilation/4-skillion-roofs/\nRoofs continuous over an apex, such as barrel curved roofs or roofs with prickled ridges, must have adequate\nventilation to prevent the accumulation of moisture at the apex.\nLong low-pitched roofs will benefit from increased ventilation which may also assist in minimising thermally\ninduced expansion noise. Ventilation typically increases as the roof pitch increases. Air movement through the\ncrests depends on the spacing and area of the crests, roof pitch, and overall length of the sheeting. Corrugate and\ntrapezoidal roofing provide more ventilation than secret-fix roofing. Ventilation through the crests still depends\non air being allowed to enter at the eaves and escape at the apex.\nTrough or tray section roofs have smaller ventilation channels and may require additional ventilation.\nThe use of profiled closures at eaves or ridge will create a substantial air barrier, and alternative ventilation paths\nmust be created.\nAdditional roof space ventilation may take the form of:\nlouvre vents in gable-ends,\nsoffit vents,\nproprietary ridge vents,\nventilated soft edge strips on transverse flashings, or\nmechanical or wind-powered vents positioned close to the apex.\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n321\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nWhere eave-vent intakes and ridge-vent exits are both employed, the area of the ridge vents should be less than\nthat of the eave vents. More air escaping at the ridge than entering at the eaves can lower the pressure of the\nattic cavity and encourage more ingress of moist air from the dwelling area.\nIn pitches of 30 deg or less cross venting from eaves to eaves alone is generally enough when combined with natural\npassive ventilation at the apex.\nA common rule of thumb is to have a total ventilation cross-section area equal to 1/300 of the ceiling area. In NZ\nbuildings, much smaller ratios have proven sufficient in most cases.\nIncreasing roof space ventilation above the insulation has only a small effect on R values. Ventilation of spaces\nabove bulk insulation is not only desirable but prevents insulation losing effectiveness due to absorbing\nmoisture.\nPartial filling of a ceiling cavity with bulk insulation in flat roofs can severely reduce the amount of free air\navailable to absorb incoming water vapour, thereby increasing saturation levels. Adding insulation while re-roofing\nmust be done with due consideration; unless the amount of ventilation of the cavity is increased or a vapour\ncheck layer is used below the insulation, internal moisture problems can occur.\n10.10.1 \nMethods of Ventilation \nThe primary purpose of ventilation is to replace the moist air in the ceiling cavity with drier air from outdoors.\nAs warm, wet air tends to rise, a vent placed in the soffit or at the lower end of a roof will normally operate as an\nintake vent and a vent at the apex as an exhaust vent, but wind direction can reverse this relationship. Gable-end\nvents or vents aligned horizontally will act as an intake or exhaust depending on the wind direction.\n10.10.1.1 \nSoffit Vents \nSoffit vents can be made in a range of styles to suit the application. As wind pressure differentials are highest at\nthe eaves, they are an efficient ventilation solution and they are also very weather resistant. Soffit vents should\nalways be installed to allow free movement of air into the cavity and should not be blocked on the interior side by\ninsulation or other material.\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n322\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.1.1A Mono-Pitch Sarked Roof to Parapet with Vented Battens\nVented Batten\nSoffit Vent\nPly sarking\nunderlay\nParapet cap\n20mm gap\nCeiling\nSynthetic self support\nIn some applications, vented battens may be needed to increase airflow\n10.10.1.2 \nFascia Vents \nVents above the fascia may require repositioning of the fascia to allow for their depth. Fascia vents should be\nused in conjunction with a high fronted spouting so that the ends of the sheet and the vent are not exposed to\ndriven rain.\n10.10.1.3 \nRidge Vents \nRidge vents, such as continuous or intermittent ridge vents or vented head apron flashings, should always be used\nin conjunction with intake vents at a lower level.\nTo prevent creating negative pressures which can draw more moist internal air into the ceiling space, the free\nsurface area of ridge vents should always be less than that of eaves vents.\nSaturated water vapour can enter the building when commercial ridge vents are subjected to negative pressures\nor at times of high humidity associated with mist or fog. Such water vapour can form condensation on the\nstructural framework and appear as a leak. Ridge vents without adequate intake vents can also lead to leakage.\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n323\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.1.3A Sarked Roof to Ridge Vent\nInsulation\nSoffit\nSoffit vent\nPly sarking\nSynthetic underlay\n20mm gap\nFolded ridge\nCeiling\nSoft Edge\nVented\n10.10.1.4 \nVented Soft Edge \nTypical soft edge is either soft aluminium or perforated aluminium a with PIB rubber backer. The latter is more\ncommon. The PIB rubber, when dressed down on a hot day, can adhere to the roofing surface and prevent the\nescape of air at the apex. By removing all or most of the PIB backing this is avoided, and the perforations in the\naluminium become an effective pathway for trickle ventilation, while still being an effective baffle against wind-\nblown moisture. This product is marketed as vented soft edge and is available from all suppliers.\n10.10.1.4A Vented Soft Edge on Corrugate\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n324\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.1.4B Vented Soft Edge From Underneath \n10.10.1.5 \nTurbine Vents \nWind-driven turbine vents rely on wind to rotate the fan blades. This creates a low-pressure area, so they draw air\nfrom the ventilated area at a greater rate than stationary vents. The amount of air movement can be dampened\nbut is normally uncontrolled; it is developed as a function of wind speed as well as turbine size and efficiency.\nTurbine vents, unlike commercial ridge vents, are unaffected by wind direction and they are less prone to leaking.\n10.10.2 \nBattens \nBattens may be required to create a separation space between the roofing and the underlay. In some applications,\nthey may need to be ventilated to achieve sufficient airflow.\nThe type and number of fixings required to fix the counter battens to the roof structure must meet the design wind\nload, or the roof fasteners should be long enough to achieve the required penetration into the purlin below.\nBattens or counter battens, if not fixed by extended cladding fasteners, can be fixed using countersunk purlin\nscrews or if fixed with hex headed screws, they should be counter-bored before installation to avoid damage to\nthe roof cladding.\nSteel top hat, C or Z sections are also used as counter battens but require an additional insulating spacer to\navoid thermal bridging.\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n325\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.10.2A Using Z Counter Battens with Insulating Spacers\nZed\nThermal Break\nRoof\nAbsorbent underlay\nInsulation\nSafety mesh\nFoil\nSteel purlin\n20mm \ngap\ncounterbatten\n10.10.3 \nApplied Fleeces \nRoof sheeting is now available with a synthetic fleece applied directly to the underside of the profile. This works\nin the same manner as roofing underlay, absorbing condensation into the fleece and releasing it into the\natmosphere when ambient conditions improve.\nThe fleece follows the contours of the profile. By removing the separate layer of underlay, every crest becomes a\npathway for ventilation. On a gable roof, this will approximately double the air changes in a roof over conventional\nconstruction, without the height disruption, cost, or inconvenience of a ventilated batten.\nAnother advantage of these products is that they greatly increase speed of lay of a roof, and avoid delays due to\nexcessive wind. They are available on all corrugate and trapezoidal profiles.\n 10 INTERNAL MOISTURE\n 10 \n 10 \n 10 \n 10.10 \n326\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[319,320,321,322,323,324,325,326],"subsections":[{"number":"10.10A","title":"Ventilation pathway: Eaves with Underlay","level":3,"content":"10.10 \nVentilation Pathways \nBecause of the cooking, washing, and respiration of the inhabitants, the humidity in the ceiling cavity is most\noften greater than that of the surrounding atmosphere. The space may also be colder than the ambient air at\nnight due to 10.12.3 Night Sky Radiation\nWarm air naturally rises but has little tendency to move laterally, except when a strong wind blows into roof vents\nor causes substantial differences in air pressure on opposite sides of the building. That is why eave-to-ridge\nventilation is more effective under typical conditions than side-to-side ventilation.\nVentilation of a cavity space is desired to reduce the accumulation of condensation and assist in removing\nexcess heat. Natural ventilation via the ribs of metal roof and wall cladding can achieve this adequately in normal\ncircumstances, but additional provisions are often necessary. In all cases, air must flow naturally through the\nprofile crests without barriers such as profiled foam filler strips at the eaves and apex, or impingement of bulk\ninsulation.\nwith Underlay\n10 mm gap\n10 mm gap\nVentilation Path\n10.10B Ventilation pathway: Eaves with\nFleece\nFleece-lined\nVentilation pathway\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n319\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[319]},{"number":"10.10B","title":"Ventilation pathway: Eaves with Fleece","level":3,"content":"10.10 \nVentilation Pathways \nBecause of the cooking, washing, and respiration of the inhabitants, the humidity in the ceiling cavity is most\noften greater than that of the surrounding atmosphere. The space may also be colder than the ambient air at\nnight due to 10.12.3 Night Sky Radiation\nWarm air naturally rises but has little tendency to move laterally, except when a strong wind blows into roof vents\nor causes substantial differences in air pressure on opposite sides of the building. That is why eave-to-ridge\nventilation is more effective under typical conditions than side-to-side ventilation.\nVentilation of a cavity space is desired to reduce the accumulation of condensation and assist in removing\nexcess heat. Natural ventilation via the ribs of metal roof and wall cladding can achieve this adequately in normal\ncircumstances, but additional provisions are often necessary. In all cases, air must flow naturally through the\nprofile crests without barriers such as profiled foam filler strips at the eaves and apex, or impingement of bulk\ninsulation.\n10.10A Ventilation pathway: Eaves\nwith Underlay\n10 mm gap\n10 mm gap\nVentilation Path\nFleece\nFleece-lined\nVentilation pathway\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n319\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[319]},{"number":"10.10C","title":"Ventilation pathway: Ridge with Underlay","level":3,"content":"Many roofs not overtly displaying the signs of excessive moisture build-up would benefit from increased\nA printable bulletin is available at: BEF01Position of Eaves Flashing to Underlay.\nwith Underlay\nSoft edge flashing.\nRoofer to incorporate 20mm x \n500mm slots, with 300mm \nunslotted spacing between \nthem, to additional ridge \nunderlay for passive airflow \nthrough the roof structure.\nNotched Ridge\nVentilation \npath\nVentilation \npath\n10.10D Ventilation Pathway: Ridge with\nFleece\nSoft edge flashing.\nVentilation \npath\nVentilation \npath\n10.10E Ventilation Pathway: Top Plate\nwith Underlay\nReduce height of perimeter insulation to \nmaintain 25 mm min airflow clearance. \nAlternatively use an Eaves ventilator or heel \ntruss\nVentilation path\n10.10F Ventilation Pathway: Top Plate\nwith Fleece\nVentilation path\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n320\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[320]},{"number":"10.10D","title":"Ventilation Pathway: Ridge with Fleece","level":3,"content":"Many roofs not overtly displaying the signs of excessive moisture build-up would benefit from increased\nA printable bulletin is available at: BEF01Position of Eaves Flashing to Underlay.\n10.10C Ventilation pathway: Ridge\nwith Underlay\nSoft edge flashing.\nRoofer to incorporate 20mm x \n500mm slots, with 300mm \nunslotted spacing between \nthem, to additional ridge \nunderlay for passive airflow \nthrough the roof structure.\nNotched Ridge\nVentilation \npath\nVentilation \npath\nFleece\nSoft edge flashing.\nVentilation \npath\nVentilation \npath\n10.10E Ventilation Pathway: Top Plate\nwith Underlay\nReduce height of perimeter insulation to \nmaintain 25 mm min airflow clearance. \nAlternatively use an Eaves ventilator or heel \ntruss\nVentilation path\n10.10F Ventilation Pathway: Top Plate\nwith Fleece\nVentilation path\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n320\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[320]},{"number":"10.10E","title":"Ventilation Pathway: Top Plate with Underlay","level":3,"content":"Many roofs not overtly displaying the signs of excessive moisture build-up would benefit from increased\nA printable bulletin is available at: BEF01Position of Eaves Flashing to Underlay.\n10.10C Ventilation pathway: Ridge\nwith Underlay\nSoft edge flashing.\nRoofer to incorporate 20mm x \n500mm slots, with 300mm \nunslotted spacing between \nthem, to additional ridge \nunderlay for passive airflow \nthrough the roof structure.\nNotched Ridge\nVentilation \npath\nVentilation \npath\n10.10D Ventilation Pathway: Ridge with\nFleece\nSoft edge flashing.\nVentilation \npath\nVentilation \npath\nwith Underlay\nReduce height of perimeter insulation to \nmaintain 25 mm min airflow clearance. \nAlternatively use an Eaves ventilator or heel \ntruss\nVentilation path\n10.10F Ventilation Pathway: Top Plate\nwith Fleece\nVentilation path\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n320\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[320]},{"number":"10.10F","title":"Ventilation Pathway: Top Plate with Fleece","level":3,"content":"Many roofs not overtly displaying the signs of excessive moisture build-up would benefit from increased\nA printable bulletin is available at: BEF01Position of Eaves Flashing to Underlay.\n10.10C Ventilation pathway: Ridge\nwith Underlay\nSoft edge flashing.\nRoofer to incorporate 20mm x \n500mm slots, with 300mm \nunslotted spacing between \nthem, to additional ridge \nunderlay for passive airflow \nthrough the roof structure.\nNotched Ridge\nVentilation \npath\nVentilation \npath\n10.10D Ventilation Pathway: Ridge with\nFleece\nSoft edge flashing.\nVentilation \npath\nVentilation \npath\n10.10E Ventilation Pathway: Top Plate\nwith Underlay\nReduce height of perimeter insulation to \nmaintain 25 mm min airflow clearance. \nAlternatively use an Eaves ventilator or heel \ntruss\nVentilation path\nwith Fleece\nVentilation path\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n320\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nExtract:\n\"Eaves flashings are traditionally laid between the underlay and the eaves purlin. This is not always\nnecessary, or even desirable...\"\nSimple techniques to provide a clear path for air to enter, travel along and exit the roof cavity can include:\nEaves:\nAllow air entry by soffit vents, over-fascia or behind-fascia vents, or by using fleece-lined roofing material.\nEnsuring that insulation does not impinge on the underside of the roof at the eaves. This can be achieved by\nusing a heeled truss, eaves baffle, or both.\nBody:\nEnsuring that the air can travel under the roof. If insulation is flush with the underside of the purlins it can\nbe done using a vented batten between the purlin and the underlay, or by using fleece lined roofing material.\nApex:\nMaking the roof underlay discontinuous at the apex by cutting or slitting the underlay and using a vented\nsoft edge or vented ridge.\nSarked roofs must have a gap in the sarking at eaves and apex, or by an alternative eaves-to-apex passage.\nWith skillion roof or flat roof construction, the air volume is significantly reduced, so moisture saturation levels\nare more quickly reached. Also with these roof types, air flow paths are more easily obstructed. In skillion roofs\nwith tongue and groove ceilings, a layer of roof underlay immediately above the ceiling will provide a vapour\ncheck and air barrier to compensate for the porosity of the ceiling. For more advice on skillion roof ventilation,\nsee https://www.branz.co.nz/pubs/branz-facts/roof-ventilation/4-skillion-roofs/\nRoofs continuous over an apex, such as barrel curved roofs or roofs with prickled ridges, must have adequate\nventilation to prevent the accumulation of moisture at the apex.\nLong low-pitched roofs will benefit from increased ventilation which may also assist in minimising thermally\ninduced expansion noise. Ventilation typically increases as the roof pitch increases. Air movement through the\ncrests depends on the spacing and area of the crests, roof pitch, and overall length of the sheeting. Corrugate and\ntrapezoidal roofing provide more ventilation than secret-fix roofing. Ventilation through the crests still depends\non air being allowed to enter at the eaves and escape at the apex.\nTrough or tray section roofs have smaller ventilation channels and may require additional ventilation.\nThe use of profiled closures at eaves or ridge will create a substantial air barrier, and alternative ventilation paths\nmust be created.\nAdditional roof space ventilation may take the form of:\nlouvre vents in gable-ends,\nsoffit vents,\nproprietary ridge vents,\nventilated soft edge strips on transverse flashings, or\nmechanical or wind-powered vents positioned close to the apex.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n321\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[320,321]},{"number":"10.10.1","title":"Methods of Ventilation","level":3,"content":"Where eave-vent intakes and ridge-vent exits are both employed, the area of the ridge vents should be less than\nthat of the eave vents. More air escaping at the ridge than entering at the eaves can lower the pressure of the\nattic cavity and encourage more ingress of moist air from the dwelling area.\nIn pitches of 30 deg or less cross venting from eaves to eaves alone is generally enough when combined with natural\npassive ventilation at the apex.\nA common rule of thumb is to have a total ventilation cross-section area equal to 1/300 of the ceiling area. In NZ\nbuildings, much smaller ratios have proven sufficient in most cases.\nIncreasing roof space ventilation above the insulation has only a small effect on R values. Ventilation of spaces\nabove bulk insulation is not only desirable but prevents insulation losing effectiveness due to absorbing\nmoisture.\nPartial filling of a ceiling cavity with bulk insulation in flat roofs can severely reduce the amount of free air\navailable to absorb incoming water vapour, thereby increasing saturation levels. Adding insulation while re-roofing\nmust be done with due consideration; unless the amount of ventilation of the cavity is increased or a vapour\ncheck layer is used below the insulation, internal moisture problems can occur.\n10.10.1 \nMethods of Ventilation \nThe primary purpose of ventilation is to replace the moist air in the ceiling cavity with drier air from outdoors.\nAs warm, wet air tends to rise, a vent placed in the soffit or at the lower end of a roof will normally operate as an\nintake vent and a vent at the apex as an exhaust vent, but wind direction can reverse this relationship. Gable-end\nvents or vents aligned horizontally will act as an intake or exhaust depending on the wind direction.\n10.10.1.1 \nSoffit Vents \nSoffit vents can be made in a range of styles to suit the application. As wind pressure differentials are highest at\nthe eaves, they are an efficient ventilation solution and they are also very weather resistant. Soffit vents should\nalways be installed to allow free movement of air into the cavity and should not be blocked on the interior side by\ninsulation or other material.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n322\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[322]},{"number":"10.10.1.1","title":"Soffit Vents","level":3,"content":"Where eave-vent intakes and ridge-vent exits are both employed, the area of the ridge vents should be less than\nthat of the eave vents. More air escaping at the ridge than entering at the eaves can lower the pressure of the\nattic cavity and encourage more ingress of moist air from the dwelling area.\nIn pitches of 30 deg or less cross venting from eaves to eaves alone is generally enough when combined with natural\npassive ventilation at the apex.\nA common rule of thumb is to have a total ventilation cross-section area equal to 1/300 of the ceiling area. In NZ\nbuildings, much smaller ratios have proven sufficient in most cases.\nIncreasing roof space ventilation above the insulation has only a small effect on R values. Ventilation of spaces\nabove bulk insulation is not only desirable but prevents insulation losing effectiveness due to absorbing\nmoisture.\nPartial filling of a ceiling cavity with bulk insulation in flat roofs can severely reduce the amount of free air\navailable to absorb incoming water vapour, thereby increasing saturation levels. Adding insulation while re-roofing\nmust be done with due consideration; unless the amount of ventilation of the cavity is increased or a vapour\ncheck layer is used below the insulation, internal moisture problems can occur.\n10.10.1 \nMethods of Ventilation \nThe primary purpose of ventilation is to replace the moist air in the ceiling cavity with drier air from outdoors.\nAs warm, wet air tends to rise, a vent placed in the soffit or at the lower end of a roof will normally operate as an\nintake vent and a vent at the apex as an exhaust vent, but wind direction can reverse this relationship. Gable-end\nvents or vents aligned horizontally will act as an intake or exhaust depending on the wind direction.\n10.10.1.1 \nSoffit Vents \nSoffit vents can be made in a range of styles to suit the application. As wind pressure differentials are highest at\nthe eaves, they are an efficient ventilation solution and they are also very weather resistant. Soffit vents should\nalways be installed to allow free movement of air into the cavity and should not be blocked on the interior side by\ninsulation or other material.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n322\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[322]},{"number":"10.10.1.1A","title":"Mono-Pitch Sarked Roof to Parapet with Vented Battens","level":3,"content":"Vented Batten\nSoffit Vent\nPly sarking\nunderlay\nParapet cap\n20mm gap\nCeiling\nSynthetic self support\nIn some applications, vented battens may be needed to increase airflow\n10.10.1.2 \nFascia Vents \nVents above the fascia may require repositioning of the fascia to allow for their depth. Fascia vents should be\nused in conjunction with a high fronted spouting so that the ends of the sheet and the vent are not exposed to\ndriven rain.\n10.10.1.3 \nRidge Vents \nRidge vents, such as continuous or intermittent ridge vents or vented head apron flashings, should always be used\nin conjunction with intake vents at a lower level.\nTo prevent creating negative pressures which can draw more moist internal air into the ceiling space, the free\nsurface area of ridge vents should always be less than that of eaves vents.\nSaturated water vapour can enter the building when commercial ridge vents are subjected to negative pressures\nor at times of high humidity associated with mist or fog. Such water vapour can form condensation on the\nstructural framework and appear as a leak. Ridge vents without adequate intake vents can also lead to leakage.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n323\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[323]},{"number":"10.10.1.2","title":"Fascia Vents","level":3,"content":"10.10.1.1A Mono-Pitch Sarked Roof to Parapet with Vented Battens\nVented Batten\nSoffit Vent\nPly sarking\nunderlay\nParapet cap\n20mm gap\nCeiling\nSynthetic self support\nIn some applications, vented battens may be needed to increase airflow\n10.10.1.2 \nFascia Vents \nVents above the fascia may require repositioning of the fascia to allow for their depth. Fascia vents should be\nused in conjunction with a high fronted spouting so that the ends of the sheet and the vent are not exposed to\ndriven rain.\n10.10.1.3 \nRidge Vents \nRidge vents, such as continuous or intermittent ridge vents or vented head apron flashings, should always be used\nin conjunction with intake vents at a lower level.\nTo prevent creating negative pressures which can draw more moist internal air into the ceiling space, the free\nsurface area of ridge vents should always be less than that of eaves vents.\nSaturated water vapour can enter the building when commercial ridge vents are subjected to negative pressures\nor at times of high humidity associated with mist or fog. Such water vapour can form condensation on the\nstructural framework and appear as a leak. Ridge vents without adequate intake vents can also lead to leakage.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n323\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[323]},{"number":"10.10.1.3","title":"Ridge Vents","level":3,"content":"10.10.1.1A Mono-Pitch Sarked Roof to Parapet with Vented Battens\nVented Batten\nSoffit Vent\nPly sarking\nunderlay\nParapet cap\n20mm gap\nCeiling\nSynthetic self support\nIn some applications, vented battens may be needed to increase airflow\n10.10.1.2 \nFascia Vents \nVents above the fascia may require repositioning of the fascia to allow for their depth. Fascia vents should be\nused in conjunction with a high fronted spouting so that the ends of the sheet and the vent are not exposed to\ndriven rain.\n10.10.1.3 \nRidge Vents \nRidge vents, such as continuous or intermittent ridge vents or vented head apron flashings, should always be used\nin conjunction with intake vents at a lower level.\nTo prevent creating negative pressures which can draw more moist internal air into the ceiling space, the free\nsurface area of ridge vents should always be less than that of eaves vents.\nSaturated water vapour can enter the building when commercial ridge vents are subjected to negative pressures\nor at times of high humidity associated with mist or fog. Such water vapour can form condensation on the\nstructural framework and appear as a leak. Ridge vents without adequate intake vents can also lead to leakage.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n323\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[323]},{"number":"10.10.1.3A","title":"Sarked Roof to Ridge Vent","level":3,"content":"Insulation\nSoffit\nSoffit vent\nPly sarking\nSynthetic underlay\n20mm gap\nFolded ridge\nCeiling\nSoft Edge\nVented\n10.10.1.4 \nVented Soft Edge \nTypical soft edge is either soft aluminium or perforated aluminium a with PIB rubber backer. The latter is more\ncommon. The PIB rubber, when dressed down on a hot day, can adhere to the roofing surface and prevent the\nescape of air at the apex. By removing all or most of the PIB backing this is avoided, and the perforations in the\naluminium become an effective pathway for trickle ventilation, while still being an effective baffle against wind-\nblown moisture. This product is marketed as vented soft edge and is available from all suppliers.\n10.10.1.4A Vented Soft Edge on Corrugate\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n324\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[324]},{"number":"10.10.1.4","title":"Vented Soft Edge","level":3,"content":"10.10.1.3A Sarked Roof to Ridge Vent\nInsulation\nSoffit\nSoffit vent\nPly sarking\nSynthetic underlay\n20mm gap\nFolded ridge\nCeiling\nSoft Edge\nVented\n10.10.1.4 \nVented Soft Edge \nTypical soft edge is either soft aluminium or perforated aluminium a with PIB rubber backer. The latter is more\ncommon. The PIB rubber, when dressed down on a hot day, can adhere to the roofing surface and prevent the\nescape of air at the apex. By removing all or most of the PIB backing this is avoided, and the perforations in the\naluminium become an effective pathway for trickle ventilation, while still being an effective baffle against wind-\nblown moisture. This product is marketed as vented soft edge and is available from all suppliers.\n10.10.1.4A Vented Soft Edge on Corrugate\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n324\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[324]},{"number":"10.10.1.4A","title":"Vented Soft Edge on Corrugate","level":3,"content":"10.10.1.3A Sarked Roof to Ridge Vent\nInsulation\nSoffit\nSoffit vent\nPly sarking\nSynthetic underlay\n20mm gap\nFolded ridge\nCeiling\nSoft Edge\nVented\n10.10.1.4 \nVented Soft Edge \nTypical soft edge is either soft aluminium or perforated aluminium a with PIB rubber backer. The latter is more\ncommon. The PIB rubber, when dressed down on a hot day, can adhere to the roofing surface and prevent the\nescape of air at the apex. By removing all or most of the PIB backing this is avoided, and the perforations in the\naluminium become an effective pathway for trickle ventilation, while still being an effective baffle against wind-\nblown moisture. This product is marketed as vented soft edge and is available from all suppliers.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n324\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[324]},{"number":"10.10.1.4B","title":"Vented Soft Edge From Underneath","level":3,"content":"10.10.1.5 \nTurbine Vents \nWind-driven turbine vents rely on wind to rotate the fan blades. This creates a low-pressure area, so they draw air\nfrom the ventilated area at a greater rate than stationary vents. The amount of air movement can be dampened\nbut is normally uncontrolled; it is developed as a function of wind speed as well as turbine size and efficiency.\nTurbine vents, unlike commercial ridge vents, are unaffected by wind direction and they are less prone to leaking.\n10.10.2 \nBattens \nBattens may be required to create a separation space between the roofing and the underlay. In some applications,\nthey may need to be ventilated to achieve sufficient airflow.\nThe type and number of fixings required to fix the counter battens to the roof structure must meet the design wind\nload, or the roof fasteners should be long enough to achieve the required penetration into the purlin below.\nBattens or counter battens, if not fixed by extended cladding fasteners, can be fixed using countersunk purlin\nscrews or if fixed with hex headed screws, they should be counter-bored before installation to avoid damage to\nthe roof cladding.\nSteel top hat, C or Z sections are also used as counter battens but require an additional insulating spacer to\navoid thermal bridging.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n325\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[325]},{"number":"10.10.1.5","title":"Turbine Vents","level":3,"content":"10.10.1.4B Vented Soft Edge From Underneath \n10.10.1.5 \nTurbine Vents \nWind-driven turbine vents rely on wind to rotate the fan blades. This creates a low-pressure area, so they draw air\nfrom the ventilated area at a greater rate than stationary vents. The amount of air movement can be dampened\nbut is normally uncontrolled; it is developed as a function of wind speed as well as turbine size and efficiency.\nTurbine vents, unlike commercial ridge vents, are unaffected by wind direction and they are less prone to leaking.\n10.10.2 \nBattens \nBattens may be required to create a separation space between the roofing and the underlay. In some applications,\nthey may need to be ventilated to achieve sufficient airflow.\nThe type and number of fixings required to fix the counter battens to the roof structure must meet the design wind\nload, or the roof fasteners should be long enough to achieve the required penetration into the purlin below.\nBattens or counter battens, if not fixed by extended cladding fasteners, can be fixed using countersunk purlin\nscrews or if fixed with hex headed screws, they should be counter-bored before installation to avoid damage to\nthe roof cladding.\nSteel top hat, C or Z sections are also used as counter battens but require an additional insulating spacer to\navoid thermal bridging.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n325\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[325]},{"number":"10.10.2","title":"Battens","level":3,"content":"10.10.1.4B Vented Soft Edge From Underneath \n10.10.1.5 \nTurbine Vents \nWind-driven turbine vents rely on wind to rotate the fan blades. This creates a low-pressure area, so they draw air\nfrom the ventilated area at a greater rate than stationary vents. The amount of air movement can be dampened\nbut is normally uncontrolled; it is developed as a function of wind speed as well as turbine size and efficiency.\nTurbine vents, unlike commercial ridge vents, are unaffected by wind direction and they are less prone to leaking.\n10.10.2 \nBattens \nBattens may be required to create a separation space between the roofing and the underlay. In some applications,\nthey may need to be ventilated to achieve sufficient airflow.\nThe type and number of fixings required to fix the counter battens to the roof structure must meet the design wind\nload, or the roof fasteners should be long enough to achieve the required penetration into the purlin below.\nBattens or counter battens, if not fixed by extended cladding fasteners, can be fixed using countersunk purlin\nscrews or if fixed with hex headed screws, they should be counter-bored before installation to avoid damage to\nthe roof cladding.\nSteel top hat, C or Z sections are also used as counter battens but require an additional insulating spacer to\navoid thermal bridging.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n325\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[325]},{"number":"10.10.2A","title":"Using Z Counter Battens with Insulating Spacers","level":3,"content":"Zed\nThermal Break\nRoof\nAbsorbent underlay\nInsulation\nSafety mesh\nFoil\nSteel purlin\n20mm \ngap\ncounterbatten\n10.10.3 \nApplied Fleeces \nRoof sheeting is now available with a synthetic fleece applied directly to the underside of the profile. This works\nin the same manner as roofing underlay, absorbing condensation into the fleece and releasing it into the\natmosphere when ambient conditions improve.\nThe fleece follows the contours of the profile. By removing the separate layer of underlay, every crest becomes a\npathway for ventilation. On a gable roof, this will approximately double the air changes in a roof over conventional\nconstruction, without the height disruption, cost, or inconvenience of a ventilated batten.\nAnother advantage of these products is that they greatly increase speed of lay of a roof, and avoid delays due to\nexcessive wind. They are available on all corrugate and trapezoidal profiles.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n326\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[326]},{"number":"10.10.3","title":"Applied Fleeces","level":3,"content":"10.10.2A Using Z Counter Battens with Insulating Spacers\nZed\nThermal Break\nRoof\nAbsorbent underlay\nInsulation\nSafety mesh\nFoil\nSteel purlin\n20mm \ngap\ncounterbatten\n10.10.3 \nApplied Fleeces \nRoof sheeting is now available with a synthetic fleece applied directly to the underside of the profile. This works\nin the same manner as roofing underlay, absorbing condensation into the fleece and releasing it into the\natmosphere when ambient conditions improve.\nThe fleece follows the contours of the profile. By removing the separate layer of underlay, every crest becomes a\npathway for ventilation. On a gable roof, this will approximately double the air changes in a roof over conventional\nconstruction, without the height disruption, cost, or inconvenience of a ventilated batten.\nAnother advantage of these products is that they greatly increase speed of lay of a roof, and avoid delays due to\nexcessive wind. They are available on all corrugate and trapezoidal profiles.\n 10 INTERNAL MOISTURE\n 10 \n 10.10 VENTILATION PATHWAYS\n 10 \n 10 \n 10.10 \n326\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[326]}]},{"number":"10.11","title":"Underlay","level":2,"content":"10.11 \nUnderlay \nCondensation that forms on the cold under-surface of the roof system must be contained until ambient\nconditions allow it to evaporate. Containment is normally achieved by using an absorbent roofing underlay. It is\nthe role of roofing underlay to absorb moisture temporarily and then release it back into the atmosphere.\nA printable bulletin about installing underlay when reroofing is\navailable at: BU01 Double laying of Underlay on Re-roof\nExtract:\n\"...we recommend that no more than a single layer of compliant underlay (laps\nexcluded) is present on a profiled metal roof.\"\nA common misconception holds that the roofing underlay acts as a drainage plane, channelling condensation\nfrom the underside of the metal roof to the gutter. In practice, most of the condensation forms on the underside\nof the underlay. Although roofing underlays are permeable, they still form a substantial vapour check, and as they\nare in contact with the roof, they are at a similar temperature. Any condensation that does form on the underside\nof the roof and falls onto the underlay generally only tracks down the underlay as far as the next purlin, where it is\ntrapped and absorbed by the underlay. Underlay is also affected by holes from roofing fasteners, making it\nunreliable as a \"second roof\".\nAs it is designed to execute its primary purpose of aiding in the management of internal moisture, underlay\nshould not be used as a compensation for unreliable weatherproofing design and installation\n10.11A Roof Cavity Condensation\nSmall Space:Condensation on \nunderside of cladding;often not muc\nbecause of small air volume.\nCondensation on top can be large \nwhen air is moist and calm.\nPermeable underlay in contact with \ncladding gets cold. The resulting \ncondensation get absorbed by the \nunderlay, which can be significant if \nthe attic air is moist.\nPermeable underlay stays a \nbit warmer, no condensation\n 10 INTERNAL MOISTURE\n 10 \n 11 \n 10 \n 10.11 \n327\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.11B Condensation Under Roofing Underlay\nMost condensation on the underside of the roof system occurs under the roofing underlay.\nThe presence of pooling condensate on the upper side of a roofing underlay indicates that the absorptive capacity\nof the underlay has been exceeded. Not only the underlay will be saturated, but so will the ceiling structural\nmembers and insulation; mould, corrosion, and decay are inevitable. The cure is to decrease the amount of\nmoisture entering the ceiling cavity or increase ventilation of the ceiling space.\n10.11C Chronic Condensation \nChronic condensation problem caused by induction of moist air into the ceiling cavity. Although the underlay here\nis doing a good job of containing the surface water, the timber trusses, insulation, and ceiling below the underlay\nwere saturated with water.\nUnderlay also acts as a partial air barrier. (Rigid air barriers are also available.) Water will generally only go where\ngravity or air pressure takes it. By effectively reducing the space behind cladding, the underlay allows rapid\npressure equalisation on each side of the cladding, thereby reducing the ability of water to enter the space.\n10.11.1 \nUnderlay Standards \n 10 INTERNAL MOISTURE\n 10 \n 11 \n 10 \n 10.11 \n328\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nPermeable underlays must comply with NZS 2295, Amendment 1:2017, as shown in Properties of Roofing\nUnderlay, or have an appropriate product certification such as a Codemark certificate.\nReflective foil underlays must comply with AS/NZS 4200.1:2017\n10.11.1A Minimum Requirements for Underlays for Metal Roof Cladding\nClassification\nR1\nR3\nR2\nR4\nGrade\nHeavyweightHeavyweight\nSelf-\nsupport\nSelf-\nsupport\nType\nKraft\nSynthetic\nKraft\nSynthetic\nApplication\nResidential or light commercial\nbuildings\nProperty\nUnit\nAbsorbency\ng/m\n 150\n 150\n 150\n 150\nWater Vapour\nResistance\nMN s/g 7\n 0.5\n 7\n 0.5\nWater resistance\nmm\nhead\n 100\n 100\n 100\n 100\nTensile Strength\nMD\nKN/m\n 9\n 3\n 11\n 3\nTensile Strength CD KN/m\n 4.5\n 2\n 6\n 2.5\nEdge Tear\nResistance MD\nN\n 40\n 100\n 70\n 150\nEdge Tear\nResistance CD\nN\n 35\n 80\n 55\n 130\nBased on Table B1 of NZS 2295 Amendment 1:2017.\nSelf-supporting (S/S) is defined as strong enough to support its own weight up to a 1200 mm span.\npH between 5.5 and 8.0.\nKraft-based underlays shall have shrinkage less than 0.5% and a maximum run length of 10 m.\nSynthetic underlays may have any run length.\nAny underlay is regarded as fire-retardant if it has a Flammability Index (FI) of 5 or less when tested to AS/NZS\n1530 Part 2.\n10.11.2 \nUnderlay Requirements \nThe NZBC requires underlays under profiled metal roofing and direct-fixed metal wall cladding on lined residential\nbuildings to be both permeable and absorbent. \nUnderlays fixed to the dry side of a lined drained cavity may be permeable and non-absorbent. \nUnderlays are not required in unlined structures, but in such cases non-permeable, non-absorbent underlays such\nas foil are typically used to increase reflectivity and to minimise condensation.\n 10 INTERNAL MOISTURE\n 10 \n 11 \n 10 \n 10.11 \n329\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nIn some wall and roof applications, the underlay is required to be Fire Retardant with Flammability Index 5 when\ntested to AS1530.2. Refer NZBC C/AS3-AS6, clause 4.17.8 \nUnderlays designated as self-supporting can be laid without support at spans up to 1.2 m.\nOther requirements for underlays vary for different cladding systems, but the important features of absorbency,\npermeability, water resistance, tensile strength, edge tear resistance, PH, and durability are important to comply\nwith the requirements of the NZBC.\nThe Code of Practice recommends synthetic self-supporting fire-retardant underlays for residential roofing\napplications.\n10.11.3 \nTypes Of Underlay \nApart from their fire retardance and ability to self-support, underlays are classified according to their absorbency\nand permeability.\nPermeable and Absorbent:\nKraft paper-based - bitumen impregnated paper\nSynthetic - 2 or 3 layers, using permeable synthetic film strengthened by sandwiched non-woven fabric.\nPermeable, non-absorbent:\nSynthetic permeable non-absorbent underlays are mainly used as wall wrap inside a drained cavity or with\ndirect fixed absorbent claddings.\nNon-Permeable, non-absorbent:\nfoil - Reflective aluminium foil over a flexible substrate. These can be either double-sided or white-faced.\n10.11.4 \nUnderlay Usage \nIn lined buildings and dwellings, an absorbent permeable underlay is required under metal roofs. The same applies\nto direct-fixed steel wall cladding, but underlays used behind a drained cavity are not required to be absorbent.\nFor aesthetic reasons, a foil-faced (or white-faced) vapour check layer may be used in unlined commercial or\nindustrial applications to reduce heat radiation from the roof cladding and provide enhancement of light. For\ninsulated applications, foil is normally used as a vapour check under the insulation and an absorbent permeable\nunderlay used above with a 20 mm gap from the roof cladding.\nOn non-residential dwellings, profiled roof-light sheeting running in continuous lengths from the ridge can have\nmultiple skins to avoid condensation dripping from the sheeting or plastic sheet with a spacer can be used to\nlessen condensation. Roof underlays should not be laid continuously under translucent roof or wall cladding.\n10.11.5 \nUnderlay Durability \n 10 INTERNAL MOISTURE\n 10 \n 11 \n 10 \n 10.11 \n330\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nNZBC Clause B2.3.1 requires non-structural building elements and those that are moderately difficult to replace\nto have a durability of 15 years, or, if difficult to replace, to have the same durability as the more durable elements\nof a system. Alternatively, the design should allow the replacement of the less durable elements without\nremoving the more durable components.\nCompliance with NZBC B2, therefore, requires roofing underlay to have durability equal to that of the roof\ncladding and no less than 15 years.\nWhen finishing on an eaves flashing the eaves flashing should finish on the horizontal face of the eaves flashing\nso that is is not exposed to UV or able to flap in the wind.\nAll underlays, particularly those made from synthetics (including some foils), may be vulnerable to degradation\nfrom fumes and reflected UV. Advice should be requested from the supplier when they are to be used in a\nsituation where they may be exposed to fumes or reflected UV.\n10.11.6 \nInstalling Underlay \nUnderlay can be laid vertically or horizontally. Side laps must be a minimum of 150 mm for roofs and 75 mm for\nwalls; end laps must be a minimum of 150 mm for both roof and wall cladding. At the eaves, the underlay should\nterminate on the upper side of the eaves flashing or overhang fascia by no more than 20 mm.\nThe COP recommends that all underlay is terminated at the ridge, and if not it should be slit or slotted to allow\npassive ventilation of the ceiling cavity.\nThe COP allows roof and wall underlay to be laid either vertically or horizontally in all cases. However, that is in\ndivergence with E2/AS1, so it is advised for buildings within the scope of E2/AS1 (ie, buildings designed within\nthe scope of NZS 3604) that the requirements of the local BCA (Building Consent Authority) is sought before\ndiverging from E2/AS1.\nRips smaller than 75 mm on walls or roofs can be repaired using a compatible flashing tape, but roof underlay\ndamage greater than this requires a new piece of underlay captured by the cladding fastenings.\nFlue penetrations must have a minimum distance of 50 mm from the outer liner to any underlay or flammable\nmaterial.\nE2/AS1 requires self-support underlay laid horizontally on support to be used at pitches below 10 deg . That is not a\nrequirement of the COP as underlay support is no substitute for good ventilation design and effective\nweathertight details.\nWhen using vented battens, the underlay should be positioned on the upper side of the batten, directly under the\nroof cladding. Having the underlay directly under the roof allows the battens to vent the roof cavity directly and\nallows the underlay to perform its normal design function; putting roofing underlay under ventilated battens\nimpedes roof cavity ventilation\nWith re-roofs in any material, it is not acceptable to lay a new roof over existing underlay or underlay support,\nunless the latter is in \"as new\" condition. See 14.19 Fixing Aluminium Sheeting.\nWall underlays must have a minimum side lap of 150 mm and an end lap of 75 mm. Wall underlay on a drained\ncavity should be on the dry (inside) face of the cavity, and be rigid enough to restrain wall insulation from\ncontacting the cladding, or have secondary strapping to achieve such.\n 10 INTERNAL MOISTURE\n 10 \n 11 \n 10 \n 10.11 \n331\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.11.6.1 \nHorizontal Laying \nHorizontally laid underlay must be supported if used under long-run metal roofing, unless both edges are\nsupported by purlins. Under metal tiles, self-supporting underlay can be laid over the roof trusses at spans up to\n1.2 m.\nUnderlay laid horizontally must be laid starting at the lowest point of the roof, running over the bottom purlin and\nmust overlap into the gutter by a maximum of 20 mm to prevent wicking. When an eaves flashing is used the\nunderlay should terminate on the downslope of the flashing.\nTo lay roof underlay horizontally, more than one roll can be progressively unrolled, one roofing sheet width at a\ntime. Running multiple rolls straight can, however, be difficult in windy conditions.\n10.11.6.2 \nVertical Laying \nThe laps on vertically laid roof underlay may face in either direction, as the direction of lay is usually dictated by\nconstruction sequencing or wind direction at the time of laying.\nThe bottom end of vertically laid roof underlay must overlap into the gutter by a maximum of 20 mm to prevent\nwicking. When an eaves flashing is used the underlay should terminate on the downslope of the flashing.\n10.11.6.3 \nUnderlay Support \nSelf-supporting underlays in lined roof spaces may be laid unsupported at spans up to 1.2 m. Other underlays\nmust be supported. Underlay support may be safety mesh, hexagonal galvanised wire netting, builders' tape, or\nother suitably strong and durable material.\nSafety mesh must be designed and installed to comply with the requirements of the AS/NZS 4389:2015\nCorroded galvanised safety mesh and wire netting can be damaging to any metal roofing and especially to pre-\npainted aluminium. Pre-painted aluminium cladding must be protected from contact with potentially corroding\nsteel including netting, staples, or fasteners, See 14.19 Fixing Aluminium Sheeting\n 10 INTERNAL MOISTURE\n 10 \n 11 \n 10 \n 10.11 \n332\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[327,328,329,330,331,332],"subsections":[{"number":"10.11A","title":"Roof Cavity Condensation","level":3,"content":"10.11 \nUnderlay \nCondensation that forms on the cold under-surface of the roof system must be contained until ambient\nconditions allow it to evaporate. Containment is normally achieved by using an absorbent roofing underlay. It is\nthe role of roofing underlay to absorb moisture temporarily and then release it back into the atmosphere.\nA printable bulletin about installing underlay when reroofing is\navailable at: BU01 Double laying of Underlay on Re-roof\nExtract:\n\"...we recommend that no more than a single layer of compliant underlay (laps\nexcluded) is present on a profiled metal roof.\"\nA common misconception holds that the roofing underlay acts as a drainage plane, channelling condensation\nfrom the underside of the metal roof to the gutter. In practice, most of the condensation forms on the underside\nof the underlay. Although roofing underlays are permeable, they still form a substantial vapour check, and as they\nare in contact with the roof, they are at a similar temperature. Any condensation that does form on the underside\nof the roof and falls onto the underlay generally only tracks down the underlay as far as the next purlin, where it is\ntrapped and absorbed by the underlay. Underlay is also affected by holes from roofing fasteners, making it\nunreliable as a \"second roof\".\nAs it is designed to execute its primary purpose of aiding in the management of internal moisture, underlay\nshould not be used as a compensation for unreliable weatherproofing design and installation\nSmall Space:Condensation on \nunderside of cladding;often not muc\nbecause of small air volume.\nCondensation on top can be large \nwhen air is moist and calm.\nPermeable underlay in contact with \ncladding gets cold. The resulting \ncondensation get absorbed by the \nunderlay, which can be significant if \nthe attic air is moist.\nPermeable underlay stays a \nbit warmer, no condensation\n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n327\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[327]},{"number":"10.11B","title":"Condensation Under Roofing Underlay","level":3,"content":"Most condensation on the underside of the roof system occurs under the roofing underlay.\nThe presence of pooling condensate on the upper side of a roofing underlay indicates that the absorptive capacity\nof the underlay has been exceeded. Not only the underlay will be saturated, but so will the ceiling structural\nmembers and insulation; mould, corrosion, and decay are inevitable. The cure is to decrease the amount of\nmoisture entering the ceiling cavity or increase ventilation of the ceiling space.\n10.11C Chronic Condensation \nChronic condensation problem caused by induction of moist air into the ceiling cavity. Although the underlay here\nis doing a good job of containing the surface water, the timber trusses, insulation, and ceiling below the underlay\nwere saturated with water.\nUnderlay also acts as a partial air barrier. (Rigid air barriers are also available.) Water will generally only go where\ngravity or air pressure takes it. By effectively reducing the space behind cladding, the underlay allows rapid\npressure equalisation on each side of the cladding, thereby reducing the ability of water to enter the space.\n10.11.1 \nUnderlay Standards \n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n328\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[328],"images":[{"filename":"condensation-under-roofing-underlay-detail-04.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/condensation-under-roofing-underlay-detail-04.png","caption":"","dimensions":{"width":296,"height":222}},{"filename":"condensation-under-roofing-underlay-detail-06.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/condensation-under-roofing-underlay-detail-06.png","caption":"","dimensions":{"width":400,"height":288}}]},{"number":"10.11C","title":"Chronic Condensation","level":3,"content":"10.11B Condensation Under Roofing Underlay\nMost condensation on the underside of the roof system occurs under the roofing underlay.\nThe presence of pooling condensate on the upper side of a roofing underlay indicates that the absorptive capacity\nof the underlay has been exceeded. Not only the underlay will be saturated, but so will the ceiling structural\nmembers and insulation; mould, corrosion, and decay are inevitable. The cure is to decrease the amount of\nmoisture entering the ceiling cavity or increase ventilation of the ceiling space.\nChronic condensation problem caused by induction of moist air into the ceiling cavity. Although the underlay here\nis doing a good job of containing the surface water, the timber trusses, insulation, and ceiling below the underlay\nwere saturated with water.\nUnderlay also acts as a partial air barrier. (Rigid air barriers are also available.) Water will generally only go where\ngravity or air pressure takes it. By effectively reducing the space behind cladding, the underlay allows rapid\npressure equalisation on each side of the cladding, thereby reducing the ability of water to enter the space.\n10.11.1 \nUnderlay Standards \n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n328\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[328]},{"number":"10.11.1","title":"Underlay Standards","level":3,"content":"10.11B Condensation Under Roofing Underlay\nMost condensation on the underside of the roof system occurs under the roofing underlay.\nThe presence of pooling condensate on the upper side of a roofing underlay indicates that the absorptive capacity\nof the underlay has been exceeded. Not only the underlay will be saturated, but so will the ceiling structural\nmembers and insulation; mould, corrosion, and decay are inevitable. The cure is to decrease the amount of\nmoisture entering the ceiling cavity or increase ventilation of the ceiling space.\n10.11C Chronic Condensation \nChronic condensation problem caused by induction of moist air into the ceiling cavity. Although the underlay here\nis doing a good job of containing the surface water, the timber trusses, insulation, and ceiling below the underlay\nwere saturated with water.\nUnderlay also acts as a partial air barrier. (Rigid air barriers are also available.) Water will generally only go where\ngravity or air pressure takes it. By effectively reducing the space behind cladding, the underlay allows rapid\npressure equalisation on each side of the cladding, thereby reducing the ability of water to enter the space.\n10.11.1 \nUnderlay Standards \n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n328\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[328]},{"number":"10.11.1A","title":"Minimum Requirements for Underlays for Metal Roof Cladding","level":3,"content":"Permeable underlays must comply with NZS 2295, Amendment 1:2017, as shown in Properties of Roofing\nUnderlay, or have an appropriate product certification such as a Codemark certificate.\nReflective foil underlays must comply with AS/NZS 4200.1:2017\nClassification\nR1\nR3\nR2\nR4\nGrade\nHeavyweightHeavyweight\nSelf-\nsupport\nSelf-\nsupport\nType\nKraft\nSynthetic\nKraft\nSynthetic\nApplication\nResidential or light commercial\nbuildings\nProperty\nUnit\nAbsorbency\ng/m\n 150\n 150\n 150\n 150\nWater Vapour\nResistance\nMN s/g 7\n 0.5\n 7\n 0.5\nWater resistance\nmm\nhead\n 100\n 100\n 100\n 100\nTensile Strength\nMD\nKN/m\n 9\n 3\n 11\n 3\nTensile Strength CD KN/m\n 4.5\n 2\n 6\n 2.5\nEdge Tear\nResistance MD\nN\n 40\n 100\n 70\n 150\nEdge Tear\nResistance CD\nN\n 35\n 80\n 55\n 130\nBased on Table B1 of NZS 2295 Amendment 1:2017.\nSelf-supporting (S/S) is defined as strong enough to support its own weight up to a 1200 mm span.\npH between 5.5 and 8.0.\nKraft-based underlays shall have shrinkage less than 0.5% and a maximum run length of 10 m.\nSynthetic underlays may have any run length.\nAny underlay is regarded as fire-retardant if it has a Flammability Index (FI) of 5 or less when tested to AS/NZS\n1530 Part 2.\n10.11.2 \nUnderlay Requirements \nThe NZBC requires underlays under profiled metal roofing and direct-fixed metal wall cladding on lined residential\nbuildings to be both permeable and absorbent. \nUnderlays fixed to the dry side of a lined drained cavity may be permeable and non-absorbent. \nUnderlays are not required in unlined structures, but in such cases non-permeable, non-absorbent underlays such\nas foil are typically used to increase reflectivity and to minimise condensation.\n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n329\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[329]},{"number":"10.11.2","title":"Underlay Requirements","level":3,"content":"Permeable underlays must comply with NZS 2295, Amendment 1:2017, as shown in Properties of Roofing\nUnderlay, or have an appropriate product certification such as a Codemark certificate.\nReflective foil underlays must comply with AS/NZS 4200.1:2017\n10.11.1A Minimum Requirements for Underlays for Metal Roof Cladding\nClassification\nR1\nR3\nR2\nR4\nGrade\nHeavyweightHeavyweight\nSelf-\nsupport\nSelf-\nsupport\nType\nKraft\nSynthetic\nKraft\nSynthetic\nApplication\nResidential or light commercial\nbuildings\nProperty\nUnit\nAbsorbency\ng/m\n 150\n 150\n 150\n 150\nWater Vapour\nResistance\nMN s/g 7\n 0.5\n 7\n 0.5\nWater resistance\nmm\nhead\n 100\n 100\n 100\n 100\nTensile Strength\nMD\nKN/m\n 9\n 3\n 11\n 3\nTensile Strength CD KN/m\n 4.5\n 2\n 6\n 2.5\nEdge Tear\nResistance MD\nN\n 40\n 100\n 70\n 150\nEdge Tear\nResistance CD\nN\n 35\n 80\n 55\n 130\nBased on Table B1 of NZS 2295 Amendment 1:2017.\nSelf-supporting (S/S) is defined as strong enough to support its own weight up to a 1200 mm span.\npH between 5.5 and 8.0.\nKraft-based underlays shall have shrinkage less than 0.5% and a maximum run length of 10 m.\nSynthetic underlays may have any run length.\nAny underlay is regarded as fire-retardant if it has a Flammability Index (FI) of 5 or less when tested to AS/NZS\n1530 Part 2.\n10.11.2 \nUnderlay Requirements \nThe NZBC requires underlays under profiled metal roofing and direct-fixed metal wall cladding on lined residential\nbuildings to be both permeable and absorbent. \nUnderlays fixed to the dry side of a lined drained cavity may be permeable and non-absorbent. \nUnderlays are not required in unlined structures, but in such cases non-permeable, non-absorbent underlays such\nas foil are typically used to increase reflectivity and to minimise condensation.\n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n329\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[329]},{"number":"10.11.3","title":"Types Of Underlay","level":3,"content":"In some wall and roof applications, the underlay is required to be Fire Retardant with Flammability Index 5 when\ntested to AS1530.2. Refer NZBC C/AS3-AS6, clause 4.17.8 \nUnderlays designated as self-supporting can be laid without support at spans up to 1.2 m.\nOther requirements for underlays vary for different cladding systems, but the important features of absorbency,\npermeability, water resistance, tensile strength, edge tear resistance, PH, and durability are important to comply\nwith the requirements of the NZBC.\nThe Code of Practice recommends synthetic self-supporting fire-retardant underlays for residential roofing\napplications.\n10.11.3 \nTypes Of Underlay \nApart from their fire retardance and ability to self-support, underlays are classified according to their absorbency\nand permeability.\nPermeable and Absorbent:\nKraft paper-based - bitumen impregnated paper\nSynthetic - 2 or 3 layers, using permeable synthetic film strengthened by sandwiched non-woven fabric.\nPermeable, non-absorbent:\nSynthetic permeable non-absorbent underlays are mainly used as wall wrap inside a drained cavity or with\ndirect fixed absorbent claddings.\nNon-Permeable, non-absorbent:\nfoil - Reflective aluminium foil over a flexible substrate. These can be either double-sided or white-faced.\n10.11.4 \nUnderlay Usage \nIn lined buildings and dwellings, an absorbent permeable underlay is required under metal roofs. The same applies\nto direct-fixed steel wall cladding, but underlays used behind a drained cavity are not required to be absorbent.\nFor aesthetic reasons, a foil-faced (or white-faced) vapour check layer may be used in unlined commercial or\nindustrial applications to reduce heat radiation from the roof cladding and provide enhancement of light. For\ninsulated applications, foil is normally used as a vapour check under the insulation and an absorbent permeable\nunderlay used above with a 20 mm gap from the roof cladding.\nOn non-residential dwellings, profiled roof-light sheeting running in continuous lengths from the ridge can have\nmultiple skins to avoid condensation dripping from the sheeting or plastic sheet with a spacer can be used to\nlessen condensation. Roof underlays should not be laid continuously under translucent roof or wall cladding.\n10.11.5 \nUnderlay Durability \n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n330\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[330]},{"number":"10.11.4","title":"Underlay Usage","level":3,"content":"In some wall and roof applications, the underlay is required to be Fire Retardant with Flammability Index 5 when\ntested to AS1530.2. Refer NZBC C/AS3-AS6, clause 4.17.8 \nUnderlays designated as self-supporting can be laid without support at spans up to 1.2 m.\nOther requirements for underlays vary for different cladding systems, but the important features of absorbency,\npermeability, water resistance, tensile strength, edge tear resistance, PH, and durability are important to comply\nwith the requirements of the NZBC.\nThe Code of Practice recommends synthetic self-supporting fire-retardant underlays for residential roofing\napplications.\n10.11.3 \nTypes Of Underlay \nApart from their fire retardance and ability to self-support, underlays are classified according to their absorbency\nand permeability.\nPermeable and Absorbent:\nKraft paper-based - bitumen impregnated paper\nSynthetic - 2 or 3 layers, using permeable synthetic film strengthened by sandwiched non-woven fabric.\nPermeable, non-absorbent:\nSynthetic permeable non-absorbent underlays are mainly used as wall wrap inside a drained cavity or with\ndirect fixed absorbent claddings.\nNon-Permeable, non-absorbent:\nfoil - Reflective aluminium foil over a flexible substrate. These can be either double-sided or white-faced.\n10.11.4 \nUnderlay Usage \nIn lined buildings and dwellings, an absorbent permeable underlay is required under metal roofs. The same applies\nto direct-fixed steel wall cladding, but underlays used behind a drained cavity are not required to be absorbent.\nFor aesthetic reasons, a foil-faced (or white-faced) vapour check layer may be used in unlined commercial or\nindustrial applications to reduce heat radiation from the roof cladding and provide enhancement of light. For\ninsulated applications, foil is normally used as a vapour check under the insulation and an absorbent permeable\nunderlay used above with a 20 mm gap from the roof cladding.\nOn non-residential dwellings, profiled roof-light sheeting running in continuous lengths from the ridge can have\nmultiple skins to avoid condensation dripping from the sheeting or plastic sheet with a spacer can be used to\nlessen condensation. Roof underlays should not be laid continuously under translucent roof or wall cladding.\n10.11.5 \nUnderlay Durability \n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n330\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[330]},{"number":"10.11.5","title":"Underlay Durability","level":3,"content":"In some wall and roof applications, the underlay is required to be Fire Retardant with Flammability Index 5 when\ntested to AS1530.2. Refer NZBC C/AS3-AS6, clause 4.17.8 \nUnderlays designated as self-supporting can be laid without support at spans up to 1.2 m.\nOther requirements for underlays vary for different cladding systems, but the important features of absorbency,\npermeability, water resistance, tensile strength, edge tear resistance, PH, and durability are important to comply\nwith the requirements of the NZBC.\nThe Code of Practice recommends synthetic self-supporting fire-retardant underlays for residential roofing\napplications.\n10.11.3 \nTypes Of Underlay \nApart from their fire retardance and ability to self-support, underlays are classified according to their absorbency\nand permeability.\nPermeable and Absorbent:\nKraft paper-based - bitumen impregnated paper\nSynthetic - 2 or 3 layers, using permeable synthetic film strengthened by sandwiched non-woven fabric.\nPermeable, non-absorbent:\nSynthetic permeable non-absorbent underlays are mainly used as wall wrap inside a drained cavity or with\ndirect fixed absorbent claddings.\nNon-Permeable, non-absorbent:\nfoil - Reflective aluminium foil over a flexible substrate. These can be either double-sided or white-faced.\n10.11.4 \nUnderlay Usage \nIn lined buildings and dwellings, an absorbent permeable underlay is required under metal roofs. The same applies\nto direct-fixed steel wall cladding, but underlays used behind a drained cavity are not required to be absorbent.\nFor aesthetic reasons, a foil-faced (or white-faced) vapour check layer may be used in unlined commercial or\nindustrial applications to reduce heat radiation from the roof cladding and provide enhancement of light. For\ninsulated applications, foil is normally used as a vapour check under the insulation and an absorbent permeable\nunderlay used above with a 20 mm gap from the roof cladding.\nOn non-residential dwellings, profiled roof-light sheeting running in continuous lengths from the ridge can have\nmultiple skins to avoid condensation dripping from the sheeting or plastic sheet with a spacer can be used to\nlessen condensation. Roof underlays should not be laid continuously under translucent roof or wall cladding.\n10.11.5 \nUnderlay Durability \n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n330\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[330]},{"number":"10.11.6","title":"Installing Underlay","level":3,"content":"NZBC Clause B2.3.1 requires non-structural building elements and those that are moderately difficult to replace\nto have a durability of 15 years, or, if difficult to replace, to have the same durability as the more durable elements\nof a system. Alternatively, the design should allow the replacement of the less durable elements without\nremoving the more durable components.\nCompliance with NZBC B2, therefore, requires roofing underlay to have durability equal to that of the roof\ncladding and no less than 15 years.\nWhen finishing on an eaves flashing the eaves flashing should finish on the horizontal face of the eaves flashing\nso that is is not exposed to UV or able to flap in the wind.\nAll underlays, particularly those made from synthetics (including some foils), may be vulnerable to degradation\nfrom fumes and reflected UV. Advice should be requested from the supplier when they are to be used in a\nsituation where they may be exposed to fumes or reflected UV.\n10.11.6 \nInstalling Underlay \nUnderlay can be laid vertically or horizontally. Side laps must be a minimum of 150 mm for roofs and 75 mm for\nwalls; end laps must be a minimum of 150 mm for both roof and wall cladding. At the eaves, the underlay should\nterminate on the upper side of the eaves flashing or overhang fascia by no more than 20 mm.\nThe COP recommends that all underlay is terminated at the ridge, and if not it should be slit or slotted to allow\npassive ventilation of the ceiling cavity.\nThe COP allows roof and wall underlay to be laid either vertically or horizontally in all cases. However, that is in\ndivergence with E2/AS1, so it is advised for buildings within the scope of E2/AS1 (ie, buildings designed within\nthe scope of NZS 3604) that the requirements of the local BCA (Building Consent Authority) is sought before\ndiverging from E2/AS1.\nRips smaller than 75 mm on walls or roofs can be repaired using a compatible flashing tape, but roof underlay\ndamage greater than this requires a new piece of underlay captured by the cladding fastenings.\nFlue penetrations must have a minimum distance of 50 mm from the outer liner to any underlay or flammable\nmaterial.\nE2/AS1 requires self-support underlay laid horizontally on support to be used at pitches below 10 deg . That is not a\nrequirement of the COP as underlay support is no substitute for good ventilation design and effective\nweathertight details.\nWhen using vented battens, the underlay should be positioned on the upper side of the batten, directly under the\nroof cladding. Having the underlay directly under the roof allows the battens to vent the roof cavity directly and\nallows the underlay to perform its normal design function; putting roofing underlay under ventilated battens\nimpedes roof cavity ventilation\nWith re-roofs in any material, it is not acceptable to lay a new roof over existing underlay or underlay support,\nunless the latter is in \"as new\" condition. See 14.19 Fixing Aluminium Sheeting.\nWall underlays must have a minimum side lap of 150 mm and an end lap of 75 mm. Wall underlay on a drained\ncavity should be on the dry (inside) face of the cavity, and be rigid enough to restrain wall insulation from\ncontacting the cladding, or have secondary strapping to achieve such.\n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n331\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[331]},{"number":"10.11.6.1","title":"Horizontal Laying","level":3,"content":"10.11.6.1 \nHorizontal Laying \nHorizontally laid underlay must be supported if used under long-run metal roofing, unless both edges are\nsupported by purlins. Under metal tiles, self-supporting underlay can be laid over the roof trusses at spans up to\n1.2 m.\nUnderlay laid horizontally must be laid starting at the lowest point of the roof, running over the bottom purlin and\nmust overlap into the gutter by a maximum of 20 mm to prevent wicking. When an eaves flashing is used the\nunderlay should terminate on the downslope of the flashing.\nTo lay roof underlay horizontally, more than one roll can be progressively unrolled, one roofing sheet width at a\ntime. Running multiple rolls straight can, however, be difficult in windy conditions.\n10.11.6.2 \nVertical Laying \nThe laps on vertically laid roof underlay may face in either direction, as the direction of lay is usually dictated by\nconstruction sequencing or wind direction at the time of laying.\nThe bottom end of vertically laid roof underlay must overlap into the gutter by a maximum of 20 mm to prevent\nwicking. When an eaves flashing is used the underlay should terminate on the downslope of the flashing.\n10.11.6.3 \nUnderlay Support \nSelf-supporting underlays in lined roof spaces may be laid unsupported at spans up to 1.2 m. Other underlays\nmust be supported. Underlay support may be safety mesh, hexagonal galvanised wire netting, builders' tape, or\nother suitably strong and durable material.\nSafety mesh must be designed and installed to comply with the requirements of the AS/NZS 4389:2015\nCorroded galvanised safety mesh and wire netting can be damaging to any metal roofing and especially to pre-\npainted aluminium. Pre-painted aluminium cladding must be protected from contact with potentially corroding\nsteel including netting, staples, or fasteners, See 14.19 Fixing Aluminium Sheeting\n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n332\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[332]},{"number":"10.11.6.2","title":"Vertical Laying","level":3,"content":"10.11.6.1 \nHorizontal Laying \nHorizontally laid underlay must be supported if used under long-run metal roofing, unless both edges are\nsupported by purlins. Under metal tiles, self-supporting underlay can be laid over the roof trusses at spans up to\n1.2 m.\nUnderlay laid horizontally must be laid starting at the lowest point of the roof, running over the bottom purlin and\nmust overlap into the gutter by a maximum of 20 mm to prevent wicking. When an eaves flashing is used the\nunderlay should terminate on the downslope of the flashing.\nTo lay roof underlay horizontally, more than one roll can be progressively unrolled, one roofing sheet width at a\ntime. Running multiple rolls straight can, however, be difficult in windy conditions.\n10.11.6.2 \nVertical Laying \nThe laps on vertically laid roof underlay may face in either direction, as the direction of lay is usually dictated by\nconstruction sequencing or wind direction at the time of laying.\nThe bottom end of vertically laid roof underlay must overlap into the gutter by a maximum of 20 mm to prevent\nwicking. When an eaves flashing is used the underlay should terminate on the downslope of the flashing.\n10.11.6.3 \nUnderlay Support \nSelf-supporting underlays in lined roof spaces may be laid unsupported at spans up to 1.2 m. Other underlays\nmust be supported. Underlay support may be safety mesh, hexagonal galvanised wire netting, builders' tape, or\nother suitably strong and durable material.\nSafety mesh must be designed and installed to comply with the requirements of the AS/NZS 4389:2015\nCorroded galvanised safety mesh and wire netting can be damaging to any metal roofing and especially to pre-\npainted aluminium. Pre-painted aluminium cladding must be protected from contact with potentially corroding\nsteel including netting, staples, or fasteners, See 14.19 Fixing Aluminium Sheeting\n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n332\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[332]},{"number":"10.11.6.3","title":"Underlay Support","level":3,"content":"10.11.6.1 \nHorizontal Laying \nHorizontally laid underlay must be supported if used under long-run metal roofing, unless both edges are\nsupported by purlins. Under metal tiles, self-supporting underlay can be laid over the roof trusses at spans up to\n1.2 m.\nUnderlay laid horizontally must be laid starting at the lowest point of the roof, running over the bottom purlin and\nmust overlap into the gutter by a maximum of 20 mm to prevent wicking. When an eaves flashing is used the\nunderlay should terminate on the downslope of the flashing.\nTo lay roof underlay horizontally, more than one roll can be progressively unrolled, one roofing sheet width at a\ntime. Running multiple rolls straight can, however, be difficult in windy conditions.\n10.11.6.2 \nVertical Laying \nThe laps on vertically laid roof underlay may face in either direction, as the direction of lay is usually dictated by\nconstruction sequencing or wind direction at the time of laying.\nThe bottom end of vertically laid roof underlay must overlap into the gutter by a maximum of 20 mm to prevent\nwicking. When an eaves flashing is used the underlay should terminate on the downslope of the flashing.\n10.11.6.3 \nUnderlay Support \nSelf-supporting underlays in lined roof spaces may be laid unsupported at spans up to 1.2 m. Other underlays\nmust be supported. Underlay support may be safety mesh, hexagonal galvanised wire netting, builders' tape, or\nother suitably strong and durable material.\nSafety mesh must be designed and installed to comply with the requirements of the AS/NZS 4389:2015\nCorroded galvanised safety mesh and wire netting can be damaging to any metal roofing and especially to pre-\npainted aluminium. Pre-painted aluminium cladding must be protected from contact with potentially corroding\nsteel including netting, staples, or fasteners, See 14.19 Fixing Aluminium Sheeting\n 10 INTERNAL MOISTURE\n 10 \n 10.11 UNDERLAY\n 11 \n 10 \n 10.11 \n332\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[332]}]},{"number":"10.12","title":"Additional Information","level":2,"content":"10.12 \nAdditional Information \n10.12.1 \nCold Roofs \nWith cold roof construction, the under-surface temperature of the metal roofing will at times be quite low, so the\nprimary tool of managing condensation is controlling the concentration of water vapour in the attic space. Some\ncondensation is inevitable, and it must be managed to ensure the wetness is not excessive in either degree or\nduration - allowing moisture to accumulate.\nIn typical cold roof construction, the insulation is at ceiling level and there is an air gap between the insulation\nand the roof surface.\n10.12.2 \nWarm Roofs \nWith Warm Roofs, the insulation is in direct continuous contact with the underside of the roof. The most\ncommon form of Warm Roof in New Zealand is pre-formed insulation panel. Other proprietary systems may\nconsist of several layers with a vapour control layer on the underside.\nWarm roofs do not inherently have the same natural ventilation as a cold roof, so the internal environment may\nrequire management to prevent condensation problems.\n10.12.3 \nNight Sky Radiation \nRoof cladding absorbs radiation from the sun and the attic space becomes warmer; some of this\nheat is radiated into a clear sky at night.\nBecause all objects radiate heat to cooler objects, night sky radiation will occur when there are no\nclouds in the sky. The radiation rate depends on the emittance of the roof cladding.\nRadiation to the sky can cause the cladding temperature to drop as much as 5C below that of the\nsurrounding air; that causes dew when the surface temperature reaches dew point or frost if the\ntemperature falls below zero.\n10.12.4 \nThe Mechanics of Condensation \nWater exists in 3 states: solid (ice), liquid (water), and gas (water vapour).\n 10 INTERNAL MOISTURE\n 10 \n 12 \n 10 \n 10.12 \n333\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.12.4A Hydrogen Bonding\nWater molecules in liquid form bonds, which create a dense material.\nIn ice and liquid water, individual HO molecules bond together in a special way, called 'hydrogen bonding'.\nIn gas form, the kinetic energy of the molecules has overcome these hydrogen bonds, and so the individual water\nmolecules are free to move. The water molecule itself is light compared with other gases in the atmosphere, so it\ntends to migrate upwards, ie, into the roof space.\nWater vapour may condense into a liquid form when the concentration rises or the temperature drops. The\ntemperature at which air can hold no more water is called the 'Dew Point'. The water vapour capacity of air is\nrelative to temperature.\n 10 INTERNAL MOISTURE\n 10 \n 12 \n 10 \n 10.12 \n334\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.12.4B Shower Condensation\nThe high humidity created while showering causes condensation on even relatively warm surfaces because of the\nhigh concentration of vapour.\n10.12.4C Condensation on a Cold Surface\nIn warm conditions, condensation will form on a cold surface, even when the concentration of water vapour in the\natmosphere is low.\n10.12.5 \nRelative Humidity \nRH is strongly dependent on temperature. For instance, a parcel of air at 15 deg C and 50% RH is cooled down to\n10 deg C. Now, the relative humidity of this parcel of air will be close to 70%, without the actual amount of water\nhaving increased. Relative Humidity expresses how close the air is to being saturated with water vapour. Warm\nair can hold more moisture in absolute terms, cold air less. If the air becomes saturated (RH 100%) water vapour\nwill condense as mist in the air or as water on adjacent cold surfaces. \nRelative humidity is a suitable measure when the risk of condensation on surfaces or mould growth is to be\nevaluated. \n 10 INTERNAL MOISTURE\n 10 \n 12 \n 10 \n 10.12 \n335\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n10.12.6 \nAbsolute Humidity \nAbsolute Humidity is measured in grams of water per volume of air (grams per cubic metre [g/m ]). It is not\ntemperature dependent and in the example above the absolute humidity would remain unchanged at around 6.4\ng/m , regardless of the temperature change.\nAbsolute humidity is a suitable measure if one is looking for sources or sinks of water in an environment where\ntemperature is changing. If the absolute humidity is cycling during the day, eg, increases in a roof cavity as the\ntemperature rises during the day. It could indicate that moisture is released by the building materials during the\nday and absorbed or condenses during the cooler nights. \n10.12.7 \nWater Vapour Pressure \nWater Vapour Pressure is more based on the fundamental physics and expresses the contribution (ie, the partial\npressure) of water vapour to the total pressure of an air mix. For example, at a pressure of 1000 Pa (1kPa), the\npartial pressure of nitrogen may be 700 Pa, the partial pressure of oxygen 200 Pa and the partial pressure of water\nvapour 99 Pa, and other gases 1 Pa. \nThis parameter is useful to evaluate moisture migration from one point in the building to another. \n3\n3\n 10 INTERNAL MOISTURE\n 10 \n 12 \n 10 \n 10.12 \n336\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[333,334,335,336],"subsections":[{"number":"10.12.1","title":"Cold Roofs","level":3,"content":"10.12 \nAdditional Information \n10.12.1 \nCold Roofs \nWith cold roof construction, the under-surface temperature of the metal roofing will at times be quite low, so the\nprimary tool of managing condensation is controlling the concentration of water vapour in the attic space. Some\ncondensation is inevitable, and it must be managed to ensure the wetness is not excessive in either degree or\nduration - allowing moisture to accumulate.\nIn typical cold roof construction, the insulation is at ceiling level and there is an air gap between the insulation\nand the roof surface.\n10.12.2 \nWarm Roofs \nWith Warm Roofs, the insulation is in direct continuous contact with the underside of the roof. The most\ncommon form of Warm Roof in New Zealand is pre-formed insulation panel. Other proprietary systems may\nconsist of several layers with a vapour control layer on the underside.\nWarm roofs do not inherently have the same natural ventilation as a cold roof, so the internal environment may\nrequire management to prevent condensation problems.\n10.12.3 \nNight Sky Radiation \nRoof cladding absorbs radiation from the sun and the attic space becomes warmer; some of this\nheat is radiated into a clear sky at night.\nBecause all objects radiate heat to cooler objects, night sky radiation will occur when there are no\nclouds in the sky. The radiation rate depends on the emittance of the roof cladding.\nRadiation to the sky can cause the cladding temperature to drop as much as 5C below that of the\nsurrounding air; that causes dew when the surface temperature reaches dew point or frost if the\ntemperature falls below zero.\n10.12.4 \nThe Mechanics of Condensation \nWater exists in 3 states: solid (ice), liquid (water), and gas (water vapour).\n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n333\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[333]},{"number":"10.12.2","title":"Warm Roofs","level":3,"content":"10.12 \nAdditional Information \n10.12.1 \nCold Roofs \nWith cold roof construction, the under-surface temperature of the metal roofing will at times be quite low, so the\nprimary tool of managing condensation is controlling the concentration of water vapour in the attic space. Some\ncondensation is inevitable, and it must be managed to ensure the wetness is not excessive in either degree or\nduration - allowing moisture to accumulate.\nIn typical cold roof construction, the insulation is at ceiling level and there is an air gap between the insulation\nand the roof surface.\n10.12.2 \nWarm Roofs \nWith Warm Roofs, the insulation is in direct continuous contact with the underside of the roof. The most\ncommon form of Warm Roof in New Zealand is pre-formed insulation panel. Other proprietary systems may\nconsist of several layers with a vapour control layer on the underside.\nWarm roofs do not inherently have the same natural ventilation as a cold roof, so the internal environment may\nrequire management to prevent condensation problems.\n10.12.3 \nNight Sky Radiation \nRoof cladding absorbs radiation from the sun and the attic space becomes warmer; some of this\nheat is radiated into a clear sky at night.\nBecause all objects radiate heat to cooler objects, night sky radiation will occur when there are no\nclouds in the sky. The radiation rate depends on the emittance of the roof cladding.\nRadiation to the sky can cause the cladding temperature to drop as much as 5C below that of the\nsurrounding air; that causes dew when the surface temperature reaches dew point or frost if the\ntemperature falls below zero.\n10.12.4 \nThe Mechanics of Condensation \nWater exists in 3 states: solid (ice), liquid (water), and gas (water vapour).\n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n333\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[333]},{"number":"10.12.3","title":"Night Sky Radiation","level":3,"content":"10.12 \nAdditional Information \n10.12.1 \nCold Roofs \nWith cold roof construction, the under-surface temperature of the metal roofing will at times be quite low, so the\nprimary tool of managing condensation is controlling the concentration of water vapour in the attic space. Some\ncondensation is inevitable, and it must be managed to ensure the wetness is not excessive in either degree or\nduration - allowing moisture to accumulate.\nIn typical cold roof construction, the insulation is at ceiling level and there is an air gap between the insulation\nand the roof surface.\n10.12.2 \nWarm Roofs \nWith Warm Roofs, the insulation is in direct continuous contact with the underside of the roof. The most\ncommon form of Warm Roof in New Zealand is pre-formed insulation panel. Other proprietary systems may\nconsist of several layers with a vapour control layer on the underside.\nWarm roofs do not inherently have the same natural ventilation as a cold roof, so the internal environment may\nrequire management to prevent condensation problems.\n10.12.3 \nNight Sky Radiation \nRoof cladding absorbs radiation from the sun and the attic space becomes warmer; some of this\nheat is radiated into a clear sky at night.\nBecause all objects radiate heat to cooler objects, night sky radiation will occur when there are no\nclouds in the sky. The radiation rate depends on the emittance of the roof cladding.\nRadiation to the sky can cause the cladding temperature to drop as much as 5C below that of the\nsurrounding air; that causes dew when the surface temperature reaches dew point or frost if the\ntemperature falls below zero.\n10.12.4 \nThe Mechanics of Condensation \nWater exists in 3 states: solid (ice), liquid (water), and gas (water vapour).\n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n333\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[333]},{"number":"10.12.4","title":"The Mechanics of Condensation","level":3,"content":"10.12 \nAdditional Information \n10.12.1 \nCold Roofs \nWith cold roof construction, the under-surface temperature of the metal roofing will at times be quite low, so the\nprimary tool of managing condensation is controlling the concentration of water vapour in the attic space. Some\ncondensation is inevitable, and it must be managed to ensure the wetness is not excessive in either degree or\nduration - allowing moisture to accumulate.\nIn typical cold roof construction, the insulation is at ceiling level and there is an air gap between the insulation\nand the roof surface.\n10.12.2 \nWarm Roofs \nWith Warm Roofs, the insulation is in direct continuous contact with the underside of the roof. The most\ncommon form of Warm Roof in New Zealand is pre-formed insulation panel. Other proprietary systems may\nconsist of several layers with a vapour control layer on the underside.\nWarm roofs do not inherently have the same natural ventilation as a cold roof, so the internal environment may\nrequire management to prevent condensation problems.\n10.12.3 \nNight Sky Radiation \nRoof cladding absorbs radiation from the sun and the attic space becomes warmer; some of this\nheat is radiated into a clear sky at night.\nBecause all objects radiate heat to cooler objects, night sky radiation will occur when there are no\nclouds in the sky. The radiation rate depends on the emittance of the roof cladding.\nRadiation to the sky can cause the cladding temperature to drop as much as 5C below that of the\nsurrounding air; that causes dew when the surface temperature reaches dew point or frost if the\ntemperature falls below zero.\n10.12.4 \nThe Mechanics of Condensation \nWater exists in 3 states: solid (ice), liquid (water), and gas (water vapour).\n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n333\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[333]},{"number":"10.12.4A","title":"Hydrogen Bonding","level":3,"content":"Water molecules in liquid form bonds, which create a dense material.\nIn ice and liquid water, individual HO molecules bond together in a special way, called 'hydrogen bonding'.\nIn gas form, the kinetic energy of the molecules has overcome these hydrogen bonds, and so the individual water\nmolecules are free to move. The water molecule itself is light compared with other gases in the atmosphere, so it\ntends to migrate upwards, ie, into the roof space.\nWater vapour may condense into a liquid form when the concentration rises or the temperature drops. The\ntemperature at which air can hold no more water is called the 'Dew Point'. The water vapour capacity of air is\nrelative to temperature.\n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n334\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[334],"images":[{"filename":"hydrogen-bonding-detail-04.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/hydrogen-bonding-detail-04.png","caption":"","dimensions":{"width":418,"height":407}}]},{"number":"10.12.4B","title":"Shower Condensation","level":3,"content":"The high humidity created while showering causes condensation on even relatively warm surfaces because of the\nhigh concentration of vapour.\n10.12.4C Condensation on a Cold Surface\nIn warm conditions, condensation will form on a cold surface, even when the concentration of water vapour in the\natmosphere is low.\n10.12.5 \nRelative Humidity \nRH is strongly dependent on temperature. For instance, a parcel of air at 15 deg C and 50% RH is cooled down to\n10 deg C. Now, the relative humidity of this parcel of air will be close to 70%, without the actual amount of water\nhaving increased. Relative Humidity expresses how close the air is to being saturated with water vapour. Warm\nair can hold more moisture in absolute terms, cold air less. If the air becomes saturated (RH 100%) water vapour\nwill condense as mist in the air or as water on adjacent cold surfaces. \nRelative humidity is a suitable measure when the risk of condensation on surfaces or mould growth is to be\nevaluated. \n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n335\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[335],"images":[{"filename":"shower-condensation-detail-05.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/shower-condensation-detail-05.png","caption":"","dimensions":{"width":400,"height":216}},{"filename":"shower-condensation-detail-06.png","url":"https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/shower-condensation-detail-06.png","caption":"","dimensions":{"width":400,"height":268}}]},{"number":"10.12.4C","title":"Condensation on a Cold Surface","level":3,"content":"10.12.4B Shower Condensation\nThe high humidity created while showering causes condensation on even relatively warm surfaces because of the\nhigh concentration of vapour.\nIn warm conditions, condensation will form on a cold surface, even when the concentration of water vapour in the\natmosphere is low.\n10.12.5 \nRelative Humidity \nRH is strongly dependent on temperature. For instance, a parcel of air at 15 deg C and 50% RH is cooled down to\n10 deg C. Now, the relative humidity of this parcel of air will be close to 70%, without the actual amount of water\nhaving increased. Relative Humidity expresses how close the air is to being saturated with water vapour. Warm\nair can hold more moisture in absolute terms, cold air less. If the air becomes saturated (RH 100%) water vapour\nwill condense as mist in the air or as water on adjacent cold surfaces. \nRelative humidity is a suitable measure when the risk of condensation on surfaces or mould growth is to be\nevaluated. \n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n335\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[335]},{"number":"10.12.5","title":"Relative Humidity","level":3,"content":"10.12.4B Shower Condensation\nThe high humidity created while showering causes condensation on even relatively warm surfaces because of the\nhigh concentration of vapour.\n10.12.4C Condensation on a Cold Surface\nIn warm conditions, condensation will form on a cold surface, even when the concentration of water vapour in the\natmosphere is low.\n10.12.5 \nRelative Humidity \nRH is strongly dependent on temperature. For instance, a parcel of air at 15 deg C and 50% RH is cooled down to\n10 deg C. Now, the relative humidity of this parcel of air will be close to 70%, without the actual amount of water\nhaving increased. Relative Humidity expresses how close the air is to being saturated with water vapour. Warm\nair can hold more moisture in absolute terms, cold air less. If the air becomes saturated (RH 100%) water vapour\nwill condense as mist in the air or as water on adjacent cold surfaces. \nRelative humidity is a suitable measure when the risk of condensation on surfaces or mould growth is to be\nevaluated. \n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n335\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[335]},{"number":"10.12.6","title":"Absolute Humidity","level":3,"content":"10.12.6 \nAbsolute Humidity \nAbsolute Humidity is measured in grams of water per volume of air (grams per cubic metre [g/m ]). It is not\ntemperature dependent and in the example above the absolute humidity would remain unchanged at around 6.4\ng/m , regardless of the temperature change.\nAbsolute humidity is a suitable measure if one is looking for sources or sinks of water in an environment where\ntemperature is changing. If the absolute humidity is cycling during the day, eg, increases in a roof cavity as the\ntemperature rises during the day. It could indicate that moisture is released by the building materials during the\nday and absorbed or condenses during the cooler nights. \n10.12.7 \nWater Vapour Pressure \nWater Vapour Pressure is more based on the fundamental physics and expresses the contribution (ie, the partial\npressure) of water vapour to the total pressure of an air mix. For example, at a pressure of 1000 Pa (1kPa), the\npartial pressure of nitrogen may be 700 Pa, the partial pressure of oxygen 200 Pa and the partial pressure of water\nvapour 99 Pa, and other gases 1 Pa. \nThis parameter is useful to evaluate moisture migration from one point in the building to another. \n3\n3\n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n336\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[336]},{"number":"10.12.7","title":"Water Vapour Pressure","level":3,"content":"10.12.6 \nAbsolute Humidity \nAbsolute Humidity is measured in grams of water per volume of air (grams per cubic metre [g/m ]). It is not\ntemperature dependent and in the example above the absolute humidity would remain unchanged at around 6.4\ng/m , regardless of the temperature change.\nAbsolute humidity is a suitable measure if one is looking for sources or sinks of water in an environment where\ntemperature is changing. If the absolute humidity is cycling during the day, eg, increases in a roof cavity as the\ntemperature rises during the day. It could indicate that moisture is released by the building materials during the\nday and absorbed or condenses during the cooler nights. \n10.12.7 \nWater Vapour Pressure \nWater Vapour Pressure is more based on the fundamental physics and expresses the contribution (ie, the partial\npressure) of water vapour to the total pressure of an air mix. For example, at a pressure of 1000 Pa (1kPa), the\npartial pressure of nitrogen may be 700 Pa, the partial pressure of oxygen 200 Pa and the partial pressure of water\nvapour 99 Pa, and other gases 1 Pa. \nThis parameter is useful to evaluate moisture migration from one point in the building to another. \n3\n3\n 10 INTERNAL MOISTURE\n 10 \n 10.12 ADDITIONAL INFORMATION\n 12 \n 10 \n 10.12 \n336\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[336]}]}]}]}