{
  "chapterNumber": 12,
  "title": "Fitness For Purpose",
  "version": "v25.12",
  "sectionCount": 23,
  "sections": [
    {
      "number": "12",
      "title": "Fitness For Purpose",
      "level": 1,
      "content": "In addition to Corrosion (NZBC: B2 - Durability), other issues which may affect the lifespan or perceived quality\nof metal roof and wall cladding, include:\nOil Canning.\nPurlin Creasing.\nColour Differential.\nRoof Noise \nRoof noise refers to excessive intermittent sound emanating from the area of a roof surface or ceiling cavity.\nSound is usually created by movement and is carried by vibratory movement of the air. The movement that\ngenerates sound can be triggered by three main factors:\nWind.\nPrecipitation (rain, hail, or snow).\nTemperature (thermal).\nEach of these can be broken down into sub-groups.\n12.1.1 \nWind Noise \nRoof noise triggered by the wind can take several forms:\nUnderlay flutter,\nBanging of the roof itself, or things against the roof,\nVibration of flashings.\n12.1.1A Underlay Flutter\nUnderlay flutter will be perceived as a high-pitched noise. Depending on its origin, it can be minimised using\nvarious techniques, for example:\nIf it is coming from the eaves, cutting the underlay back from the spouting and installing an eaves flashing.\nIf it is coming from the body of the roof, installing a high front gutter.\nInstalling spray-on foam insulation.\n12.1.1B Wind Banging\nWind banging can be the pan drumming or banging against the sarking or purlin support. It normally only occurs\nwith standing seam profiles and it is a function of the roof design, material thickness, and wind loads. These\nproblems should be referred to the manufacturer or designer.\n12.1.1C Flashing Vibration\nExcessive movement or insufficient clearance between a penetration and the cladding may also cause noise.\nFlashing vibration can be a whistling noise or a high-pitched sound like an engine, known as motor boating. The\nedges of all flashings should have a stiffening fold and the vertical face should be fixed to the structure or wall\ncladding to avoid vibration.\nPrecipitation Noise \nMost people find the sound of rain on the roof comforting, however, it may be intrusive.\nThe best way to attenuate precipitation noise is to increase the insulation levels in the ceiling space\nChip-coated metal tiles are likely to produce less precipitation noise than roll formed cladding. Fleece lined\ncladding has also been found to reduce precipitation noise.\n12.1.3 \nThermal Noise \nNearly all profiled metal roofs will exhibit thermal roof noise at times. Typically, this is a relatively minor and\nuncommon event, and attracts no attention. Sometimes, however, the frequency and/or volume of the noise can\nbe to the point where it causes discomfort and distress to the occupants.\nThermal roof noise is caused by the roof expanding or contracting due to temperature fluctuation. The effect can\nbe immediate as a cloud passes over the sun or delayed as the roof and roof structure cool down at night.\nNot all materials in a roof structure absorb the same amount of heat, and not all materials have the same amount\nof thermally-induced movement. Differential movement may emanate from many places, including the layer of\nroofing exposed to the sun against layers underneath (i.e. a flashing or lap), the roof profile against the fastener,\nor the roof against the support structure. It can also happen when expansion of the roof causes one member of\nthe support structure directly to move against another. Movement may also occur as sudden popping in the pan\nof a profile that releases static friction and causes sound.\nThe source of thermal roof noise can be difficult to identify in many cases. However, roof noise can be divided\ninto three main categories by source. They are:\nFlashings,\npopping of pan, and\nother causes of thermal noise.\nFlashings\nWhere flashings are solid fixed to a vertical surface and to the cladding, differential movement between them and\nthe roof may cause noise. Using clip-fastened systems allowing flashings and roofing to move independently to\neach other will help minimise noise associated with this movement.\nPan Popping\nOil canning, or canning, is the term used to describe visible waviness of the pan of a metal roof. It is most\nnoticeable in roofs with wide trays but may also occur in secret fixed or trapezoidal profiles.\nPan popping is accompanied by canning, but not all canning jobs result in thermal roof noise. Canning is most\nprevalent in tray profiles, but popping roof noise is most often found with trapezoidal or secret fixed roofs.\nCanning can be minimised by good rollformer tooling design and adjustment, but it can also be exacerbated by\nvariations in mechanical properties and shape of the coil.\nEven steel coil well within standard tolerances can have characteristics that lead to high levels of canning in\n\nsome profiles and tooling set-ups.\nCanning can also be induced by the building structure; a concave curve in the support structure will put the pan\nof the profile into compression and lead to canning.\nTo avoid canning problems, both the structure and the sheets should be inspected for straightness before\ninstallation.\nOther Causes of Thermal Noise\nRoof expansion noise can be caused by the energy released when the roof expands or shrinks relative to its\nsupport, and sliding occurs at the fasteners, clips, purlins, or within the structure itself. The exact source of most\nroof noise is hard to identify.\nA common observation of noisy roofs is poor contact between the purlin and the rafter due to insufficient\npressure being put on the purlin when installing purlin screws, allowing the purlin to ride up on the thread. It may\ncreate a source of noise as purlins rotate under thermal expansion forces. Purlin screws should have a length of\nunthreaded shank below the head of at least the purlin thickness.\n12.1.3A Poor Purlin-to-Rafter Connection\nIt is impossible to prevent expansion, but its effects can be minimised.\n\nThermal variation can be inhibited by using lighter colours or ventilating the roof space. Lowering roof\ntemperatures minimises thermal noise. Increasing ventilation in the ceiling cavity is the easiest way to lower roof\ntemperatures and may have the added benefit of lowering roof space humidity.\nThe accumulation of stress can be minimised by avoiding excessive run lengths. Friction can be reduced by using\nlow-friction underlay and using oversized fastener holes to allow materials to move freely. Fasteners should be\nchecked for over-tightening and eased if necessary.\nMany roof noise problems are typically associated with long, low, dark skillion roofs, but some noisy roofs have\nnone of those design features. To date, the MRM have not recorded any instances of thermal roof noise with\nroofs fastened to steel purlins or frames.\nThermal roof noise is a modern problem. Although often attributed to the roof material, steel and the profiles we\nform it into have not changed. In one case, a noisy trapezoidal roof was replaced with a corrugated roof\nmanufactured from imported material, and the noise problem remained.\nChanges that have occurred in the industry include:\nroofs are screwed on rather than nailed,\nroofs are longer and darker,\npurlins are screw fastened not nailed,\nhouses are more airtight and far better insulated,\ntrusses have largely replaced rafters, and\nframing timber is lighter and younger.\nIt is possible that a number of these aspects contribute in complex ways to produce varying thermal expansion\nnoise levels, but we certainly don't want to go back to nailed roofs and uninsulated houses.\nThe exact source of much roof noise is still a mystery. Auckland University is currently researching a scientific\napproach to identifying causes and solutions to roof noise.\nPurlin Creasing \nDue to improvements in colour coating technology, the level of reflection and retention of gloss is higher. It will\nbecome much less obvious over time as gloss levels diminish and dirt accumulates on the roof.\nOverdriven nails or screws can produce visible distortion on the purlin line in the pan of trapezoidal profiles that\ncannot be easily remedied.\n12.2A Purlin Creasing on Trapezoidal Profiles\nTrapezoidal profiles with a wide pan manufactured from 0.4 mm steel and 0.7 mm aluminium are\nparticularly susceptible to purlin creasing, and although it does not affect performance, their\nappearance can be aesthetically unacceptable\nIt is the responsibility of the roofing contractor to ensure that nails are not overdriven. A nail or screw should only\nbe driven into the purlin to produce a 50% compression of the sealing washer or until the roof is firm.\nBefore fixing the roof cladding, the contractor should check the alignment of the purlins or girts. Purlins should be\naligned within 5 mm tolerance of each other to avoid purlin creasing.\nPurlins should be accurately positioned with their top face parallel to the rafter and should be fixed to a straight\nline.\nWhen appearance is important or where wide pan trapezoidal cladding is close to eye level, heavier gauge\ncladding should be specified because light gauges such as 0.4 mm steel and 0.7 mm aluminium are likely to\nshow distortion. Purlin creasing will happen on both concave and convex curved roofs if the recommended purlin\nspacings are exceeded, and great care should be taken to align purlins on such roofs.\nPurlin creasing can be exacerbated by roof traffic. 14.5 Walking On Roofs\nAll trapezoidal and secret x proles will exhibit purlin creasing to some degree. The extent to which it is visible\ndepends greatly on the line of sight and light conditions. These can change it from being immediately obvious to\nalmost invisible. Purlin creasing can be minimised by design by specifying 0.55 mm, rather than 0.40 mm\nmaterial, or selecting a prole with a narrower pan. Minimising roof trac on G300 tray roong will also help, but\n\nthe only way to ensure that purlin creasing will not be an issue is to lay a roof on solid sarking, or by using a\ncorrugate prole.\nA printable bulletin is available at: PC01 Purlin Creasing or Print-Through\nExctract:\n\"Purlin creasing is similar to canning, except that the distortion in the pan occurs along the purlin lines\nrather than in a random pattern. It can also be referred to as print-through. The cause is often hard to\ndiagnose...\"\nFlashing Buckling \nAs a rule, to minimise buckling, any dimension of a flashing should be a maximum of 300 mm between folds.\nEven so, transverse flashings such as ridges and aprons can exhibit some waviness due to the combined effects\nof thermal movement and timber shrinkage. \nThe only way to eliminate this is to fasten ridges on a hot day to dry timber. As this is seldom practical, light,\nevenly spaced waviness in a ridge or transverse flashing is not considered a defect.\nBeing highly visible, waviness in barges and external corner flashings can be more problematic. In a situation\nwhere there is a low tolerance for waviness, flashings should be designed to keep the width of flat surfaces\nminimal and to be clip fastened on both edges to accommodate movement. Where possible, manufacturing from\na heavier gauge material will also help minimise buckling.\nSevere localised irreversible buckling of a flashing caused by compression wood is the result of a defect of the\nstructure and should be rectified. See 8.9 Compression Timber.\n12.3A Flashing Buckling\nOil Canning \nDistortion of flat metal areas is an aesthetic problem associated with the manufacture of metal roof and wall\ncladding and flashings. Flat pan architectural metal panels, wide flashings, and profiled metal cladding with wide\npan configurations without stiffening ribs are all liable to show distortion in flat metal areas. It is known as oil-\ncanning or panning.\nOil canning can be defined as visible waviness in the flat areas of metal roofing and wall cladding. It can also be\nreferred to as panning, canning, stress wrinkling or elastic buckling, and is caused by differential stresses in the\nmetal. As the metal tries to relieve these stresses in panels with high width to thickness ratios, material buckles\nout of plane producing the characteristic waviness of oil canning\nIt has an aesthetic effect and is not a structural or durability issue. Some highly reflective paint finishes and\nmetals or different light conditions can exacerbate the visual effect of oil canning. Some distortion is inevitable in\nlight gauges. It can become an issue of customer acceptance because customer expectations are often\nunrealistically high.\nThe degree of waviness can be hard to measure and is highly dependent on viewing angles, the position of the\nsun, and the reflectivity of the surface. Cladding installations with a high degree of visibility should be designed to\nminimise oil canning.\nOil canning is more common where the width of unformed sections is large. It can usually be avoided or\nminimised in normal rib and trough section profiles with a maximum pan width of 300 mm, and flashings that\nhave a maximum unformed width of 300 mm. See 8.1 Flashing Materials\nIn standing seam roofs with pan widths of more than 300 mm, some oil canning is normally evident. Many\ndesigners regard oil canning in such profiles as inherent to the material and treat it as a desired effect\naccentuating the material's natural characteristics.\nManufacturers and installers should minimise unintentional non-flat conditions, and any visual waviness should\nbe relatively even and regular.\nThere are various causes for oil canning:\nmaterial;\nroll tool design and setting;\ninstallation; and\nexpansion allowance.\n12.4.1 \nMaterial \nAll profiled metal roof and wall products begin in a coil form. Stresses induced during coil production can\ncontribute to oil canning. Examples of these stresses are:\nFull Centre: The coil is longer in the centre of the strip than near the edges. This creates buckles and ripples in\nthe mid-coil area.\n\nWavy Edge: The coil is longer on one edge of the strip. That causes waviness on the long edge.\nCamber: The side edge of the coil deviates from a straight line. The normal tolerance for a 1200 mm wide coil\nis a 2 mm deviation in a 2 m length, but some forming processes and end uses cannot tolerate that variation.\nUneven Material Strength: During the forming process material may tend to draw unevenly from the softer\nareas rather than evenly as designed; it leaves excessive material in the \"harder\" areas.\nSlitting: Generally, coil for flashings and narrower products are cut by slitting from a single, wider master coil.\nSlitting of a master coil can release and redistribute residual forces. It can also mean that different qualities of\nthe master coil are modified or changed in the slit coil, i.e., a full centre in a master coil can become a wavy\nedge in a slit coil and the slit coil may not retain all the attributes of the master coil or sister coils.\n12.4.2 \nTool Design \nBy the nature of the process, many stresses are created during roll forming. These must be minimised and\nequalised as much as possible during manufacturing. Forming tools must be designed to form the material\nprogressively.\nCorrugated and ribbed profiles are most often formed from the centre and moved outward thereby \"pushing\" the\ndifferential stresses to the edges of the sheet. Generally, profiled metal rib and corrugated profiles, flashings, and\nmost trough sections can be expected to provide finishes free of avoidable distortion.\nStanding seam profiles typically need more forming on the edges of the feed material and little or none in the\ncentre of the sheet, which tends to trap uneven stresses in the centre of the profile. Often one edge requires more\nforming than the other, meaning the stresses developed are not even in the sheet.\nSome evenly distributed oil canning can normally be expected in standing seam products with a width of more\nthan 300 mm, and it is considered acceptable.\n12.4.3 \nInstallation \nOil canning can occur in fixed cladding, even though it does not fit accurately, when fixings are too\nfar apart or when fixings are overdriven. It can also result from an uneven substrate, irregular\nbearing on the purlins or the structural framing being out of line.\nThermal expansion can also increase oil canning. Longitudinal expansion should be accommodated by using\nsliding clips that allow movement. See E Expansion Clips. Transverse expansion is usually accommodated in\nthe upstand of the profile, but this can only happen if adjacent pans are not in contact at the base. Wide perimeter\nflashings must be designed to allow for the independent movement of the flashing and the cladding.\nA convex curve in the roof structure can cause canning as it puts the pan of the profile under compression.\nSometimes this curve is inadvertent. Concave roof cladding and flashings give rise to oil-canning because the\npans are in compression. There are limitations on curved radii to avoid oil canning. See 15.1 Curved Roofs.\nCommercially designed truss sections and rafters may have camber induced in their manufacture, anticipating\ndeflection under load. The degree of curve that may be accommodated by any profile is largely determined by the\nwidth of the pan and is also affected by the material thickness and grade.\nMinimising Oil Canning \nGood design and installation can minimise oil canning.\nMaterials:\nUse thicker material.\nUse low gloss paints or embossed surfaces.\nUse natural weathering materials that dull over time.\nFlashings:\nLimit flashing width to 300 mm.\nLimit the joined length of fixed flashings to 12 m.\nAttach wide flashings with brackets that allow independent thermal expansion.\nManufacture a stiffening swage into flashings that have a face width greater than 200 mm.\nDo not fix flashings to timber with a moisture content greater than 18%.\nCladding:\nLimit cladding length.\nEnsure the purlin alignment avoids convex curving.\nInspect for flatness before installation.\nAvoid thin materials.\nColour Differential \nIt is both the cladding manufacturer and the roof cladding contractor's responsibility to ensure\nthat the same brands of pre-painted material are used on the same building.\nFailure to do so could result in differences in colour, gloss and weathering, which quickly becomes\nobvious.\nThe differences come from different paint formulations and do not necessarily indicate that the\nmaterials will perform differently in service. All New Zealand manufacturers provide information\nabout the manufacturer, the type of coating and the manufacturing date in the branding on the\nreverse side of uncoated and colour coated steel. Double-sided coatings are not branded.\n12.5.1 \nTouch-Up \nAir-drying touch-up paints have different weathering characteristics from the baked-on finish of\npre-painted coating systems, and variations in natural light conditions will emphasise these\ndifferences, producing an unacceptable aesthetic appearance.\nSpray cans should not be used for repairing scratches on pre-painted sheeting.\nIf the scratch is obvious from 3 m, the sheeting should be replaced; if not, then it should be left alone. Minor\nsurface scratches become less noticeable as the coating weathers and are best left as they do not appreciably\naffect the corrosion-inhibiting properties of the material.\nWidespread damage caused by rough handling or an accident, however, should not be corrected by repainting;\ninstead, the affected material should be replaced.\nTransport, Handling And Storage of rooflights \nAll roof lights should be handled and stacked with care as film surfaces are easily scratched, and\nheavy stacks can damage lower sheets.\nAll roof lights should be stored flat, the right way up, on 75 mm battens not more than 1.2 m apart.\nStacks should not be higher than 1 m and should be covered and protected from rain and sun.\nThermoplastic sheets can overheat and deform in a stack, and exposed stacks can permanently\ndiscolour due to the effect of sun and water.\n12.6.1 \nMaintenance \nFirst maintenance after 12 months requires cleaning any grime or debris using warm water and a\nstiff bristled brush. Every 2 - 3 years rooflights should be inspected for damage, the condition of the\nflashings, and sealants and the fixings should be checked for tightness.\nRoof lights must not be painted over as this renders them hazardous to maintenance workers.\nBecause painted roof lights appear no different in place than metal sheets, this practice can be dangerous for any\nworkers carrying out maintenance work on the roof. Painting can also cause heat distortion which can lead to\npremature failure.\nAs a warning, primary and secondary fasteners can be brightly coloured, providing a contrast with the remainder\nof the roof cladding surrounding the roof light areas. The area can also be marked around with a distinctly painted\nstripe.\nLichen will accumulate on plastic roof lighting wherever there is a source of nutrients, but it should be removed\nwith care. See 16.7.1 Lichen And Mould.\nDrinking Water \nRainwater collected from roofs clad with steel and prepainted steel products will comply with the\nprovisions of NZBC G 1 2.3.1, provided the water is not contaminated from other sources.\nThe first 25 mm of rainfall from a newly installed roof should be discarded before drinking water\ncollection starts, and always disconnect downpipes when painting a roof. Spouting should be\nregularly cleaned to avoid the build-up of dirt and debris that can affect water quality.\nWhere a paint or paint system is applied to the roof, its suitability for the collection of drinking\nwater should be established. When rainwater from pre-painted roof cladding is used for drinking,\nit is advisable to repaint the roof as soon as its surface has weathered.\nWater collected from metal roof cladding, spouting or gutters made from aluminium, copper and\nstainless steel will not normally be contaminated by rainfall in suburban and rural areas. However,\nfallout from manufacturing plants, top dressing, and the contamination resulting from roof\ncleaning can affect the water quality, and in these cases downpipes should be disconnected.",
      "pdfPages": [
        351,
        352,
        353,
        354,
        355,
        356,
        357,
        358,
        359,
        360,
        361,
        362,
        363,
        364
      ],
      "subsections": [
        {
          "number": "12.1",
          "title": "Roof Noise",
          "level": 2,
          "content": "Roof noise refers to excessive intermittent sound emanating from the area of a roof surface or ceiling cavity.\nSound is usually created by movement and is carried by vibratory movement of the air. The movement that\ngenerates sound can be triggered by three main factors:\nWind.\nPrecipitation (rain, hail, or snow).\nTemperature (thermal).\nEach of these can be broken down into sub-groups.\n12.1.1 \nWind Noise \nRoof noise triggered by the wind can take several forms:\nUnderlay flutter,\nBanging of the roof itself, or things against the roof,\nVibration of flashings.\n12.1.1A Underlay Flutter\nUnderlay flutter will be perceived as a high-pitched noise. Depending on its origin, it can be minimised using\nvarious techniques, for example:\nIf it is coming from the eaves, cutting the underlay back from the spouting and installing an eaves flashing.\nIf it is coming from the body of the roof, installing a high front gutter.\nInstalling spray-on foam insulation.\n12.1.1B Wind Banging\nWind banging can be the pan drumming or banging against the sarking or purlin support. It normally only occurs\nwith standing seam profiles and it is a function of the roof design, material thickness, and wind loads. These\nproblems should be referred to the manufacturer or designer.\n12.1.1C Flashing Vibration\nExcessive movement or insufficient clearance between a penetration and the cladding may also cause noise.\nFlashing vibration can be a whistling noise or a high-pitched sound like an engine, known as motor boating. The\nedges of all flashings should have a stiffening fold and the vertical face should be fixed to the structure or wall\ncladding to avoid vibration.\nPrecipitation Noise \nMost people find the sound of rain on the roof comforting, however, it may be intrusive.\nThe best way to attenuate precipitation noise is to increase the insulation levels in the ceiling space\nChip-coated metal tiles are likely to produce less precipitation noise than roll formed cladding. Fleece lined\ncladding has also been found to reduce precipitation noise.\n12.1.3 \nThermal Noise \nNearly all profiled metal roofs will exhibit thermal roof noise at times. Typically, this is a relatively minor and\nuncommon event, and attracts no attention. Sometimes, however, the frequency and/or volume of the noise can\nbe to the point where it causes discomfort and distress to the occupants.\nThermal roof noise is caused by the roof expanding or contracting due to temperature fluctuation. The effect can\nbe immediate as a cloud passes over the sun or delayed as the roof and roof structure cool down at night.\nNot all materials in a roof structure absorb the same amount of heat, and not all materials have the same amount\nof thermally-induced movement. Differential movement may emanate from many places, including the layer of\nroofing exposed to the sun against layers underneath (i.e. a flashing or lap), the roof profile against the fastener,\nor the roof against the support structure. It can also happen when expansion of the roof causes one member of\nthe support structure directly to move against another. Movement may also occur as sudden popping in the pan\nof a profile that releases static friction and causes sound.\nThe source of thermal roof noise can be difficult to identify in many cases. However, roof noise can be divided\ninto three main categories by source. They are:\nFlashings,\npopping of pan, and\nother causes of thermal noise.\nFlashings\nWhere flashings are solid fixed to a vertical surface and to the cladding, differential movement between them and\nthe roof may cause noise. Using clip-fastened systems allowing flashings and roofing to move independently to\neach other will help minimise noise associated with this movement.\nPan Popping\nOil canning, or canning, is the term used to describe visible waviness of the pan of a metal roof. It is most\nnoticeable in roofs with wide trays but may also occur in secret fixed or trapezoidal profiles.\nPan popping is accompanied by canning, but not all canning jobs result in thermal roof noise. Canning is most\nprevalent in tray profiles, but popping roof noise is most often found with trapezoidal or secret fixed roofs.\nCanning can be minimised by good rollformer tooling design and adjustment, but it can also be exacerbated by\nvariations in mechanical properties and shape of the coil.\nEven steel coil well within standard tolerances can have characteristics that lead to high levels of canning in\n\nsome profiles and tooling set-ups.\nCanning can also be induced by the building structure; a concave curve in the support structure will put the pan\nof the profile into compression and lead to canning.\nTo avoid canning problems, both the structure and the sheets should be inspected for straightness before\ninstallation.\nOther Causes of Thermal Noise\nRoof expansion noise can be caused by the energy released when the roof expands or shrinks relative to its\nsupport, and sliding occurs at the fasteners, clips, purlins, or within the structure itself. The exact source of most\nroof noise is hard to identify.\nA common observation of noisy roofs is poor contact between the purlin and the rafter due to insufficient\npressure being put on the purlin when installing purlin screws, allowing the purlin to ride up on the thread. It may\ncreate a source of noise as purlins rotate under thermal expansion forces. Purlin screws should have a length of\nunthreaded shank below the head of at least the purlin thickness.\n12.1.3A Poor Purlin-to-Rafter Connection\nIt is impossible to prevent expansion, but its effects can be minimised.\n\nThermal variation can be inhibited by using lighter colours or ventilating the roof space. Lowering roof\ntemperatures minimises thermal noise. Increasing ventilation in the ceiling cavity is the easiest way to lower roof\ntemperatures and may have the added benefit of lowering roof space humidity.\nThe accumulation of stress can be minimised by avoiding excessive run lengths. Friction can be reduced by using\nlow-friction underlay and using oversized fastener holes to allow materials to move freely. Fasteners should be\nchecked for over-tightening and eased if necessary.\nMany roof noise problems are typically associated with long, low, dark skillion roofs, but some noisy roofs have\nnone of those design features. To date, the MRM have not recorded any instances of thermal roof noise with\nroofs fastened to steel purlins or frames.\nThermal roof noise is a modern problem. Although often attributed to the roof material, steel and the profiles we\nform it into have not changed. In one case, a noisy trapezoidal roof was replaced with a corrugated roof\nmanufactured from imported material, and the noise problem remained.\nChanges that have occurred in the industry include:\nroofs are screwed on rather than nailed,\nroofs are longer and darker,\npurlins are screw fastened not nailed,\nhouses are more airtight and far better insulated,\ntrusses have largely replaced rafters, and\nframing timber is lighter and younger.\nIt is possible that a number of these aspects contribute in complex ways to produce varying thermal expansion\nnoise levels, but we certainly don't want to go back to nailed roofs and uninsulated houses.\nThe exact source of much roof noise is still a mystery. Auckland University is currently researching a scientific\napproach to identifying causes and solutions to roof noise.",
          "pdfPages": [
            352,
            353,
            354,
            355
          ],
          "subsections": [
            {
              "number": "12.1.1",
              "title": "Wind Noise",
              "level": 3,
              "content": "12.1 \nRoof Noise \nRoof noise refers to excessive intermittent sound emanating from the area of a roof surface or ceiling cavity.\nSound is usually created by movement and is carried by vibratory movement of the air. The movement that\ngenerates sound can be triggered by three main factors:\nWind.\nPrecipitation (rain, hail, or snow).\nTemperature (thermal).\nEach of these can be broken down into sub-groups.\n12.1.1 \nWind Noise \nRoof noise triggered by the wind can take several forms:\nUnderlay flutter,\nBanging of the roof itself, or things against the roof,\nVibration of flashings.\n12.1.1A Underlay Flutter\nUnderlay flutter will be perceived as a high-pitched noise. Depending on its origin, it can be minimised using\nvarious techniques, for example:\nIf it is coming from the eaves, cutting the underlay back from the spouting and installing an eaves flashing.\nIf it is coming from the body of the roof, installing a high front gutter.\nInstalling spray-on foam insulation.\n12.1.1B Wind Banging\nWind banging can be the pan drumming or banging against the sarking or purlin support. It normally only occurs\nwith standing seam profiles and it is a function of the roof design, material thickness, and wind loads. These\nproblems should be referred to the manufacturer or designer.\n12.1.1C Flashing Vibration\nExcessive movement or insufficient clearance between a penetration and the cladding may also cause noise.\nFlashing vibration can be a whistling noise or a high-pitched sound like an engine, known as motor boating. The\nedges of all flashings should have a stiffening fold and the vertical face should be fixed to the structure or wall\ncladding to avoid vibration.",
              "pdfPages": [
                352
              ]
            },
            {
              "number": "12.1.1A",
              "title": "Underlay Flutter",
              "level": 3,
              "content": "12.1 \nRoof Noise \nRoof noise refers to excessive intermittent sound emanating from the area of a roof surface or ceiling cavity.\nSound is usually created by movement and is carried by vibratory movement of the air. The movement that\ngenerates sound can be triggered by three main factors:\nWind.\nPrecipitation (rain, hail, or snow).\nTemperature (thermal).\nEach of these can be broken down into sub-groups.\n12.1.1 \nWind Noise \nRoof noise triggered by the wind can take several forms:\nUnderlay flutter,\nBanging of the roof itself, or things against the roof,\nVibration of flashings.\nUnderlay flutter will be perceived as a high-pitched noise. Depending on its origin, it can be minimised using\nvarious techniques, for example:\nIf it is coming from the eaves, cutting the underlay back from the spouting and installing an eaves flashing.\nIf it is coming from the body of the roof, installing a high front gutter.\nInstalling spray-on foam insulation.\n12.1.1B Wind Banging\nWind banging can be the pan drumming or banging against the sarking or purlin support. It normally only occurs\nwith standing seam profiles and it is a function of the roof design, material thickness, and wind loads. These\nproblems should be referred to the manufacturer or designer.\n12.1.1C Flashing Vibration\nExcessive movement or insufficient clearance between a penetration and the cladding may also cause noise.\nFlashing vibration can be a whistling noise or a high-pitched sound like an engine, known as motor boating. The\nedges of all flashings should have a stiffening fold and the vertical face should be fixed to the structure or wall\ncladding to avoid vibration.",
              "pdfPages": [
                352
              ]
            },
            {
              "number": "12.1.1B",
              "title": "Wind Banging",
              "level": 3,
              "content": "12.1 \nRoof Noise \nRoof noise refers to excessive intermittent sound emanating from the area of a roof surface or ceiling cavity.\nSound is usually created by movement and is carried by vibratory movement of the air. The movement that\ngenerates sound can be triggered by three main factors:\nWind.\nPrecipitation (rain, hail, or snow).\nTemperature (thermal).\nEach of these can be broken down into sub-groups.\n12.1.1 \nWind Noise \nRoof noise triggered by the wind can take several forms:\nUnderlay flutter,\nBanging of the roof itself, or things against the roof,\nVibration of flashings.\n12.1.1A Underlay Flutter\nUnderlay flutter will be perceived as a high-pitched noise. Depending on its origin, it can be minimised using\nvarious techniques, for example:\nIf it is coming from the eaves, cutting the underlay back from the spouting and installing an eaves flashing.\nIf it is coming from the body of the roof, installing a high front gutter.\nInstalling spray-on foam insulation.\nWind banging can be the pan drumming or banging against the sarking or purlin support. It normally only occurs\nwith standing seam profiles and it is a function of the roof design, material thickness, and wind loads. These\nproblems should be referred to the manufacturer or designer.\n12.1.1C Flashing Vibration\nExcessive movement or insufficient clearance between a penetration and the cladding may also cause noise.\nFlashing vibration can be a whistling noise or a high-pitched sound like an engine, known as motor boating. The\nedges of all flashings should have a stiffening fold and the vertical face should be fixed to the structure or wall\ncladding to avoid vibration.",
              "pdfPages": [
                352
              ]
            },
            {
              "number": "12.1.1C",
              "title": "Flashing Vibration",
              "level": 3,
              "content": "12.1 \nRoof Noise \nRoof noise refers to excessive intermittent sound emanating from the area of a roof surface or ceiling cavity.\nSound is usually created by movement and is carried by vibratory movement of the air. The movement that\ngenerates sound can be triggered by three main factors:\nWind.\nPrecipitation (rain, hail, or snow).\nTemperature (thermal).\nEach of these can be broken down into sub-groups.\n12.1.1 \nWind Noise \nRoof noise triggered by the wind can take several forms:\nUnderlay flutter,\nBanging of the roof itself, or things against the roof,\nVibration of flashings.\n12.1.1A Underlay Flutter\nUnderlay flutter will be perceived as a high-pitched noise. Depending on its origin, it can be minimised using\nvarious techniques, for example:\nIf it is coming from the eaves, cutting the underlay back from the spouting and installing an eaves flashing.\nIf it is coming from the body of the roof, installing a high front gutter.\nInstalling spray-on foam insulation.\n12.1.1B Wind Banging\nWind banging can be the pan drumming or banging against the sarking or purlin support. It normally only occurs\nwith standing seam profiles and it is a function of the roof design, material thickness, and wind loads. These\nproblems should be referred to the manufacturer or designer.\nExcessive movement or insufficient clearance between a penetration and the cladding may also cause noise.\nFlashing vibration can be a whistling noise or a high-pitched sound like an engine, known as motor boating. The\nedges of all flashings should have a stiffening fold and the vertical face should be fixed to the structure or wall\ncladding to avoid vibration.",
              "pdfPages": [
                352
              ]
            },
            {
              "number": "12.1.2",
              "title": "Precipitation Noise",
              "level": 3,
              "content": "Most people find the sound of rain on the roof comforting, however, it may be intrusive.\nThe best way to attenuate precipitation noise is to increase the insulation levels in the ceiling space\nChip-coated metal tiles are likely to produce less precipitation noise than roll formed cladding. Fleece lined\ncladding has also been found to reduce precipitation noise.\n12.1.3 \nThermal Noise \nNearly all profiled metal roofs will exhibit thermal roof noise at times. Typically, this is a relatively minor and\nuncommon event, and attracts no attention. Sometimes, however, the frequency and/or volume of the noise can\nbe to the point where it causes discomfort and distress to the occupants.\nThermal roof noise is caused by the roof expanding or contracting due to temperature fluctuation. The effect can\nbe immediate as a cloud passes over the sun or delayed as the roof and roof structure cool down at night.\nNot all materials in a roof structure absorb the same amount of heat, and not all materials have the same amount\nof thermally-induced movement. Differential movement may emanate from many places, including the layer of\nroofing exposed to the sun against layers underneath (i.e. a flashing or lap), the roof profile against the fastener,\nor the roof against the support structure. It can also happen when expansion of the roof causes one member of\nthe support structure directly to move against another. Movement may also occur as sudden popping in the pan\nof a profile that releases static friction and causes sound.\nThe source of thermal roof noise can be difficult to identify in many cases. However, roof noise can be divided\ninto three main categories by source. They are:\nFlashings,\npopping of pan, and\nother causes of thermal noise.\nFlashings\nWhere flashings are solid fixed to a vertical surface and to the cladding, differential movement between them and\nthe roof may cause noise. Using clip-fastened systems allowing flashings and roofing to move independently to\neach other will help minimise noise associated with this movement.\nPan Popping\nOil canning, or canning, is the term used to describe visible waviness of the pan of a metal roof. It is most\nnoticeable in roofs with wide trays but may also occur in secret fixed or trapezoidal profiles.\nPan popping is accompanied by canning, but not all canning jobs result in thermal roof noise. Canning is most\nprevalent in tray profiles, but popping roof noise is most often found with trapezoidal or secret fixed roofs.\nCanning can be minimised by good rollformer tooling design and adjustment, but it can also be exacerbated by\nvariations in mechanical properties and shape of the coil.\nEven steel coil well within standard tolerances can have characteristics that lead to high levels of canning in",
              "pdfPages": [
                353
              ]
            },
            {
              "number": "12.1.3",
              "title": "Thermal Noise",
              "level": 3,
              "content": "12.1.2 \nPrecipitation Noise \nMost people find the sound of rain on the roof comforting, however, it may be intrusive.\nThe best way to attenuate precipitation noise is to increase the insulation levels in the ceiling space\nChip-coated metal tiles are likely to produce less precipitation noise than roll formed cladding. Fleece lined\ncladding has also been found to reduce precipitation noise.\n12.1.3 \nThermal Noise \nNearly all profiled metal roofs will exhibit thermal roof noise at times. Typically, this is a relatively minor and\nuncommon event, and attracts no attention. Sometimes, however, the frequency and/or volume of the noise can\nbe to the point where it causes discomfort and distress to the occupants.\nThermal roof noise is caused by the roof expanding or contracting due to temperature fluctuation. The effect can\nbe immediate as a cloud passes over the sun or delayed as the roof and roof structure cool down at night.\nNot all materials in a roof structure absorb the same amount of heat, and not all materials have the same amount\nof thermally-induced movement. Differential movement may emanate from many places, including the layer of\nroofing exposed to the sun against layers underneath (i.e. a flashing or lap), the roof profile against the fastener,\nor the roof against the support structure. It can also happen when expansion of the roof causes one member of\nthe support structure directly to move against another. Movement may also occur as sudden popping in the pan\nof a profile that releases static friction and causes sound.\nThe source of thermal roof noise can be difficult to identify in many cases. However, roof noise can be divided\ninto three main categories by source. They are:\nFlashings,\npopping of pan, and\nother causes of thermal noise.\nFlashings\nWhere flashings are solid fixed to a vertical surface and to the cladding, differential movement between them and\nthe roof may cause noise. Using clip-fastened systems allowing flashings and roofing to move independently to\neach other will help minimise noise associated with this movement.\nPan Popping\nOil canning, or canning, is the term used to describe visible waviness of the pan of a metal roof. It is most\nnoticeable in roofs with wide trays but may also occur in secret fixed or trapezoidal profiles.\nPan popping is accompanied by canning, but not all canning jobs result in thermal roof noise. Canning is most\nprevalent in tray profiles, but popping roof noise is most often found with trapezoidal or secret fixed roofs.\nCanning can be minimised by good rollformer tooling design and adjustment, but it can also be exacerbated by\nvariations in mechanical properties and shape of the coil.\nEven steel coil well within standard tolerances can have characteristics that lead to high levels of canning in",
              "pdfPages": [
                353
              ]
            },
            {
              "number": "12.1.3A",
              "title": "Poor Purlin-to-Rafter Connection",
              "level": 3,
              "content": "some profiles and tooling set-ups.\nCanning can also be induced by the building structure; a concave curve in the support structure will put the pan\nof the profile into compression and lead to canning.\nTo avoid canning problems, both the structure and the sheets should be inspected for straightness before\ninstallation.\nOther Causes of Thermal Noise\nRoof expansion noise can be caused by the energy released when the roof expands or shrinks relative to its\nsupport, and sliding occurs at the fasteners, clips, purlins, or within the structure itself. The exact source of most\nroof noise is hard to identify.\nA common observation of noisy roofs is poor contact between the purlin and the rafter due to insufficient\npressure being put on the purlin when installing purlin screws, allowing the purlin to ride up on the thread. It may\ncreate a source of noise as purlins rotate under thermal expansion forces. Purlin screws should have a length of\nunthreaded shank below the head of at least the purlin thickness.\nIt is impossible to prevent expansion, but its effects can be minimised.\n\nThermal variation can be inhibited by using lighter colours or ventilating the roof space. Lowering roof\ntemperatures minimises thermal noise. Increasing ventilation in the ceiling cavity is the easiest way to lower roof\ntemperatures and may have the added benefit of lowering roof space humidity.\nThe accumulation of stress can be minimised by avoiding excessive run lengths. Friction can be reduced by using\nlow-friction underlay and using oversized fastener holes to allow materials to move freely. Fasteners should be\nchecked for over-tightening and eased if necessary.\nMany roof noise problems are typically associated with long, low, dark skillion roofs, but some noisy roofs have\nnone of those design features. To date, the MRM have not recorded any instances of thermal roof noise with\nroofs fastened to steel purlins or frames.\nThermal roof noise is a modern problem. Although often attributed to the roof material, steel and the profiles we\nform it into have not changed. In one case, a noisy trapezoidal roof was replaced with a corrugated roof\nmanufactured from imported material, and the noise problem remained.\nChanges that have occurred in the industry include:\nroofs are screwed on rather than nailed,\nroofs are longer and darker,\npurlins are screw fastened not nailed,\nhouses are more airtight and far better insulated,\ntrusses have largely replaced rafters, and\nframing timber is lighter and younger.\nIt is possible that a number of these aspects contribute in complex ways to produce varying thermal expansion\nnoise levels, but we certainly don't want to go back to nailed roofs and uninsulated houses.\nThe exact source of much roof noise is still a mystery. Auckland University is currently researching a scientific\napproach to identifying causes and solutions to roof noise.",
              "pdfPages": [
                354,
                355
              ],
              "images": [
                {
                  "filename": "section-detail-660.png",
                  "url": "https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/section-detail-660.png",
                  "caption": "",
                  "dimensions": {
                    "width": 656,
                    "height": 492
                  }
                }
              ]
            }
          ]
        },
        {
          "number": "12.2",
          "title": "Purlin Creasing",
          "level": 2,
          "content": "Due to improvements in colour coating technology, the level of reflection and retention of gloss is higher. It will\nbecome much less obvious over time as gloss levels diminish and dirt accumulates on the roof.\nOverdriven nails or screws can produce visible distortion on the purlin line in the pan of trapezoidal profiles that\ncannot be easily remedied.\n12.2A Purlin Creasing on Trapezoidal Profiles\nTrapezoidal profiles with a wide pan manufactured from 0.4 mm steel and 0.7 mm aluminium are\nparticularly susceptible to purlin creasing, and although it does not affect performance, their\nappearance can be aesthetically unacceptable\nIt is the responsibility of the roofing contractor to ensure that nails are not overdriven. A nail or screw should only\nbe driven into the purlin to produce a 50% compression of the sealing washer or until the roof is firm.\nBefore fixing the roof cladding, the contractor should check the alignment of the purlins or girts. Purlins should be\naligned within 5 mm tolerance of each other to avoid purlin creasing.\nPurlins should be accurately positioned with their top face parallel to the rafter and should be fixed to a straight\nline.\nWhen appearance is important or where wide pan trapezoidal cladding is close to eye level, heavier gauge\ncladding should be specified because light gauges such as 0.4 mm steel and 0.7 mm aluminium are likely to\nshow distortion. Purlin creasing will happen on both concave and convex curved roofs if the recommended purlin\nspacings are exceeded, and great care should be taken to align purlins on such roofs.\nPurlin creasing can be exacerbated by roof traffic. 14.5 Walking On Roofs\nAll trapezoidal and secret x proles will exhibit purlin creasing to some degree. The extent to which it is visible\ndepends greatly on the line of sight and light conditions. These can change it from being immediately obvious to\nalmost invisible. Purlin creasing can be minimised by design by specifying 0.55 mm, rather than 0.40 mm\nmaterial, or selecting a prole with a narrower pan. Minimising roof trac on G300 tray roong will also help, but\n\nthe only way to ensure that purlin creasing will not be an issue is to lay a roof on solid sarking, or by using a\ncorrugate prole.\nA printable bulletin is available at: PC01 Purlin Creasing or Print-Through\nExctract:\n\"Purlin creasing is similar to canning, except that the distortion in the pan occurs along the purlin lines\nrather than in a random pattern. It can also be referred to as print-through. The cause is often hard to\ndiagnose...\"",
          "pdfPages": [
            356,
            357
          ],
          "subsections": [
            {
              "number": "12.2A",
              "title": "Purlin Creasing on Trapezoidal Profiles",
              "level": 3,
              "content": "12.2 \nPurlin Creasing \nDue to improvements in colour coating technology, the level of reflection and retention of gloss is higher. It will\nbecome much less obvious over time as gloss levels diminish and dirt accumulates on the roof.\nOverdriven nails or screws can produce visible distortion on the purlin line in the pan of trapezoidal profiles that\ncannot be easily remedied.\nTrapezoidal profiles with a wide pan manufactured from 0.4 mm steel and 0.7 mm aluminium are\nparticularly susceptible to purlin creasing, and although it does not affect performance, their\nappearance can be aesthetically unacceptable\nIt is the responsibility of the roofing contractor to ensure that nails are not overdriven. A nail or screw should only\nbe driven into the purlin to produce a 50% compression of the sealing washer or until the roof is firm.\nBefore fixing the roof cladding, the contractor should check the alignment of the purlins or girts. Purlins should be\naligned within 5 mm tolerance of each other to avoid purlin creasing.\nPurlins should be accurately positioned with their top face parallel to the rafter and should be fixed to a straight\nline.\nWhen appearance is important or where wide pan trapezoidal cladding is close to eye level, heavier gauge\ncladding should be specified because light gauges such as 0.4 mm steel and 0.7 mm aluminium are likely to\nshow distortion. Purlin creasing will happen on both concave and convex curved roofs if the recommended purlin\nspacings are exceeded, and great care should be taken to align purlins on such roofs.\nPurlin creasing can be exacerbated by roof traffic. 14.5 Walking On Roofs\nAll trapezoidal and secret x proles will exhibit purlin creasing to some degree. The extent to which it is visible\ndepends greatly on the line of sight and light conditions. These can change it from being immediately obvious to\nalmost invisible. Purlin creasing can be minimised by design by specifying 0.55 mm, rather than 0.40 mm\nmaterial, or selecting a prole with a narrower pan. Minimising roof trac on G300 tray roong will also help, but",
              "pdfPages": [
                356
              ],
              "images": [
                {
                  "filename": "section-detail-664.png",
                  "url": "https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/section-detail-664.png",
                  "caption": "",
                  "dimensions": {
                    "width": 296,
                    "height": 197
                  }
                }
              ]
            }
          ]
        },
        {
          "number": "12.3",
          "title": "Flashing Buckling",
          "level": 2,
          "content": "As a rule, to minimise buckling, any dimension of a flashing should be a maximum of 300 mm between folds.\nEven so, transverse flashings such as ridges and aprons can exhibit some waviness due to the combined effects\nof thermal movement and timber shrinkage. \nThe only way to eliminate this is to fasten ridges on a hot day to dry timber. As this is seldom practical, light,\nevenly spaced waviness in a ridge or transverse flashing is not considered a defect.\nBeing highly visible, waviness in barges and external corner flashings can be more problematic. In a situation\nwhere there is a low tolerance for waviness, flashings should be designed to keep the width of flat surfaces\nminimal and to be clip fastened on both edges to accommodate movement. Where possible, manufacturing from\na heavier gauge material will also help minimise buckling.\nSevere localised irreversible buckling of a flashing caused by compression wood is the result of a defect of the\nstructure and should be rectified. See 8.9 Compression Timber.\n12.3A Flashing Buckling",
          "pdfPages": [
            358
          ],
          "subsections": [
            {
              "number": "12.3A",
              "title": "Flashing Buckling",
              "level": 3,
              "content": "12.3 \nFlashing Buckling \nAs a rule, to minimise buckling, any dimension of a flashing should be a maximum of 300 mm between folds.\nEven so, transverse flashings such as ridges and aprons can exhibit some waviness due to the combined effects\nof thermal movement and timber shrinkage. \nThe only way to eliminate this is to fasten ridges on a hot day to dry timber. As this is seldom practical, light,\nevenly spaced waviness in a ridge or transverse flashing is not considered a defect.\nBeing highly visible, waviness in barges and external corner flashings can be more problematic. In a situation\nwhere there is a low tolerance for waviness, flashings should be designed to keep the width of flat surfaces\nminimal and to be clip fastened on both edges to accommodate movement. Where possible, manufacturing from\na heavier gauge material will also help minimise buckling.\nSevere localised irreversible buckling of a flashing caused by compression wood is the result of a defect of the\nstructure and should be rectified. See 8.9 Compression Timber.",
              "pdfPages": [
                358
              ],
              "images": [
                {
                  "filename": "section-detail-667.png",
                  "url": "https://pub-5f4c0432c70b4389a92d23c5a0047e17.r2.dev/images/mrm/section-detail-667.png",
                  "caption": "",
                  "dimensions": {
                    "width": 508,
                    "height": 381
                  }
                }
              ]
            }
          ]
        },
        {
          "number": "12.4",
          "title": "Oil Canning",
          "level": 2,
          "content": "Distortion of flat metal areas is an aesthetic problem associated with the manufacture of metal roof and wall\ncladding and flashings. Flat pan architectural metal panels, wide flashings, and profiled metal cladding with wide\npan configurations without stiffening ribs are all liable to show distortion in flat metal areas. It is known as oil-\ncanning or panning.\nOil canning can be defined as visible waviness in the flat areas of metal roofing and wall cladding. It can also be\nreferred to as panning, canning, stress wrinkling or elastic buckling, and is caused by differential stresses in the\nmetal. As the metal tries to relieve these stresses in panels with high width to thickness ratios, material buckles\nout of plane producing the characteristic waviness of oil canning\nIt has an aesthetic effect and is not a structural or durability issue. Some highly reflective paint finishes and\nmetals or different light conditions can exacerbate the visual effect of oil canning. Some distortion is inevitable in\nlight gauges. It can become an issue of customer acceptance because customer expectations are often\nunrealistically high.\nThe degree of waviness can be hard to measure and is highly dependent on viewing angles, the position of the\nsun, and the reflectivity of the surface. Cladding installations with a high degree of visibility should be designed to\nminimise oil canning.\nOil canning is more common where the width of unformed sections is large. It can usually be avoided or\nminimised in normal rib and trough section profiles with a maximum pan width of 300 mm, and flashings that\nhave a maximum unformed width of 300 mm. See 8.1 Flashing Materials\nIn standing seam roofs with pan widths of more than 300 mm, some oil canning is normally evident. Many\ndesigners regard oil canning in such profiles as inherent to the material and treat it as a desired effect\naccentuating the material's natural characteristics.\nManufacturers and installers should minimise unintentional non-flat conditions, and any visual waviness should\nbe relatively even and regular.\nThere are various causes for oil canning:\nmaterial;\nroll tool design and setting;\ninstallation; and\nexpansion allowance.\n12.4.1 \nMaterial \nAll profiled metal roof and wall products begin in a coil form. Stresses induced during coil production can\ncontribute to oil canning. Examples of these stresses are:\nFull Centre: The coil is longer in the centre of the strip than near the edges. This creates buckles and ripples in\nthe mid-coil area.\n\nWavy Edge: The coil is longer on one edge of the strip. That causes waviness on the long edge.\nCamber: The side edge of the coil deviates from a straight line. The normal tolerance for a 1200 mm wide coil\nis a 2 mm deviation in a 2 m length, but some forming processes and end uses cannot tolerate that variation.\nUneven Material Strength: During the forming process material may tend to draw unevenly from the softer\nareas rather than evenly as designed; it leaves excessive material in the \"harder\" areas.\nSlitting: Generally, coil for flashings and narrower products are cut by slitting from a single, wider master coil.\nSlitting of a master coil can release and redistribute residual forces. It can also mean that different qualities of\nthe master coil are modified or changed in the slit coil, i.e., a full centre in a master coil can become a wavy\nedge in a slit coil and the slit coil may not retain all the attributes of the master coil or sister coils.\n12.4.2 \nTool Design \nBy the nature of the process, many stresses are created during roll forming. These must be minimised and\nequalised as much as possible during manufacturing. Forming tools must be designed to form the material\nprogressively.\nCorrugated and ribbed profiles are most often formed from the centre and moved outward thereby \"pushing\" the\ndifferential stresses to the edges of the sheet. Generally, profiled metal rib and corrugated profiles, flashings, and\nmost trough sections can be expected to provide finishes free of avoidable distortion.\nStanding seam profiles typically need more forming on the edges of the feed material and little or none in the\ncentre of the sheet, which tends to trap uneven stresses in the centre of the profile. Often one edge requires more\nforming than the other, meaning the stresses developed are not even in the sheet.\nSome evenly distributed oil canning can normally be expected in standing seam products with a width of more\nthan 300 mm, and it is considered acceptable.\n12.4.3 \nInstallation \nOil canning can occur in fixed cladding, even though it does not fit accurately, when fixings are too\nfar apart or when fixings are overdriven. It can also result from an uneven substrate, irregular\nbearing on the purlins or the structural framing being out of line.\nThermal expansion can also increase oil canning. Longitudinal expansion should be accommodated by using\nsliding clips that allow movement. See E Expansion Clips. Transverse expansion is usually accommodated in\nthe upstand of the profile, but this can only happen if adjacent pans are not in contact at the base. Wide perimeter\nflashings must be designed to allow for the independent movement of the flashing and the cladding.\nA convex curve in the roof structure can cause canning as it puts the pan of the profile under compression.\nSometimes this curve is inadvertent. Concave roof cladding and flashings give rise to oil-canning because the\npans are in compression. There are limitations on curved radii to avoid oil canning. See 15.1 Curved Roofs.\nCommercially designed truss sections and rafters may have camber induced in their manufacture, anticipating\ndeflection under load. The degree of curve that may be accommodated by any profile is largely determined by the\nwidth of the pan and is also affected by the material thickness and grade.\nMinimising Oil Canning \nGood design and installation can minimise oil canning.\nMaterials:\nUse thicker material.\nUse low gloss paints or embossed surfaces.\nUse natural weathering materials that dull over time.\nFlashings:\nLimit flashing width to 300 mm.\nLimit the joined length of fixed flashings to 12 m.\nAttach wide flashings with brackets that allow independent thermal expansion.\nManufacture a stiffening swage into flashings that have a face width greater than 200 mm.\nDo not fix flashings to timber with a moisture content greater than 18%.\nCladding:\nLimit cladding length.\nEnsure the purlin alignment avoids convex curving.\nInspect for flatness before installation.\nAvoid thin materials.",
          "pdfPages": [
            359,
            360,
            361
          ],
          "subsections": [
            {
              "number": "12.4.1",
              "title": "Material",
              "level": 3,
              "content": "12.4 \nOil Canning \nDistortion of flat metal areas is an aesthetic problem associated with the manufacture of metal roof and wall\ncladding and flashings. Flat pan architectural metal panels, wide flashings, and profiled metal cladding with wide\npan configurations without stiffening ribs are all liable to show distortion in flat metal areas. It is known as oil-\ncanning or panning.\nOil canning can be defined as visible waviness in the flat areas of metal roofing and wall cladding. It can also be\nreferred to as panning, canning, stress wrinkling or elastic buckling, and is caused by differential stresses in the\nmetal. As the metal tries to relieve these stresses in panels with high width to thickness ratios, material buckles\nout of plane producing the characteristic waviness of oil canning\nIt has an aesthetic effect and is not a structural or durability issue. Some highly reflective paint finishes and\nmetals or different light conditions can exacerbate the visual effect of oil canning. Some distortion is inevitable in\nlight gauges. It can become an issue of customer acceptance because customer expectations are often\nunrealistically high.\nThe degree of waviness can be hard to measure and is highly dependent on viewing angles, the position of the\nsun, and the reflectivity of the surface. Cladding installations with a high degree of visibility should be designed to\nminimise oil canning.\nOil canning is more common where the width of unformed sections is large. It can usually be avoided or\nminimised in normal rib and trough section profiles with a maximum pan width of 300 mm, and flashings that\nhave a maximum unformed width of 300 mm. See 8.1 Flashing Materials\nIn standing seam roofs with pan widths of more than 300 mm, some oil canning is normally evident. Many\ndesigners regard oil canning in such profiles as inherent to the material and treat it as a desired effect\naccentuating the material's natural characteristics.\nManufacturers and installers should minimise unintentional non-flat conditions, and any visual waviness should\nbe relatively even and regular.\nThere are various causes for oil canning:\nmaterial;\nroll tool design and setting;\ninstallation; and\nexpansion allowance.\n12.4.1 \nMaterial \nAll profiled metal roof and wall products begin in a coil form. Stresses induced during coil production can\ncontribute to oil canning. Examples of these stresses are:\nFull Centre: The coil is longer in the centre of the strip than near the edges. This creates buckles and ripples in\nthe mid-coil area.",
              "pdfPages": [
                359
              ]
            },
            {
              "number": "12.4.2",
              "title": "Tool Design",
              "level": 3,
              "content": "Wavy Edge: The coil is longer on one edge of the strip. That causes waviness on the long edge.\nCamber: The side edge of the coil deviates from a straight line. The normal tolerance for a 1200 mm wide coil\nis a 2 mm deviation in a 2 m length, but some forming processes and end uses cannot tolerate that variation.\nUneven Material Strength: During the forming process material may tend to draw unevenly from the softer\nareas rather than evenly as designed; it leaves excessive material in the \"harder\" areas.\nSlitting: Generally, coil for flashings and narrower products are cut by slitting from a single, wider master coil.\nSlitting of a master coil can release and redistribute residual forces. It can also mean that different qualities of\nthe master coil are modified or changed in the slit coil, i.e., a full centre in a master coil can become a wavy\nedge in a slit coil and the slit coil may not retain all the attributes of the master coil or sister coils.\n12.4.2 \nTool Design \nBy the nature of the process, many stresses are created during roll forming. These must be minimised and\nequalised as much as possible during manufacturing. Forming tools must be designed to form the material\nprogressively.\nCorrugated and ribbed profiles are most often formed from the centre and moved outward thereby \"pushing\" the\ndifferential stresses to the edges of the sheet. Generally, profiled metal rib and corrugated profiles, flashings, and\nmost trough sections can be expected to provide finishes free of avoidable distortion.\nStanding seam profiles typically need more forming on the edges of the feed material and little or none in the\ncentre of the sheet, which tends to trap uneven stresses in the centre of the profile. Often one edge requires more\nforming than the other, meaning the stresses developed are not even in the sheet.\nSome evenly distributed oil canning can normally be expected in standing seam products with a width of more\nthan 300 mm, and it is considered acceptable.\n12.4.3 \nInstallation \nOil canning can occur in fixed cladding, even though it does not fit accurately, when fixings are too\nfar apart or when fixings are overdriven. It can also result from an uneven substrate, irregular\nbearing on the purlins or the structural framing being out of line.\nThermal expansion can also increase oil canning. Longitudinal expansion should be accommodated by using\nsliding clips that allow movement. See E Expansion Clips. Transverse expansion is usually accommodated in\nthe upstand of the profile, but this can only happen if adjacent pans are not in contact at the base. Wide perimeter\nflashings must be designed to allow for the independent movement of the flashing and the cladding.\nA convex curve in the roof structure can cause canning as it puts the pan of the profile under compression.\nSometimes this curve is inadvertent. Concave roof cladding and flashings give rise to oil-canning because the\npans are in compression. There are limitations on curved radii to avoid oil canning. See 15.1 Curved Roofs.\nCommercially designed truss sections and rafters may have camber induced in their manufacture, anticipating\ndeflection under load. The degree of curve that may be accommodated by any profile is largely determined by the\nwidth of the pan and is also affected by the material thickness and grade.",
              "pdfPages": [
                360
              ]
            },
            {
              "number": "12.4.3",
              "title": "Installation",
              "level": 3,
              "content": "Wavy Edge: The coil is longer on one edge of the strip. That causes waviness on the long edge.\nCamber: The side edge of the coil deviates from a straight line. The normal tolerance for a 1200 mm wide coil\nis a 2 mm deviation in a 2 m length, but some forming processes and end uses cannot tolerate that variation.\nUneven Material Strength: During the forming process material may tend to draw unevenly from the softer\nareas rather than evenly as designed; it leaves excessive material in the \"harder\" areas.\nSlitting: Generally, coil for flashings and narrower products are cut by slitting from a single, wider master coil.\nSlitting of a master coil can release and redistribute residual forces. It can also mean that different qualities of\nthe master coil are modified or changed in the slit coil, i.e., a full centre in a master coil can become a wavy\nedge in a slit coil and the slit coil may not retain all the attributes of the master coil or sister coils.\n12.4.2 \nTool Design \nBy the nature of the process, many stresses are created during roll forming. These must be minimised and\nequalised as much as possible during manufacturing. Forming tools must be designed to form the material\nprogressively.\nCorrugated and ribbed profiles are most often formed from the centre and moved outward thereby \"pushing\" the\ndifferential stresses to the edges of the sheet. Generally, profiled metal rib and corrugated profiles, flashings, and\nmost trough sections can be expected to provide finishes free of avoidable distortion.\nStanding seam profiles typically need more forming on the edges of the feed material and little or none in the\ncentre of the sheet, which tends to trap uneven stresses in the centre of the profile. Often one edge requires more\nforming than the other, meaning the stresses developed are not even in the sheet.\nSome evenly distributed oil canning can normally be expected in standing seam products with a width of more\nthan 300 mm, and it is considered acceptable.\n12.4.3 \nInstallation \nOil canning can occur in fixed cladding, even though it does not fit accurately, when fixings are too\nfar apart or when fixings are overdriven. It can also result from an uneven substrate, irregular\nbearing on the purlins or the structural framing being out of line.\nThermal expansion can also increase oil canning. Longitudinal expansion should be accommodated by using\nsliding clips that allow movement. See E Expansion Clips. Transverse expansion is usually accommodated in\nthe upstand of the profile, but this can only happen if adjacent pans are not in contact at the base. Wide perimeter\nflashings must be designed to allow for the independent movement of the flashing and the cladding.\nA convex curve in the roof structure can cause canning as it puts the pan of the profile under compression.\nSometimes this curve is inadvertent. Concave roof cladding and flashings give rise to oil-canning because the\npans are in compression. There are limitations on curved radii to avoid oil canning. See 15.1 Curved Roofs.\nCommercially designed truss sections and rafters may have camber induced in their manufacture, anticipating\ndeflection under load. The degree of curve that may be accommodated by any profile is largely determined by the\nwidth of the pan and is also affected by the material thickness and grade.",
              "pdfPages": [
                360
              ]
            },
            {
              "number": "12.4.4",
              "title": "Minimising Oil Canning",
              "level": 3,
              "content": "Good design and installation can minimise oil canning.\nMaterials:\nUse thicker material.\nUse low gloss paints or embossed surfaces.\nUse natural weathering materials that dull over time.\nFlashings:\nLimit flashing width to 300 mm.\nLimit the joined length of fixed flashings to 12 m.\nAttach wide flashings with brackets that allow independent thermal expansion.\nManufacture a stiffening swage into flashings that have a face width greater than 200 mm.\nDo not fix flashings to timber with a moisture content greater than 18%.\nCladding:\nLimit cladding length.\nEnsure the purlin alignment avoids convex curving.\nInspect for flatness before installation.\nAvoid thin materials.",
              "pdfPages": [
                361
              ]
            }
          ]
        },
        {
          "number": "12.5",
          "title": "Colour Differential",
          "level": 2,
          "content": "It is both the cladding manufacturer and the roof cladding contractor's responsibility to ensure\nthat the same brands of pre-painted material are used on the same building.\nFailure to do so could result in differences in colour, gloss and weathering, which quickly becomes\nobvious.\nThe differences come from different paint formulations and do not necessarily indicate that the\nmaterials will perform differently in service. All New Zealand manufacturers provide information\nabout the manufacturer, the type of coating and the manufacturing date in the branding on the\nreverse side of uncoated and colour coated steel. Double-sided coatings are not branded.\n12.5.1 \nTouch-Up \nAir-drying touch-up paints have different weathering characteristics from the baked-on finish of\npre-painted coating systems, and variations in natural light conditions will emphasise these\ndifferences, producing an unacceptable aesthetic appearance.\nSpray cans should not be used for repairing scratches on pre-painted sheeting.\nIf the scratch is obvious from 3 m, the sheeting should be replaced; if not, then it should be left alone. Minor\nsurface scratches become less noticeable as the coating weathers and are best left as they do not appreciably\naffect the corrosion-inhibiting properties of the material.\nWidespread damage caused by rough handling or an accident, however, should not be corrected by repainting;\ninstead, the affected material should be replaced.",
          "pdfPages": [
            362
          ],
          "subsections": [
            {
              "number": "12.5.1",
              "title": "Touch-Up",
              "level": 3,
              "content": "12.5 \nColour Differential \nIt is both the cladding manufacturer and the roof cladding contractor's responsibility to ensure\nthat the same brands of pre-painted material are used on the same building.\nFailure to do so could result in differences in colour, gloss and weathering, which quickly becomes\nobvious.\nThe differences come from different paint formulations and do not necessarily indicate that the\nmaterials will perform differently in service. All New Zealand manufacturers provide information\nabout the manufacturer, the type of coating and the manufacturing date in the branding on the\nreverse side of uncoated and colour coated steel. Double-sided coatings are not branded.\n12.5.1 \nTouch-Up \nAir-drying touch-up paints have different weathering characteristics from the baked-on finish of\npre-painted coating systems, and variations in natural light conditions will emphasise these\ndifferences, producing an unacceptable aesthetic appearance.\nSpray cans should not be used for repairing scratches on pre-painted sheeting.\nIf the scratch is obvious from 3 m, the sheeting should be replaced; if not, then it should be left alone. Minor\nsurface scratches become less noticeable as the coating weathers and are best left as they do not appreciably\naffect the corrosion-inhibiting properties of the material.\nWidespread damage caused by rough handling or an accident, however, should not be corrected by repainting;\ninstead, the affected material should be replaced.",
              "pdfPages": [
                362
              ]
            }
          ]
        },
        {
          "number": "12.6",
          "title": "Transport, Handling And Storage of rooflights",
          "level": 2,
          "content": "All roof lights should be handled and stacked with care as film surfaces are easily scratched, and\nheavy stacks can damage lower sheets.\nAll roof lights should be stored flat, the right way up, on 75 mm battens not more than 1.2 m apart.\nStacks should not be higher than 1 m and should be covered and protected from rain and sun.\nThermoplastic sheets can overheat and deform in a stack, and exposed stacks can permanently\ndiscolour due to the effect of sun and water.\n12.6.1 \nMaintenance \nFirst maintenance after 12 months requires cleaning any grime or debris using warm water and a\nstiff bristled brush. Every 2 - 3 years rooflights should be inspected for damage, the condition of the\nflashings, and sealants and the fixings should be checked for tightness.\nRoof lights must not be painted over as this renders them hazardous to maintenance workers.\nBecause painted roof lights appear no different in place than metal sheets, this practice can be dangerous for any\nworkers carrying out maintenance work on the roof. Painting can also cause heat distortion which can lead to\npremature failure.\nAs a warning, primary and secondary fasteners can be brightly coloured, providing a contrast with the remainder\nof the roof cladding surrounding the roof light areas. The area can also be marked around with a distinctly painted\nstripe.\nLichen will accumulate on plastic roof lighting wherever there is a source of nutrients, but it should be removed\nwith care. See 16.7.1 Lichen And Mould.",
          "pdfPages": [
            363
          ],
          "subsections": [
            {
              "number": "12.6.1",
              "title": "Maintenance",
              "level": 3,
              "content": "12.6 \nTransport, Handling And Storage of rooflights \nAll roof lights should be handled and stacked with care as film surfaces are easily scratched, and\nheavy stacks can damage lower sheets.\nAll roof lights should be stored flat, the right way up, on 75 mm battens not more than 1.2 m apart.\nStacks should not be higher than 1 m and should be covered and protected from rain and sun.\nThermoplastic sheets can overheat and deform in a stack, and exposed stacks can permanently\ndiscolour due to the effect of sun and water.\n12.6.1 \nMaintenance \nFirst maintenance after 12 months requires cleaning any grime or debris using warm water and a\nstiff bristled brush. Every 2 - 3 years rooflights should be inspected for damage, the condition of the\nflashings, and sealants and the fixings should be checked for tightness.\nRoof lights must not be painted over as this renders them hazardous to maintenance workers.\nBecause painted roof lights appear no different in place than metal sheets, this practice can be dangerous for any\nworkers carrying out maintenance work on the roof. Painting can also cause heat distortion which can lead to\npremature failure.\nAs a warning, primary and secondary fasteners can be brightly coloured, providing a contrast with the remainder\nof the roof cladding surrounding the roof light areas. The area can also be marked around with a distinctly painted\nstripe.\nLichen will accumulate on plastic roof lighting wherever there is a source of nutrients, but it should be removed\nwith care. See 16.7.1 Lichen And Mould.",
              "pdfPages": [
                363
              ]
            }
          ]
        },
        {
          "number": "12.7",
          "title": "Drinking Water",
          "level": 2,
          "content": "Rainwater collected from roofs clad with steel and prepainted steel products will comply with the\nprovisions of NZBC G 1 2.3.1, provided the water is not contaminated from other sources.\nThe first 25 mm of rainfall from a newly installed roof should be discarded before drinking water\ncollection starts, and always disconnect downpipes when painting a roof. Spouting should be\nregularly cleaned to avoid the build-up of dirt and debris that can affect water quality.\nWhere a paint or paint system is applied to the roof, its suitability for the collection of drinking\nwater should be established. When rainwater from pre-painted roof cladding is used for drinking,\nit is advisable to repaint the roof as soon as its surface has weathered.\nWater collected from metal roof cladding, spouting or gutters made from aluminium, copper and\nstainless steel will not normally be contaminated by rainfall in suburban and rural areas. However,\nfallout from manufacturing plants, top dressing, and the contamination resulting from roof\ncleaning can affect the water quality, and in these cases downpipes should be disconnected.",
          "pdfPages": [
            364
          ]
        }
      ]
    }
  ]
}