{"chapterNumber":1,"title":"Introduction","version":"v25.12","sectionCount":10,"sections":[{"number":"1","title":"Introduction","level":1,"content":"The NZ Metal Roof and Wall Cladding Code of Practice (COP) is published by NZ Metal Roofing Manufacturers\nInc. (MRM), to provide:\nacceptable trade practice for fixing metal roofing, metal wall cladding, and accessories,\nprescriptive detailing for designers, and\nsets a benchmark for the standard of detailing and workmanship required over and above that required to\ncomply with the NZBC.\nThe COP does not describe or dismiss alternative methods, which may need specific acceptance by the Building\nConsent Authorities.\nIt is published in accordance with current technology, materials, and building codes. The COP will be periodically\nupdated to reflect changes in legislation and standards or improvements in technology and available materials.\nThe most current Code of Practice is available on the MRM website, www.metalroofing.org.nz/cop, as Code\nof Practice Online (MRM COP Version 25.12).\nIn the latest update (on 1 December 2025), we made few substantial changes to recommendations. Most of the\nrevision consisted of editing and rearrangement for clarity, consistency, and accuracy. We have also linked all\npublished Bulletins to the relevant content in the CoP.\nImportant changes\n8.4.2 Clearances and Minimum Slope for Flashing Cover was substantially revised and renamed.\nWe updated our recommendations on the limitations for 9.4.1.1 Overflashed (Watershed)\nBackflashings and added clearer guidance on their construction, supported by a new illustration.\nA new illustration was added to 8.5.4.2 Change Of Pitch to clarify recommendations for minimising rust\non change-of-pitch junctions.\nEditing and rearrangement\n15.1.1A Spring Curving Calculator has been updated and can now work from either height or desired\nradius to enable profile selection and calculate the total length of seal required.\nWe made some edits for clarity and added a reference to wall cladding to 17.1.3.2 Point Load Testing.\nIn 4.6.3 Material Selection, we changed materials endorsed as complying with AS/NZS 2728 coating\ntypes to align with the current product range.\n\nBulletins\nPublished bulletins are now linked to relevant content in the Code of Practice.\nSix new bulletins are now available from Bulletins on the MRM Home page:\nBI01 The Importance of Maintenance of Metal Roofing and Walling\nBEMF01 Change of Pitch Flashings\nBU02 Over-Saturation of Underlay\nBPD01 Wide Over-Flashings Behind Penetrations\nBWLS01 End Spans of Roofing Sheets\nFor a detailed list of updates, please visit 19.1 v25.12 December 2025 in the Code of Practice.\nImportant Notice:\nIn a move to help us better understand our audience and make the NZMRM Metal and Wall Roof Cladding\nCode of Practice even more useful and relevant, we are introducing an industry selector to the existing\nregistration form. If your particular industry is not listed please select one that is closest.\nRegistration is important so everybody will be informed of important revisions which is done on a quarterly\nschedule. You will only receive four emails per year regarding our updates.\nThe data gathered stays anonymous and will never be shared with anyone outside the NZMRM.\nDisclaimer and Copyright\nAlthough the information contained in this Code has been obtained from sources believed to be reliable, New\nZealand Metal Roofing Manufacturers Inc. makes no warranties or representations of any kind (express or\nimplied) regarding the accuracy, adequacy, currency or completeness of the information, or that it is suitable for\nthe intended use.\nCompliance with this Code does not guarantee immunity from breach of any statutory requirements, the New\nZealand Building Code or relevant Standards. The final responsibility for the correct design and specification\nrests with the designer and for its satisfactory execution with the contractor.\nWhile most data have been compiled from case histories, trade experience and testing, small changes in the\nenvironment can produce marked differences in performance. The decision to use a particular material, and in\nwhat manner, is made at your own risk. The use of a particular material and method may, therefore, need to be\nmodified to its intended end use and environment.\nNew Zealand Metal Roofing Manufacturers Inc., its directors, officers or employees shall not be responsible for\nany direct, indirect or special loss or damage arising from, as a consequence of, use of or reliance upon any\ninformation contained in this Code.\nNew Zealand Metal Roofing Manufacturers Inc. expressly disclaims any liability which is based on or arises out\nof the information or any errors, omissions or misstatements.\nIf reprinted, reproduced or used in any form, the New Zealand Metal Roofing Manufacturers Inc. (NZMRM) should\nbe acknowledged as the source of information.\nBefore using this Code, please refer to the New Zealand Metal Roofing Manufacturers Inc. website\n(www.metalroofing.org.nz) for the most recent updates on information contained in this Code.\n1.1.1\nCode of Practice Update-Policy\nFor continued improvement and to keep up with new developments, New Zealand Metal Roofing Manufacturers\nInc. (NZMRM) publishes quarterly updates to this Code of Practice\nFrom September 2023, the nominal Version number of the Code of Practice follows a \"year.month\" pattern,\nbeginning with v23.09, for clear identification of the date of the latest updated version.\nPlease note:\nAlways use the current online Code of Practice to ensure you have the most recent recommendations.\nHaving registered to access the Code of Practice, you will be notified by email of the most notable changes at\nthe publication of each update.\nA comprehensive history of revisions with a detailed log of changes is available at 19 Revision History.\nArchival copies of previous versions are available if required.\nPlease contact admin@metalroofing.org.nz with details if you have a specific requirement.\nScope\nThis Code of Practice provides requirements, information and guidelines, to the Building Consent Authorities, the\nBuilding Certifier, Specifier, Designer, Licensed Building Practitioner, Trade Trainee, Installer and the end user on\nthe design, installation, performance, and transportation of all metal roof and wall cladding used in New Zealand.\nThe calculations and the details contained in this Code of Practice provide a means of complying with the\nperformance provisions of the NZBC and the requirements of the Health and Safety at Work Act 2015.\nThe scope of this document includes all buildings covered by NZS 3604, AS/NZS 1170 and those designed and\nbuilt under specific engineering design.\nIt has been written and compiled from proven performance and cites a standard of acceptable practice agreed\nbetween manufacturers and roofing contractors.\nThe drawings and requirements contained in this Code illustrate acceptable trade practice, but recommended or\nbetter trade practice is also quoted as being a preferred alternative.\nBecause the environment and wind categories vary throughout New Zealand, acceptable trade practice must be\naltered accordingly; in severe environments and high wind design load categories, the requirements of the NZBC\nwill only be met by using specific detailing as described in this Code.\nThe purpose of this Code of Practice is to present both Acceptable Trade Practice and Recommended Trade\nPractice, in a user-friendly format to ensure that the roof and wall cladding, flashings, drainage accessories, and\nfastenings will:\ncomply with the requirements of B1, B2, E1 E2 and E3 of the NZBC;\ncomply with the design loading requirements of AS/NZS 1170 and NZS 3604 and with AS/NZS 1562;\nhave and optimised lifespan; and\nbe weathertight.\nStandards and Related Documents\n1.3A\nStandardYear\nTitle\nNZ 2295 2017\nPliable, permeable building underlays. (either NZS 2295 2017 or NZS 2295\nAmendment 1 2017)\nNZS 36022003\nTimber and wood based products for use in building.\nNZS 36031993\nAmendment 4 2005 Timber Structures Standard.\nNZS 36042011\nTimber Framed Buildings.\nAS/NZS\n1170.0\n2002\nAmendment 5 2011 Structural design actions. General Principles. Commentary\nto Parts 0, 1 and 2.\nAS/NZS\n1170.1\n2002\nAmendment 2 2009 Structural design actions. Permanent, imposed and other\nactions.\nAS/NZS\n1170.2\n2011\nAmendment 4 2016. Structural design actions. Wind Actions.\nAS/NZS\n1170.3\n2013\nAmendment 1 2007 Structural design actions. Snow and ice actions\nAS\n1562.1\n1992\nDesign and Installation of sheet roof and wall cladding - Part 1 Metal\nAS\n1562.3\n2006\nDesign and Installation of sheet roof and wall cladding - Part 3 Plastic (was\nAS/NZS 1562.3 1996)\nAS/NZS\n1734\n1997\nAluminium and aluminium alloys - Flat sheet, coiled sheet and plate\nAS/NZS\n2728\n2013\nPrefinished/prepainted sheet metal products for interior/exterior building\napplications-Performance requirements\nAS/NZS\n4257\n1994/97Plastic roof and wall cladding materials. Parts 0-9 Methods of Test.\nAS/NZS\n4389\n2015\nRoof Safety Mesh.\nAS/NZS\n4600\n2005\nAmendment 1 2010. Cold-formed Steel Structures.\nAS 1391\n2007\n(R2017) Metallic materials - Tensile testing at ambient temperature\nAS 1397 2012\nContinuous hot-dip metallic coated steel sheet and strip - Coatings of zinc and\nzinc alloyed with aluminium and magnesium\nAS\n3566.1\n2002\n1. General requirements and mechanical properties\nAS\n3566.2\n2002\n2. Corrosion resistance requirements. (Withdrawn)\nAS 4256 2006\nPlastic roof and wall cladding materials. (Now AS only previously AS/NZS\n4256 1994). Parts 1-5. Plastic materials.\nBS 1470\n1987\nSpecification for wrought aluminium and aluminium alloys for general\nengineering purposes. (Replaced by 9 EN Standards) See AS 1734\nBS 2870 1980\nSpecification for rolled copper and copper alloys. (Replaced by EN standards)\nBS EN\n\n1987\nand BS EN 1179 2003 Specification for zinc alloy sheet and strip\n\nISO 9223 2012\nCorrosion of metals and alloys. Corrosivity of atmospheres - Classification.\nISO 9224 2012\nCorrosion of metals and alloys. Corrosivity of atmospheres - Guiding values\nfor the corrosion categories.\nISO 9225 2012\nCorrosion of metals and alloys -- Corrosivity of atmospheres -- Measurement\nof environmental parameters affecting corosivity of sites\nISO 9226 2012\nCorrosion of metals and alloys -- Corrosivity of atmospheres -- Determination\nof corrosion rate of standard specimens\nAS/NZS\n3500.3\n2015\nStormwater drainage\nAS/NZS\n2179.1\n2014\nMetal shape or sheet rainwater goods, and metal accessories and fasteners\nAS 2180 1986\nMetal rainwater goods - Selection and installation\nHB 114\n1998\nGuidelines for design of eaves and box gutters\nAS 4312 2008\nAtmospheric corrosivity zones in Australia\nHB 39\n2015\nInstallation code for metal roofing and wall cladding\nAS/NZS\n2312\n2002\nGuide to the protection of structural steel against atmospheric corrosion by\nthe use of protective coatings\nAS\n4040.0\n1998\nMethods of testing sheet roof and wall cladding Introduction, list of methods\nand general requirements\nAS\n4040.1\n1998\nMethods of testing sheet roof and wall cladding Resistance to concentrated\nloads\nAS\n4040.2\n1998\nMethods of testing sheet roof and wall cladding Resistance to wind pressures\nfor non-cyclone regions\nAS/NZS\n4200.1\n2017\nPliable building membranes Part 1: Materials\nAS\n4200.2\n2017\nPliable building membranes Part 2: Installation\nStandardYear\nTitle\nAcknowledgements\nThe MRM Technical Committee continuously update this COP, which was originally authored by Stuart Thomson.\nOur thanks to advisors, designers and tradespeople for their input.\nDisputes\nUnder the provisions of the Building Act and the NZBC, a contractor who undertakes to do work on a building\nimplies that he can produce an effective and sound result which will fulfil its intended purpose.\nThere is a customer expectation, backed by consumer legislation, that the finished work will leave the building\nweathertight, and the work done will comply with the NZBC and will be to a standard that is described as\n\"acceptable trade practice\".\n\"Acceptable trade practice\" and \"good trade practice\" for the Roofing Industry are both described and contained in\nthis Code of Practice. In addition to any contractual or verbal offer there may also be a written obligation given in\nthe form of a warranty. See 16.9 Material Selection\nAll contractors should ensure that materials they use comply with the requirements and specifications contained\nwithin this Code of Practice. All suppliers' or manufacturers' product literature should be dated; and where\nsuperseding previous literature the dates should be referenced. The user must ensure that suppliers or\nmanufacturers product literature is the latest version published.\nContractors must be satisfied that the product as described in the product literature is acceptable to the\nTerritorial Authority, and contractors must be aware of their liability under law and the contractual documents\nthey have signed or agreed to.\nCustomer expectation is supported by law that states that the material and product used must be fit for its\nintended purpose, and the liability of each of the parties is assessed on their 'failure to warn that the product\nwould not fulfil a perceived function\".\nPoor workmanship is a common cause of dispute and it is often given as the reason for non-payment between\nthe sub-contractor and contractor or owner. This Code of Practice provides a standard of workmanship and a\nbenchmark for arbitration.\nIt is in the interest of all parties to avoid the cost and delay of litigation and although there are other voluntary\nways to settle disputes, they all require some compromise by those concerned.\nOne voluntary method is negotiation by calling a site meeting where all interested parties can air their grievances\nacross a table and draw up a programme of rectification and reach an agreement over responsibilities and\npayment.\nAny agreement must be recorded, signed and state what is to be done, how much is to be paid, by whom, by when,\nand how it will be accepted and checked. If no agreement can be reached then a solution may be found through\nmediation.\nThe Weathertight Homes Resolution Services Act 2006 provides for a mediation service to be available to\ndwelling/house owners with eligible claims. The claiming owner and any of the other parties against whom the\nclaim is made may agree to refer the claim to mediation, with provision for binding settlements by agreement.\nThis service is restricted to leaky homes built within 10 years of the claim.\n1.5.1\nMediation\n\nMediation is a cost-effective, confidential, and voluntary process where the mediator is the facilitator who assists\nthe parties in reaching a negotiated agreement. Mediation concentrates on the parties' interests rather than on\ntheir rights, when often both parties realise that they are partly at fault and wish to resolve the dispute and accept\na compromise, as opposed to litigation. Any recorded settlement in a mediation agreement can be enforced as a\ncontract, but if they cannot settle, they can resort to arbitration or the courts.\nAn impartial mediator is appointed and should act independently, avoid unnecessary expenses and comply with\nthe principles of natural justice. The mediator's task is to help the parties identify the issues and options for\nsettlement and seek a settlement that is fair to all concerned. All relevant documents including specifications,\nplans, quotations, and written submissions setting out the basis of the complaint and the rebuttal by the other\nparty must be provided to the mediator.\nAfter an investigation, site visits, and discussion with all the parties, the mediator, using trade benchmarks such\nas this Code of Practice and drawing on experience can apportion responsibilities and instruct rectification work\nbe done. This method can provide a quick and inexpensive outcome with costs shared by both parties, but the\ndecision is not binding and must be mutually agreed to.\nInformal resolution of disputes does not necessarily uncover the facts; and as material or installation failures are\nnot necessarily publicly disclosed, improvement can be inhibited.\nMediation does provide the opportunity to 'move on' and does not always jeopardize business relationships as\nlitigation invariably does.\n1.5.2\nAdjudication\nThe Construction Contracts Act allows for a dispute process called adjudication, to be the first option if\nnegotiation fails. It involves a thirty-day formal process during which the claimant appoints an adjudicator, and\nthe respondent cannot opt out. The process is designed mainly for payment disputes, but it can also be used for\nworkmanship disputes and is expected to become the normal dispute resolution method in the Construction\nIndustry.\nThe adjudicator's decision, called a determination, is binding and enforceable by the courts. An unsatisfied party\nmay only appeal an adjudication after complying with the determination. The adjudication is subject to\nconfidentiality, except by mutual consent or if the information is already in the public domain.\nThe disadvantage of both mediation and adjudication is that the faults are not published to the roofing industry,\nwho should be able to learn from the mistakes of the past.\nWhere the amount in question is under $7,500, or $12,000 by agreement with the other party, an alternative\nmethod is to file the complaint with the Disputes Tribunal. The parties usually represent themselves, without\nlawyers, and a compromise outcome is sought by a referee. This method of settlement gives no assurance of an\nequitable outcome or that the outcome will be based on technical grounds; the main purpose of this court is to\nseek agreement between the parties.\n1.5.3\nArbitration and Litigation\nArbitration is usually a strict and formal process similar to litigation in which the parties may be legally\nrepresented, and select and pay for the arbitrator. Arbitrators must comply with the Arbitration Act; their imposed\ndecision is known as an award, and it is final and binding.\n\nThe final and most expensive alternative is litigation. That usually involves suing for breach of contract, non-\npayment, non-performance, faulty materials, or non-compliance. Judgment is publicly imposed and usually made\nby comparison with \"state of the art\" materials and practices available at the time the contract was signed.\nBoth arbitration and litigation can be prolonged and the parties' cost may exceed the amount in dispute.\nWhen roofing contractors sublet the contract, they assume the same responsibility as though they carried out the\nwork.\nTo avoid disputes, roofing suppliers and contractors must give adequate instruction, training, and supervision.\nThey should also keep their staff informed of industry developments and with the contents of the New Zealand\nMetal Roof and Wall Cladding Code of Practice.","pdfPages":[8,9,10,11,12,13,14,15,16,17],"subsections":[{"number":"1.1","title":"Disclaimer and Copyright","level":2,"content":"Although the information contained in this Code has been obtained from sources believed to be reliable, New\nZealand Metal Roofing Manufacturers Inc. makes no warranties or representations of any kind (express or\nimplied) regarding the accuracy, adequacy, currency or completeness of the information, or that it is suitable for\nthe intended use.\nCompliance with this Code does not guarantee immunity from breach of any statutory requirements, the New\nZealand Building Code or relevant Standards. The final responsibility for the correct design and specification\nrests with the designer and for its satisfactory execution with the contractor.\nWhile most data have been compiled from case histories, trade experience and testing, small changes in the\nenvironment can produce marked differences in performance. The decision to use a particular material, and in\nwhat manner, is made at your own risk. The use of a particular material and method may, therefore, need to be\nmodified to its intended end use and environment.\nNew Zealand Metal Roofing Manufacturers Inc., its directors, officers or employees shall not be responsible for\nany direct, indirect or special loss or damage arising from, as a consequence of, use of or reliance upon any\ninformation contained in this Code.\nNew Zealand Metal Roofing Manufacturers Inc. expressly disclaims any liability which is based on or arises out\nof the information or any errors, omissions or misstatements.\nIf reprinted, reproduced or used in any form, the New Zealand Metal Roofing Manufacturers Inc. (NZMRM) should\nbe acknowledged as the source of information.\nBefore using this Code, please refer to the New Zealand Metal Roofing Manufacturers Inc. website\n(www.metalroofing.org.nz) for the most recent updates on information contained in this Code.\n1.1.1\nCode of Practice Update-Policy\nFor continued improvement and to keep up with new developments, New Zealand Metal Roofing Manufacturers\nInc. (NZMRM) publishes quarterly updates to this Code of Practice\nFrom September 2023, the nominal Version number of the Code of Practice follows a \"year.month\" pattern,\nbeginning with v23.09, for clear identification of the date of the latest updated version.\nPlease note:\nAlways use the current online Code of Practice to ensure you have the most recent recommendations.\nHaving registered to access the Code of Practice, you will be notified by email of the most notable changes at\nthe publication of each update.\nA comprehensive history of revisions with a detailed log of changes is available at 19 Revision History.\nArchival copies of previous versions are available if required.\nPlease contact admin@metalroofing.org.nz with details if you have a specific requirement.","pdfPages":[10],"subsections":[{"number":"1.1.1","title":"Code of Practice Update-Policy","level":3,"content":"1.1\nDisclaimer and Copyright\nAlthough the information contained in this Code has been obtained from sources believed to be reliable, New\nZealand Metal Roofing Manufacturers Inc. makes no warranties or representations of any kind (express or\nimplied) regarding the accuracy, adequacy, currency or completeness of the information, or that it is suitable for\nthe intended use.\nCompliance with this Code does not guarantee immunity from breach of any statutory requirements, the New\nZealand Building Code or relevant Standards. The final responsibility for the correct design and specification\nrests with the designer and for its satisfactory execution with the contractor.\nWhile most data have been compiled from case histories, trade experience and testing, small changes in the\nenvironment can produce marked differences in performance. The decision to use a particular material, and in\nwhat manner, is made at your own risk. The use of a particular material and method may, therefore, need to be\nmodified to its intended end use and environment.\nNew Zealand Metal Roofing Manufacturers Inc., its directors, officers or employees shall not be responsible for\nany direct, indirect or special loss or damage arising from, as a consequence of, use of or reliance upon any\ninformation contained in this Code.\nNew Zealand Metal Roofing Manufacturers Inc. expressly disclaims any liability which is based on or arises out\nof the information or any errors, omissions or misstatements.\nIf reprinted, reproduced or used in any form, the New Zealand Metal Roofing Manufacturers Inc. (NZMRM) should\nbe acknowledged as the source of information.\nBefore using this Code, please refer to the New Zealand Metal Roofing Manufacturers Inc. website\n(www.metalroofing.org.nz) for the most recent updates on information contained in this Code.\n1.1.1\nCode of Practice Update-Policy\nFor continued improvement and to keep up with new developments, New Zealand Metal Roofing Manufacturers\nInc. (NZMRM) publishes quarterly updates to this Code of Practice\nFrom September 2023, the nominal Version number of the Code of Practice follows a \"year.month\" pattern,\nbeginning with v23.09, for clear identification of the date of the latest updated version.\nPlease note:\nAlways use the current online Code of Practice to ensure you have the most recent recommendations.\nHaving registered to access the Code of Practice, you will be notified by email of the most notable changes at\nthe publication of each update.\nA comprehensive history of revisions with a detailed log of changes is available at 19 Revision History.\nArchival copies of previous versions are available if required.\nPlease contact admin@metalroofing.org.nz with details if you have a specific requirement.","pdfPages":[10]}]},{"number":"1.2","title":"Scope","level":2,"content":"This Code of Practice provides requirements, information and guidelines, to the Building Consent Authorities, the\nBuilding Certifier, Specifier, Designer, Licensed Building Practitioner, Trade Trainee, Installer and the end user on\nthe design, installation, performance, and transportation of all metal roof and wall cladding used in New Zealand.\nThe calculations and the details contained in this Code of Practice provide a means of complying with the\nperformance provisions of the NZBC and the requirements of the Health and Safety at Work Act 2015.\nThe scope of this document includes all buildings covered by NZS 3604, AS/NZS 1170 and those designed and\nbuilt under specific engineering design.\nIt has been written and compiled from proven performance and cites a standard of acceptable practice agreed\nbetween manufacturers and roofing contractors.\nThe drawings and requirements contained in this Code illustrate acceptable trade practice, but recommended or\nbetter trade practice is also quoted as being a preferred alternative.\nBecause the environment and wind categories vary throughout New Zealand, acceptable trade practice must be\naltered accordingly; in severe environments and high wind design load categories, the requirements of the NZBC\nwill only be met by using specific detailing as described in this Code.\nThe purpose of this Code of Practice is to present both Acceptable Trade Practice and Recommended Trade\nPractice, in a user-friendly format to ensure that the roof and wall cladding, flashings, drainage accessories, and\nfastenings will:\ncomply with the requirements of B1, B2, E1 E2 and E3 of the NZBC;\ncomply with the design loading requirements of AS/NZS 1170 and NZS 3604 and with AS/NZS 1562;\nhave and optimised lifespan; and\nbe weathertight.","pdfPages":[11]},{"number":"1.3","title":"Standards and Related Documents","level":2,"content":"1.3A\nStandardYear\nTitle\nNZ 2295 2017\nPliable, permeable building underlays. (either NZS 2295 2017 or NZS 2295\nAmendment 1 2017)\nNZS 36022003\nTimber and wood based products for use in building.\nNZS 36031993\nAmendment 4 2005 Timber Structures Standard.\nNZS 36042011\nTimber Framed Buildings.\nAS/NZS\n1170.0\n2002\nAmendment 5 2011 Structural design actions. General Principles. Commentary\nto Parts 0, 1 and 2.\nAS/NZS\n1170.1\n2002\nAmendment 2 2009 Structural design actions. Permanent, imposed and other\nactions.\nAS/NZS\n1170.2\n2011\nAmendment 4 2016. Structural design actions. Wind Actions.\nAS/NZS\n1170.3\n2013\nAmendment 1 2007 Structural design actions. Snow and ice actions\nAS\n1562.1\n1992\nDesign and Installation of sheet roof and wall cladding - Part 1 Metal\nAS\n1562.3\n2006\nDesign and Installation of sheet roof and wall cladding - Part 3 Plastic (was\nAS/NZS 1562.3 1996)\nAS/NZS\n1734\n1997\nAluminium and aluminium alloys - Flat sheet, coiled sheet and plate\nAS/NZS\n2728\n2013\nPrefinished/prepainted sheet metal products for interior/exterior building\napplications-Performance requirements\nAS/NZS\n4257\n1994/97Plastic roof and wall cladding materials. Parts 0-9 Methods of Test.\nAS/NZS\n4389\n2015\nRoof Safety Mesh.\nAS/NZS\n4600\n2005\nAmendment 1 2010. Cold-formed Steel Structures.\nAS 1391\n2007\n(R2017) Metallic materials - Tensile testing at ambient temperature\nAS 1397 2012\nContinuous hot-dip metallic coated steel sheet and strip - Coatings of zinc and\nzinc alloyed with aluminium and magnesium\nAS\n3566.1\n2002\n1. General requirements and mechanical properties\nAS\n3566.2\n2002\n2. Corrosion resistance requirements. (Withdrawn)\nAS 4256 2006\nPlastic roof and wall cladding materials. (Now AS only previously AS/NZS\n4256 1994). Parts 1-5. Plastic materials.\nBS 1470\n1987\nSpecification for wrought aluminium and aluminium alloys for general\nengineering purposes. (Replaced by 9 EN Standards) See AS 1734\nBS 2870 1980\nSpecification for rolled copper and copper alloys. (Replaced by EN standards)\nBS EN\n\n1987\nand BS EN 1179 2003 Specification for zinc alloy sheet and strip\n\nISO 9223 2012\nCorrosion of metals and alloys. Corrosivity of atmospheres - Classification.\nISO 9224 2012\nCorrosion of metals and alloys. Corrosivity of atmospheres - Guiding values\nfor the corrosion categories.\nISO 9225 2012\nCorrosion of metals and alloys -- Corrosivity of atmospheres -- Measurement\nof environmental parameters affecting corosivity of sites\nISO 9226 2012\nCorrosion of metals and alloys -- Corrosivity of atmospheres -- Determination\nof corrosion rate of standard specimens\nAS/NZS\n3500.3\n2015\nStormwater drainage\nAS/NZS\n2179.1\n2014\nMetal shape or sheet rainwater goods, and metal accessories and fasteners\nAS 2180 1986\nMetal rainwater goods - Selection and installation\nHB 114\n1998\nGuidelines for design of eaves and box gutters\nAS 4312 2008\nAtmospheric corrosivity zones in Australia\nHB 39\n2015\nInstallation code for metal roofing and wall cladding\nAS/NZS\n2312\n2002\nGuide to the protection of structural steel against atmospheric corrosion by\nthe use of protective coatings\nAS\n4040.0\n1998\nMethods of testing sheet roof and wall cladding Introduction, list of methods\nand general requirements\nAS\n4040.1\n1998\nMethods of testing sheet roof and wall cladding Resistance to concentrated\nloads\nAS\n4040.2\n1998\nMethods of testing sheet roof and wall cladding Resistance to wind pressures\nfor non-cyclone regions\nAS/NZS\n4200.1\n2017\nPliable building membranes Part 1: Materials\nAS\n4200.2\n2017\nPliable building membranes Part 2: Installation\nStandardYear\nTitle","pdfPages":[12,13]},{"number":"1.4","title":"Acknowledgements","level":2,"content":"The MRM Technical Committee continuously update this COP, which was originally authored by Stuart Thomson.\nOur thanks to advisors, designers and tradespeople for their input.","pdfPages":[14]},{"number":"1.5","title":"Disputes","level":2,"content":"Under the provisions of the Building Act and the NZBC, a contractor who undertakes to do work on a building\nimplies that he can produce an effective and sound result which will fulfil its intended purpose.\nThere is a customer expectation, backed by consumer legislation, that the finished work will leave the building\nweathertight, and the work done will comply with the NZBC and will be to a standard that is described as\n\"acceptable trade practice\".\n\"Acceptable trade practice\" and \"good trade practice\" for the Roofing Industry are both described and contained in\nthis Code of Practice. In addition to any contractual or verbal offer there may also be a written obligation given in\nthe form of a warranty. See 16.9 Material Selection\nAll contractors should ensure that materials they use comply with the requirements and specifications contained\nwithin this Code of Practice. All suppliers' or manufacturers' product literature should be dated; and where\nsuperseding previous literature the dates should be referenced. The user must ensure that suppliers or\nmanufacturers product literature is the latest version published.\nContractors must be satisfied that the product as described in the product literature is acceptable to the\nTerritorial Authority, and contractors must be aware of their liability under law and the contractual documents\nthey have signed or agreed to.\nCustomer expectation is supported by law that states that the material and product used must be fit for its\nintended purpose, and the liability of each of the parties is assessed on their 'failure to warn that the product\nwould not fulfil a perceived function\".\nPoor workmanship is a common cause of dispute and it is often given as the reason for non-payment between\nthe sub-contractor and contractor or owner. This Code of Practice provides a standard of workmanship and a\nbenchmark for arbitration.\nIt is in the interest of all parties to avoid the cost and delay of litigation and although there are other voluntary\nways to settle disputes, they all require some compromise by those concerned.\nOne voluntary method is negotiation by calling a site meeting where all interested parties can air their grievances\nacross a table and draw up a programme of rectification and reach an agreement over responsibilities and\npayment.\nAny agreement must be recorded, signed and state what is to be done, how much is to be paid, by whom, by when,\nand how it will be accepted and checked. If no agreement can be reached then a solution may be found through\nmediation.\nThe Weathertight Homes Resolution Services Act 2006 provides for a mediation service to be available to\ndwelling/house owners with eligible claims. The claiming owner and any of the other parties against whom the\nclaim is made may agree to refer the claim to mediation, with provision for binding settlements by agreement.\nThis service is restricted to leaky homes built within 10 years of the claim.\n1.5.1\nMediation\n\nMediation is a cost-effective, confidential, and voluntary process where the mediator is the facilitator who assists\nthe parties in reaching a negotiated agreement. Mediation concentrates on the parties' interests rather than on\ntheir rights, when often both parties realise that they are partly at fault and wish to resolve the dispute and accept\na compromise, as opposed to litigation. Any recorded settlement in a mediation agreement can be enforced as a\ncontract, but if they cannot settle, they can resort to arbitration or the courts.\nAn impartial mediator is appointed and should act independently, avoid unnecessary expenses and comply with\nthe principles of natural justice. The mediator's task is to help the parties identify the issues and options for\nsettlement and seek a settlement that is fair to all concerned. All relevant documents including specifications,\nplans, quotations, and written submissions setting out the basis of the complaint and the rebuttal by the other\nparty must be provided to the mediator.\nAfter an investigation, site visits, and discussion with all the parties, the mediator, using trade benchmarks such\nas this Code of Practice and drawing on experience can apportion responsibilities and instruct rectification work\nbe done. This method can provide a quick and inexpensive outcome with costs shared by both parties, but the\ndecision is not binding and must be mutually agreed to.\nInformal resolution of disputes does not necessarily uncover the facts; and as material or installation failures are\nnot necessarily publicly disclosed, improvement can be inhibited.\nMediation does provide the opportunity to 'move on' and does not always jeopardize business relationships as\nlitigation invariably does.\n1.5.2\nAdjudication\nThe Construction Contracts Act allows for a dispute process called adjudication, to be the first option if\nnegotiation fails. It involves a thirty-day formal process during which the claimant appoints an adjudicator, and\nthe respondent cannot opt out. The process is designed mainly for payment disputes, but it can also be used for\nworkmanship disputes and is expected to become the normal dispute resolution method in the Construction\nIndustry.\nThe adjudicator's decision, called a determination, is binding and enforceable by the courts. An unsatisfied party\nmay only appeal an adjudication after complying with the determination. The adjudication is subject to\nconfidentiality, except by mutual consent or if the information is already in the public domain.\nThe disadvantage of both mediation and adjudication is that the faults are not published to the roofing industry,\nwho should be able to learn from the mistakes of the past.\nWhere the amount in question is under $7,500, or $12,000 by agreement with the other party, an alternative\nmethod is to file the complaint with the Disputes Tribunal. The parties usually represent themselves, without\nlawyers, and a compromise outcome is sought by a referee. This method of settlement gives no assurance of an\nequitable outcome or that the outcome will be based on technical grounds; the main purpose of this court is to\nseek agreement between the parties.\n1.5.3\nArbitration and Litigation\nArbitration is usually a strict and formal process similar to litigation in which the parties may be legally\nrepresented, and select and pay for the arbitrator. Arbitrators must comply with the Arbitration Act; their imposed\ndecision is known as an award, and it is final and binding.\n\nThe final and most expensive alternative is litigation. That usually involves suing for breach of contract, non-\npayment, non-performance, faulty materials, or non-compliance. Judgment is publicly imposed and usually made\nby comparison with \"state of the art\" materials and practices available at the time the contract was signed.\nBoth arbitration and litigation can be prolonged and the parties' cost may exceed the amount in dispute.\nWhen roofing contractors sublet the contract, they assume the same responsibility as though they carried out the\nwork.\nTo avoid disputes, roofing suppliers and contractors must give adequate instruction, training, and supervision.\nThey should also keep their staff informed of industry developments and with the contents of the New Zealand\nMetal Roof and Wall Cladding Code of Practice.","pdfPages":[15,16,17],"subsections":[{"number":"1.5.1","title":"Mediation","level":3,"content":"1.5\nDisputes\nUnder the provisions of the Building Act and the NZBC, a contractor who undertakes to do work on a building\nimplies that he can produce an effective and sound result which will fulfil its intended purpose.\nThere is a customer expectation, backed by consumer legislation, that the finished work will leave the building\nweathertight, and the work done will comply with the NZBC and will be to a standard that is described as\n\"acceptable trade practice\".\n\"Acceptable trade practice\" and \"good trade practice\" for the Roofing Industry are both described and contained in\nthis Code of Practice. In addition to any contractual or verbal offer there may also be a written obligation given in\nthe form of a warranty. See 16.9 Material Selection\nAll contractors should ensure that materials they use comply with the requirements and specifications contained\nwithin this Code of Practice. All suppliers' or manufacturers' product literature should be dated; and where\nsuperseding previous literature the dates should be referenced. The user must ensure that suppliers or\nmanufacturers product literature is the latest version published.\nContractors must be satisfied that the product as described in the product literature is acceptable to the\nTerritorial Authority, and contractors must be aware of their liability under law and the contractual documents\nthey have signed or agreed to.\nCustomer expectation is supported by law that states that the material and product used must be fit for its\nintended purpose, and the liability of each of the parties is assessed on their 'failure to warn that the product\nwould not fulfil a perceived function\".\nPoor workmanship is a common cause of dispute and it is often given as the reason for non-payment between\nthe sub-contractor and contractor or owner. This Code of Practice provides a standard of workmanship and a\nbenchmark for arbitration.\nIt is in the interest of all parties to avoid the cost and delay of litigation and although there are other voluntary\nways to settle disputes, they all require some compromise by those concerned.\nOne voluntary method is negotiation by calling a site meeting where all interested parties can air their grievances\nacross a table and draw up a programme of rectification and reach an agreement over responsibilities and\npayment.\nAny agreement must be recorded, signed and state what is to be done, how much is to be paid, by whom, by when,\nand how it will be accepted and checked. If no agreement can be reached then a solution may be found through\nmediation.\nThe Weathertight Homes Resolution Services Act 2006 provides for a mediation service to be available to\ndwelling/house owners with eligible claims. The claiming owner and any of the other parties against whom the\nclaim is made may agree to refer the claim to mediation, with provision for binding settlements by agreement.\nThis service is restricted to leaky homes built within 10 years of the claim.\n1.5.1\nMediation","pdfPages":[15]},{"number":"1.5.2","title":"Adjudication","level":3,"content":"Mediation is a cost-effective, confidential, and voluntary process where the mediator is the facilitator who assists\nthe parties in reaching a negotiated agreement. Mediation concentrates on the parties' interests rather than on\ntheir rights, when often both parties realise that they are partly at fault and wish to resolve the dispute and accept\na compromise, as opposed to litigation. Any recorded settlement in a mediation agreement can be enforced as a\ncontract, but if they cannot settle, they can resort to arbitration or the courts.\nAn impartial mediator is appointed and should act independently, avoid unnecessary expenses and comply with\nthe principles of natural justice. The mediator's task is to help the parties identify the issues and options for\nsettlement and seek a settlement that is fair to all concerned. All relevant documents including specifications,\nplans, quotations, and written submissions setting out the basis of the complaint and the rebuttal by the other\nparty must be provided to the mediator.\nAfter an investigation, site visits, and discussion with all the parties, the mediator, using trade benchmarks such\nas this Code of Practice and drawing on experience can apportion responsibilities and instruct rectification work\nbe done. This method can provide a quick and inexpensive outcome with costs shared by both parties, but the\ndecision is not binding and must be mutually agreed to.\nInformal resolution of disputes does not necessarily uncover the facts; and as material or installation failures are\nnot necessarily publicly disclosed, improvement can be inhibited.\nMediation does provide the opportunity to 'move on' and does not always jeopardize business relationships as\nlitigation invariably does.\n1.5.2\nAdjudication\nThe Construction Contracts Act allows for a dispute process called adjudication, to be the first option if\nnegotiation fails. It involves a thirty-day formal process during which the claimant appoints an adjudicator, and\nthe respondent cannot opt out. The process is designed mainly for payment disputes, but it can also be used for\nworkmanship disputes and is expected to become the normal dispute resolution method in the Construction\nIndustry.\nThe adjudicator's decision, called a determination, is binding and enforceable by the courts. An unsatisfied party\nmay only appeal an adjudication after complying with the determination. The adjudication is subject to\nconfidentiality, except by mutual consent or if the information is already in the public domain.\nThe disadvantage of both mediation and adjudication is that the faults are not published to the roofing industry,\nwho should be able to learn from the mistakes of the past.\nWhere the amount in question is under $7,500, or $12,000 by agreement with the other party, an alternative\nmethod is to file the complaint with the Disputes Tribunal. The parties usually represent themselves, without\nlawyers, and a compromise outcome is sought by a referee. This method of settlement gives no assurance of an\nequitable outcome or that the outcome will be based on technical grounds; the main purpose of this court is to\nseek agreement between the parties.\n1.5.3\nArbitration and Litigation\nArbitration is usually a strict and formal process similar to litigation in which the parties may be legally\nrepresented, and select and pay for the arbitrator. Arbitrators must comply with the Arbitration Act; their imposed\ndecision is known as an award, and it is final and binding.","pdfPages":[16]},{"number":"1.5.3","title":"Arbitration and Litigation","level":3,"content":"Mediation is a cost-effective, confidential, and voluntary process where the mediator is the facilitator who assists\nthe parties in reaching a negotiated agreement. Mediation concentrates on the parties' interests rather than on\ntheir rights, when often both parties realise that they are partly at fault and wish to resolve the dispute and accept\na compromise, as opposed to litigation. Any recorded settlement in a mediation agreement can be enforced as a\ncontract, but if they cannot settle, they can resort to arbitration or the courts.\nAn impartial mediator is appointed and should act independently, avoid unnecessary expenses and comply with\nthe principles of natural justice. The mediator's task is to help the parties identify the issues and options for\nsettlement and seek a settlement that is fair to all concerned. All relevant documents including specifications,\nplans, quotations, and written submissions setting out the basis of the complaint and the rebuttal by the other\nparty must be provided to the mediator.\nAfter an investigation, site visits, and discussion with all the parties, the mediator, using trade benchmarks such\nas this Code of Practice and drawing on experience can apportion responsibilities and instruct rectification work\nbe done. This method can provide a quick and inexpensive outcome with costs shared by both parties, but the\ndecision is not binding and must be mutually agreed to.\nInformal resolution of disputes does not necessarily uncover the facts; and as material or installation failures are\nnot necessarily publicly disclosed, improvement can be inhibited.\nMediation does provide the opportunity to 'move on' and does not always jeopardize business relationships as\nlitigation invariably does.\n1.5.2\nAdjudication\nThe Construction Contracts Act allows for a dispute process called adjudication, to be the first option if\nnegotiation fails. It involves a thirty-day formal process during which the claimant appoints an adjudicator, and\nthe respondent cannot opt out. The process is designed mainly for payment disputes, but it can also be used for\nworkmanship disputes and is expected to become the normal dispute resolution method in the Construction\nIndustry.\nThe adjudicator's decision, called a determination, is binding and enforceable by the courts. An unsatisfied party\nmay only appeal an adjudication after complying with the determination. The adjudication is subject to\nconfidentiality, except by mutual consent or if the information is already in the public domain.\nThe disadvantage of both mediation and adjudication is that the faults are not published to the roofing industry,\nwho should be able to learn from the mistakes of the past.\nWhere the amount in question is under $7,500, or $12,000 by agreement with the other party, an alternative\nmethod is to file the complaint with the Disputes Tribunal. The parties usually represent themselves, without\nlawyers, and a compromise outcome is sought by a referee. This method of settlement gives no assurance of an\nequitable outcome or that the outcome will be based on technical grounds; the main purpose of this court is to\nseek agreement between the parties.\n1.5.3\nArbitration and Litigation\nArbitration is usually a strict and formal process similar to litigation in which the parties may be legally\nrepresented, and select and pay for the arbitrator. Arbitrators must comply with the Arbitration Act; their imposed\ndecision is known as an award, and it is final and binding.\n\nThe final and most expensive alternative is litigation. That usually involves suing for breach of contract, non-\npayment, non-performance, faulty materials, or non-compliance. Judgment is publicly imposed and usually made\nby comparison with \"state of the art\" materials and practices available at the time the contract was signed.\nBoth arbitration and litigation can be prolonged and the parties' cost may exceed the amount in dispute.\nWhen roofing contractors sublet the contract, they assume the same responsibility as though they carried out the\nwork.\nTo avoid disputes, roofing suppliers and contractors must give adequate instruction, training, and supervision.\nThey should also keep their staff informed of industry developments and with the contents of the New Zealand\nMetal Roof and Wall Cladding Code of Practice.","pdfPages":[16,17]}]}]}]}