{"chapterNumber":7,"title":"External Moisture Roofing","version":"v25.12","sectionCount":20,"sections":[{"number":"7","title":"External Moisture Roofing","level":1,"content":"7 \nExternal Moisture\nRoofing \nThis section should be read in conjunction with 6 External Moisture Overview.\n 7 \n 7 \n207\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.1 \nRoof Pitch \nThe pitch is the angle between the horizontal and the roof line. It is also the relationship between the rise and the\nhorizontal span of the roof. See 18.2 Pitch & Rise Calculator for the tabulation of these values and a\ncalculation tool.\n7.1.1 \nMinimum Roof Cladding Pitch \n7.1.1A Minimum Pitch for Generic Metal Roofing\nProfile\nMin Height\nMin Pitch\nCheck Capacity\nafter run of...\nTrapezoidal\nAsymmetrical\n20\n4 deg \n20 m\n27\n3 deg \n40 m\n36\n3 deg \n65 m\nTrapezoidal\nSymmetrical\n20\n4 deg \n15 m\n30\n4 deg \n25 m\nSecret Fix\n30\n3 deg \n60 m\n25\n3 deg \n30 m\nStanding Seam\n30\n3 deg \n85 m\n25\n3 deg \n35 m\nCorrugate\n16.5\n8 deg \n15 m\n21\n4 deg \n20 m\n35\n3 deg \n65 m\nMinimum pitches quoted in this table refer to roof cladding pitch and not the building design roof pitch.\nBuildings designed with widely spaced purlins and widely spaced portal frames may require an increased design\npitch to comply with the minimum recommended as-laid pitches.\nLow-pitched roofs require greater attention to flashing details. The ability of side laps or end laps to withstand\nwater penetration also becomes more critical at low pitches, but a good design of flashings can ensure\nweathertightness in extreme conditions.\nA printable bulletin regarding re-roofing low pitched trough section roofs is available at: BSP01 Replacing\nTrough Section Roofs at a 1 deg Pitch.\nExtract:\n\"Roof replacement with a \"like with like\" does not require a building consent (Exemptions Guidance for\nSchedule 1 of the Building Act 2004, Fifth edition August 2020). An existing flat roof that has met the\nperformance requirements of E2-External Moisture, and B2-Durability, can be replaced with a\ncomparable product, without re-pitching the roof.\"\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n208\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nWater buildup on vertical surfaces due to intense localised wind patterns, particularly around\nparapets and along the lower edges of walls, creates vulnerable areas. Wind baffles are more\neffective in preventing water ingress than increasing the flashing cover width.\n7.1.1B Exceptions to the Minimum Recommended Roof Cladding Pitch\nrequirements:\nCurved roofs, where, by design, the minimum pitch at the crest is always less than the prescribed minimum\npitch. In these cases, the pitch at the eaves must comply with the profile's minimum pitch, and the pitch at the\nupper end of a terminated arc must be a minimum of 3 deg . (See 15.1 Curved Roofs).\nThe back curbs of penetration flashings where the minimum pitch is 1.5 deg . (See 9 External Moisture\nPenetrations).\nReroofing trough section roofs at less 3 deg , where satisfies the requirements and considerations of Building\nwork that does not require a building consent (Exemptions Guidance for Schedule 1 of the Building Act 2004)\nFifth edition August 2020. More information is available at Building work that does not require a\nbuilding consent, Section 1.1 General repair, maintenance and replacement of building parts (page22).\n7.1.2 \nRunoff Capacity \nRunoff capacity is the ability of the roof cladding to discharge maximum rainfall without water penetrating\nthrough side laps, end laps or flashings and depends on rainfall, the catchment area, the roof pitch, and the profile\ngeometry.\nThe roof pitch determines the rate of flow; steep slopes shed water faster than shallow slopes. The rib height and\nspacing of trapezoidal profiles also affects its shedding ability.\n For example: At a rainfall intensity of 200 mm/hour, a five-rib trapezoidal profile at 3 deg , with a rib height of\n27 mm, can have a run of 90 m.\nThe 7.1.4 Maximum Run Calculator can calculate capacities for any known profile.\n7.1.3 \nRoof Drainage Capacity \nThe capacity of a roof profile to drain water is determined by its geometry and the roof pitch. The catchment area\nis the distance between rib centres times the length, and the effective cross-section area and the wetted\nperimeter is taken to the height of the overlap on corrugate, or capillary bead on trapezoidal and trough section\nprofiles.\nThe 7.1.4 Maximum Run Calculator gives the maximum length that a roof can drain at a given pitch and\nrainfall intensity. The manufacturer's data can be accessed from the drop-down box; for other profiles, the data\ncan be entered manually into the worksheet.\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n209\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.1.3A Trough Capacity\nRib Pitch\nCapillary Height\nPan Width\nRib Height\nCrest Width\nWhere the flow of water is concentrated by penetrations or spreaders, go to the 9.4.4 Maximum Area Above\nPenetration Calculator.\n7.1.3B Penetration Gutters\nFall\n7.1.4 \nMaximum Run Calculator \nMore information about 5.3 Roof Drainage Design can be found in this PDF Document. A responsive online\ntools for calculating maximum run of any given profile, pitch, and rainfall intensity is available\nat https://www.metalroofing.org.nz/maximum-run-calculator.\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n210\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.2 \nFastening Roofing \nAll fastenings that pierce the sheeting should be provided with adequate sealing washers to prevent leakage.\nSealing washers should be made from Ethylene Propylene Diene Monomer (EPDM).\nFastenings should be tightened only enough to form a weatherproof seal without damaging the sealing washer\nor deforming the sheet profile. Deformed sheeting will cause water to pond around the seal.\nSwarf should be removed from under the sealing washer as it will not only cause staining but also interfere\nwith the seal.\n 7 \n 7.2 FASTENING ROOFING\n 2 \n 7 \n 7.2 \n211\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.3 \nThermal Expansion And Contraction \nAll metal cladding and flashings are subject to expansion and contraction caused by changes in temperature, and\ntheir design should allow for this movement. The energy produced should be absorbed without damage to the\ncladding, fixings or structure. The recommendations in this section are specific to preventing damage and leaks\nthrough thermal movement. Thermal movement can also cause disturbing noise levels in dwellings with shorter\nmember lengths than those recommended in this section. (See 12.1 Roof Noise.)\nThe ribs of metal trapezoidal or corrugated roof and wall cladding absorb expansion across the width of the\nsheets, but special provisions are needed over the sheets' length.\nMuch of the longitudinal expansion is taken up by the bowing of the sheet between fastened supports. The extent\nto which this happens depends on the profile strength and support spacings.\nFailure by thermal expansion normally results in shearing of the fastener. Fasteners into lightweight steel purlins\nup to 3 mm in thickness are less vulnerable as they tend to rotate rather than be subjected to repeated bending\nresulting in fatigue failure. Fasteners into hot rolled steel sections or timber are far more vulnerable to this mode\nof failure and in all run lengths over 20 metres provision for expansion must be made when fastening into such\nsupports.\nWhere overlapping sheets are fastened through the ends, they must be considered as one length to calculate\nthermal movement. Unfastened end laps are not recommended.\nWall cladding does not require the same provisions as roof cladding, because of solar radiation angle.\nOversized holes and washers give some room for expansion and contraction, but it is not enough to allow\nmovement without stress or distortion over long spans. In such cases, a step joint should be used. (See 8.5.4.3B\nStepped Roof Flashing)\n7.3.1 \nTemperature Range \nRanges of temperature likely to be experienced in NZ by different steel cladding are:\n7.3.1A Steel Cladding Temperature Ranges\nMax/Min Roof Temp deg C\n No Wind\nInsulated\nLight colour\n+60 deg -15 deg \n= 75 deg \nInsulated\nDark colour\n+80 deg -15 deg \n= 95 deg \nUninsulated\nLight colour\n+50 deg -10 deg \n= 60 deg \nUninsulated\nDark colour\n+65 deg -10 deg \n= 75 deg \nAluminium and zinc, which have twice the expansion rate of steel, do not necessarily expand to this\ndegree because of the different characteristics of mass, emittance, and radiance which affects\ntheir temperature range. Copper expands one and a half times as much as steel, and stainless steel\ncan expand up to 1.5 times as much as steel depending on composition.\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n212\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nThe theoretical expansion of steel roof cladding in mm is 12 x temperature change x length in\nmetres/1000.\nSteel expansion rates can be calculated as follows:\nGiven a length (e.g., 30 m) and that the material (e.g., a light-coloured uninsulated roof) moves\nthrough a 60 deg C range (e.g., + 50 deg C -10 deg C), the theoretical increase in length is 12 x 60 x 30/1000 =\n21.6 mm.\nThis amount of movement of roof cladding and components does not have to be provided for in\npractice, because:\nThe building also expands with the ambient temperature, although to a lesser degree.\nFasteners into light gauge purlins will roll rather than bend. The purlin flange may also roll to a\ndegree.\nThe roof cladding bows between purlins when it is constrained. Sighting down a corrugated steel\nroof on a warm sunny day will show an undulating line compared to a straight line when the roof\nis cool. The forces created by expansion and contraction are self-levelling, i.e., each component\nmoves under load until the resisting force is more than the expansion force.\nWhen a length of sheeting is solid fastened at the centre and unconstrained at either end, the\nmovement is towards the ends of the sheeting; meaning the actual expansion or contraction\nmovement is only half that of a full length of roof or wall cladding fastened at one end. Special\ndesign of the ridge or head barge flashing is required in these cases to allow free movement.\nAlternatively, sheets can be solidly fixed at the upper region, so all expansion takes place in the\nlower part of the sheet towards the eaves.\n7.3.2 \nRoof Cladding Expansion Provisions \nThe expansion of roof cladding depends on the materials, the constraints imposed by the fixing, the heat paths in\nthe building and the actual temperature. The following graphics are indicative of favourable and unfavourable\nconditions for thermal expansion and suggest what these are. They show the lengths under both sets of\nconditions above which special provision needs to be made to accommodate thermal expansion.\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n213\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.3.2A Favourable Circumstances for Controlling Expansion\n30\n0\n5\n10\n15\n20\n25\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nFlexible light gauge steel \npurlins <3mm \nLight coloured roof cladding\nPurlin spacings greater than 1.5 m\nCrest FixingBuilding not insulated\nVentilated air space below \nroof cladding and underlay\nLow rib profile or corrugate\nNo special requirements\n9mm oversized holes and loa\nspreading washers\nSheet length (metres)\n*\n*\n*\n*\n*\n*\n7.3.2B Unfavourable Circumstances for Controlling Expansion\nNo special requirements\n9mm oversized holes and load\nspreading washers\n30\n0\n5\n10\n15\n20\n25\nPurlins made out of hot rolled stee\nor thicker than 3 mm.\nLaminated timber purlins\nPurlin spacings of less than 1.5 m\nDark coloured roof cladding\nSkillion Roof\nRigid profiles, e.g., high rib\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nSheet length (metres)\n*\n*\n*\n*\n*\n*\nNotes:\n1. Roofs requiring oversized holes are solid fixed towards the ridge and provision for expansion is made towards the gutter line.\n2. These are guidelines only and special engineering of the roof, fixing or ventilation may allow greater spans to\nbe used.\n3. These diagrams refer only to roof cladding screwed through the top. Secret or clip-fixed roofs can move more\nfreely if installed correctly and allow for greater run lengths.\n4. The recommendations are based on preventing damage to the fasteners and are not recommendations to\nprevent roof noise.\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n214\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n215\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.4 \nEnd Laps \nEnd laps should be avoided if possible when installing metal roof cladding, as an incorrectly sealed end lap may\nentrap water and cause corrosion. When the sheets are too long to be transported or exceed the longest\nrecommended length (see 7.3.2 Roof Cladding Expansion Provisions), the transverse or end lap joint can\nbe avoided by using a waterfall step. (See 8.5.4.3A Step Apron Details)\nWhen long lengths outside the capacity of available transport are required, secret-fixed roof cladding can be\nsupplied by using an onsite roll-forming machine.\nWhere end laps are unavoidable, a sealed joint should be made using sealant at both ends of the lap. The upper\nseal is critical as condensation entering the upper side of the lap from underneath can cause rapid corrosion.\n(See 14.11.1 Sealing End Laps.) The sheets are fixed to the purlin using screw fixings with a minimum lap of\n150 mm. For pitches less than 10 deg , a 200 mm lap is recommended.\nThe two lengths should be regarded as one length for expansion provisions.\n7.4.1 \nWall Cladding End Laps \nA printable bulletin is availble at: BEL01 End Laps in Wall Cladding.\nThe bulletin is identical to the content below.\nAs with roofing, wall cladding sheets should, wherever possible, be laid in a single continuous length. Where this\nis not feasible due to excessive length or other constraints, there are options for lapping.\nWhen the internal environment is dry and the wall is unlined, sheets can be simply end-lapped by approximately\n150 mm. In dwellings, lined buildings, and buildings with moist internal environments, the laps should be sealed at\nboth ends as per roof laps. The downside of end lapping is that there are four layers of material at the side\nlap/end lap junction. This often leads to an untidy join.\nThe preferred option where aesthetics must be considered is not to end-lap the sheets, but to have a zed flashing\nunder the upper sheet and over the lower, with cover as shown in 8.4F Barge Flashing Cover - Trapezoidal\nand Secret Fixed Table and 8.4J Transverse Apron Flashing Cover Table. This is both tidier and\nallows the sheets to thermally expand individually.\n 7 \n 7.4 END LAPS\n 7 \n 7.4 \n216\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.4.1A Wall Cladding End Laps\nWall Cladding\nWall Cladding\nFastener\nFastener\n93 deg \nZed Flashing\nProfiled foam\n 7 \n 7.4 END LAPS\n 7 \n 7.4 \n217\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[207,208,209,210,211,212,213,214,215,216,217],"subsections":[{"number":"7.1","title":"Roof Pitch","level":2,"content":"7.1 \nRoof Pitch \nThe pitch is the angle between the horizontal and the roof line. It is also the relationship between the rise and the\nhorizontal span of the roof. See 18.2 Pitch & Rise Calculator for the tabulation of these values and a\ncalculation tool.\n7.1.1 \nMinimum Roof Cladding Pitch \n7.1.1A Minimum Pitch for Generic Metal Roofing\nProfile\nMin Height\nMin Pitch\nCheck Capacity\nafter run of...\nTrapezoidal\nAsymmetrical\n20\n4 deg \n20 m\n27\n3 deg \n40 m\n36\n3 deg \n65 m\nTrapezoidal\nSymmetrical\n20\n4 deg \n15 m\n30\n4 deg \n25 m\nSecret Fix\n30\n3 deg \n60 m\n25\n3 deg \n30 m\nStanding Seam\n30\n3 deg \n85 m\n25\n3 deg \n35 m\nCorrugate\n16.5\n8 deg \n15 m\n21\n4 deg \n20 m\n35\n3 deg \n65 m\nMinimum pitches quoted in this table refer to roof cladding pitch and not the building design roof pitch.\nBuildings designed with widely spaced purlins and widely spaced portal frames may require an increased design\npitch to comply with the minimum recommended as-laid pitches.\nLow-pitched roofs require greater attention to flashing details. The ability of side laps or end laps to withstand\nwater penetration also becomes more critical at low pitches, but a good design of flashings can ensure\nweathertightness in extreme conditions.\nA printable bulletin regarding re-roofing low pitched trough section roofs is available at: BSP01 Replacing\nTrough Section Roofs at a 1 deg Pitch.\nExtract:\n\"Roof replacement with a \"like with like\" does not require a building consent (Exemptions Guidance for\nSchedule 1 of the Building Act 2004, Fifth edition August 2020). An existing flat roof that has met the\nperformance requirements of E2-External Moisture, and B2-Durability, can be replaced with a\ncomparable product, without re-pitching the roof.\"\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 1 \n 7 \n 7.1 \n208\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nWater buildup on vertical surfaces due to intense localised wind patterns, particularly around\nparapets and along the lower edges of walls, creates vulnerable areas. Wind baffles are more\neffective in preventing water ingress than increasing the flashing cover width.\n7.1.1B Exceptions to the Minimum Recommended Roof Cladding Pitch\nrequirements:\nCurved roofs, where, by design, the minimum pitch at the crest is always less than the prescribed minimum\npitch. In these cases, the pitch at the eaves must comply with the profile's minimum pitch, and the pitch at the\nupper end of a terminated arc must be a minimum of 3 deg . (See 15.1 Curved Roofs).\nThe back curbs of penetration flashings where the minimum pitch is 1.5 deg . (See 9 External Moisture\nPenetrations).\nReroofing trough section roofs at less 3 deg , where satisfies the requirements and considerations of Building\nwork that does not require a building consent (Exemptions Guidance for Schedule 1 of the Building Act 2004)\nFifth edition August 2020. More information is available at Building work that does not require a\nbuilding consent, Section 1.1 General repair, maintenance and replacement of building parts (page22).\n7.1.2 \nRunoff Capacity \nRunoff capacity is the ability of the roof cladding to discharge maximum rainfall without water penetrating\nthrough side laps, end laps or flashings and depends on rainfall, the catchment area, the roof pitch, and the profile\ngeometry.\nThe roof pitch determines the rate of flow; steep slopes shed water faster than shallow slopes. The rib height and\nspacing of trapezoidal profiles also affects its shedding ability.\n For example: At a rainfall intensity of 200 mm/hour, a five-rib trapezoidal profile at 3 deg , with a rib height of\n27 mm, can have a run of 90 m.\nThe 7.1.4 Maximum Run Calculator can calculate capacities for any known profile.\n7.1.3 \nRoof Drainage Capacity \nThe capacity of a roof profile to drain water is determined by its geometry and the roof pitch. The catchment area\nis the distance between rib centres times the length, and the effective cross-section area and the wetted\nperimeter is taken to the height of the overlap on corrugate, or capillary bead on trapezoidal and trough section\nprofiles.\nThe 7.1.4 Maximum Run Calculator gives the maximum length that a roof can drain at a given pitch and\nrainfall intensity. The manufacturer's data can be accessed from the drop-down box; for other profiles, the data\ncan be entered manually into the worksheet.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 1 \n 7 \n 7.1 \n209\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.1.3A Trough Capacity\nRib Pitch\nCapillary Height\nPan Width\nRib Height\nCrest Width\nWhere the flow of water is concentrated by penetrations or spreaders, go to the 9.4.4 Maximum Area Above\nPenetration Calculator.\n7.1.3B Penetration Gutters\nFall\n7.1.4 \nMaximum Run Calculator \nMore information about 5.3 Roof Drainage Design can be found in this PDF Document. A responsive online\ntools for calculating maximum run of any given profile, pitch, and rainfall intensity is available\nat https://www.metalroofing.org.nz/maximum-run-calculator.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 1 \n 7 \n 7.1 \n210\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[208,209,210],"subsections":[{"number":"7.1.1","title":"Minimum Roof Cladding Pitch","level":3,"content":"7.1 \nRoof Pitch \nThe pitch is the angle between the horizontal and the roof line. It is also the relationship between the rise and the\nhorizontal span of the roof. See 18.2 Pitch & Rise Calculator for the tabulation of these values and a\ncalculation tool.\n7.1.1 \nMinimum Roof Cladding Pitch \n7.1.1A Minimum Pitch for Generic Metal Roofing\nProfile\nMin Height\nMin Pitch\nCheck Capacity\nafter run of...\nTrapezoidal\nAsymmetrical\n20\n4 deg \n20 m\n27\n3 deg \n40 m\n36\n3 deg \n65 m\nTrapezoidal\nSymmetrical\n20\n4 deg \n15 m\n30\n4 deg \n25 m\nSecret Fix\n30\n3 deg \n60 m\n25\n3 deg \n30 m\nStanding Seam\n30\n3 deg \n85 m\n25\n3 deg \n35 m\nCorrugate\n16.5\n8 deg \n15 m\n21\n4 deg \n20 m\n35\n3 deg \n65 m\nMinimum pitches quoted in this table refer to roof cladding pitch and not the building design roof pitch.\nBuildings designed with widely spaced purlins and widely spaced portal frames may require an increased design\npitch to comply with the minimum recommended as-laid pitches.\nLow-pitched roofs require greater attention to flashing details. The ability of side laps or end laps to withstand\nwater penetration also becomes more critical at low pitches, but a good design of flashings can ensure\nweathertightness in extreme conditions.\nA printable bulletin regarding re-roofing low pitched trough section roofs is available at: BSP01 Replacing\nTrough Section Roofs at a 1 deg Pitch.\nExtract:\n\"Roof replacement with a \"like with like\" does not require a building consent (Exemptions Guidance for\nSchedule 1 of the Building Act 2004, Fifth edition August 2020). An existing flat roof that has met the\nperformance requirements of E2-External Moisture, and B2-Durability, can be replaced with a\ncomparable product, without re-pitching the roof.\"\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n208\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[208]},{"number":"7.1.1A","title":"Minimum Pitch for Generic Metal Roofing","level":3,"content":"7.1 \nRoof Pitch \nThe pitch is the angle between the horizontal and the roof line. It is also the relationship between the rise and the\nhorizontal span of the roof. See 18.2 Pitch & Rise Calculator for the tabulation of these values and a\ncalculation tool.\n7.1.1 \nMinimum Roof Cladding Pitch \nProfile\nMin Height\nMin Pitch\nCheck Capacity\nafter run of...\nTrapezoidal\nAsymmetrical\n20\n4 deg \n20 m\n27\n3 deg \n40 m\n36\n3 deg \n65 m\nTrapezoidal\nSymmetrical\n20\n4 deg \n15 m\n30\n4 deg \n25 m\nSecret Fix\n30\n3 deg \n60 m\n25\n3 deg \n30 m\nStanding Seam\n30\n3 deg \n85 m\n25\n3 deg \n35 m\nCorrugate\n16.5\n8 deg \n15 m\n21\n4 deg \n20 m\n35\n3 deg \n65 m\nMinimum pitches quoted in this table refer to roof cladding pitch and not the building design roof pitch.\nBuildings designed with widely spaced purlins and widely spaced portal frames may require an increased design\npitch to comply with the minimum recommended as-laid pitches.\nLow-pitched roofs require greater attention to flashing details. The ability of side laps or end laps to withstand\nwater penetration also becomes more critical at low pitches, but a good design of flashings can ensure\nweathertightness in extreme conditions.\nA printable bulletin regarding re-roofing low pitched trough section roofs is available at: BSP01 Replacing\nTrough Section Roofs at a 1 deg Pitch.\nExtract:\n\"Roof replacement with a \"like with like\" does not require a building consent (Exemptions Guidance for\nSchedule 1 of the Building Act 2004, Fifth edition August 2020). An existing flat roof that has met the\nperformance requirements of E2-External Moisture, and B2-Durability, can be replaced with a\ncomparable product, without re-pitching the roof.\"\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n208\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[208]},{"number":"7.1.1B","title":"Exceptions to the Minimum Recommended Roof Cladding Pitch requirements:","level":3,"content":"Water buildup on vertical surfaces due to intense localised wind patterns, particularly around\nparapets and along the lower edges of walls, creates vulnerable areas. Wind baffles are more\neffective in preventing water ingress than increasing the flashing cover width.\nrequirements:\nCurved roofs, where, by design, the minimum pitch at the crest is always less than the prescribed minimum\npitch. In these cases, the pitch at the eaves must comply with the profile's minimum pitch, and the pitch at the\nupper end of a terminated arc must be a minimum of 3 deg . (See 15.1 Curved Roofs).\nThe back curbs of penetration flashings where the minimum pitch is 1.5 deg . (See 9 External Moisture\nPenetrations).\nReroofing trough section roofs at less 3 deg , where satisfies the requirements and considerations of Building\nwork that does not require a building consent (Exemptions Guidance for Schedule 1 of the Building Act 2004)\nFifth edition August 2020. More information is available at Building work that does not require a\nbuilding consent, Section 1.1 General repair, maintenance and replacement of building parts (page22).\n7.1.2 \nRunoff Capacity \nRunoff capacity is the ability of the roof cladding to discharge maximum rainfall without water penetrating\nthrough side laps, end laps or flashings and depends on rainfall, the catchment area, the roof pitch, and the profile\ngeometry.\nThe roof pitch determines the rate of flow; steep slopes shed water faster than shallow slopes. The rib height and\nspacing of trapezoidal profiles also affects its shedding ability.\n For example: At a rainfall intensity of 200 mm/hour, a five-rib trapezoidal profile at 3 deg , with a rib height of\n27 mm, can have a run of 90 m.\nThe 7.1.4 Maximum Run Calculator can calculate capacities for any known profile.\n7.1.3 \nRoof Drainage Capacity \nThe capacity of a roof profile to drain water is determined by its geometry and the roof pitch. The catchment area\nis the distance between rib centres times the length, and the effective cross-section area and the wetted\nperimeter is taken to the height of the overlap on corrugate, or capillary bead on trapezoidal and trough section\nprofiles.\nThe 7.1.4 Maximum Run Calculator gives the maximum length that a roof can drain at a given pitch and\nrainfall intensity. The manufacturer's data can be accessed from the drop-down box; for other profiles, the data\ncan be entered manually into the worksheet.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n209\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[209]},{"number":"7.1.2","title":"Runoff Capacity","level":3,"content":"Water buildup on vertical surfaces due to intense localised wind patterns, particularly around\nparapets and along the lower edges of walls, creates vulnerable areas. Wind baffles are more\neffective in preventing water ingress than increasing the flashing cover width.\n7.1.1B Exceptions to the Minimum Recommended Roof Cladding Pitch\nrequirements:\nCurved roofs, where, by design, the minimum pitch at the crest is always less than the prescribed minimum\npitch. In these cases, the pitch at the eaves must comply with the profile's minimum pitch, and the pitch at the\nupper end of a terminated arc must be a minimum of 3 deg . (See 15.1 Curved Roofs).\nThe back curbs of penetration flashings where the minimum pitch is 1.5 deg . (See 9 External Moisture\nPenetrations).\nReroofing trough section roofs at less 3 deg , where satisfies the requirements and considerations of Building\nwork that does not require a building consent (Exemptions Guidance for Schedule 1 of the Building Act 2004)\nFifth edition August 2020. More information is available at Building work that does not require a\nbuilding consent, Section 1.1 General repair, maintenance and replacement of building parts (page22).\n7.1.2 \nRunoff Capacity \nRunoff capacity is the ability of the roof cladding to discharge maximum rainfall without water penetrating\nthrough side laps, end laps or flashings and depends on rainfall, the catchment area, the roof pitch, and the profile\ngeometry.\nThe roof pitch determines the rate of flow; steep slopes shed water faster than shallow slopes. The rib height and\nspacing of trapezoidal profiles also affects its shedding ability.\n For example: At a rainfall intensity of 200 mm/hour, a five-rib trapezoidal profile at 3 deg , with a rib height of\n27 mm, can have a run of 90 m.\nThe 7.1.4 Maximum Run Calculator can calculate capacities for any known profile.\n7.1.3 \nRoof Drainage Capacity \nThe capacity of a roof profile to drain water is determined by its geometry and the roof pitch. The catchment area\nis the distance between rib centres times the length, and the effective cross-section area and the wetted\nperimeter is taken to the height of the overlap on corrugate, or capillary bead on trapezoidal and trough section\nprofiles.\nThe 7.1.4 Maximum Run Calculator gives the maximum length that a roof can drain at a given pitch and\nrainfall intensity. The manufacturer's data can be accessed from the drop-down box; for other profiles, the data\ncan be entered manually into the worksheet.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n209\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[209]},{"number":"7.1.3","title":"Roof Drainage Capacity","level":3,"content":"Water buildup on vertical surfaces due to intense localised wind patterns, particularly around\nparapets and along the lower edges of walls, creates vulnerable areas. Wind baffles are more\neffective in preventing water ingress than increasing the flashing cover width.\n7.1.1B Exceptions to the Minimum Recommended Roof Cladding Pitch\nrequirements:\nCurved roofs, where, by design, the minimum pitch at the crest is always less than the prescribed minimum\npitch. In these cases, the pitch at the eaves must comply with the profile's minimum pitch, and the pitch at the\nupper end of a terminated arc must be a minimum of 3 deg . (See 15.1 Curved Roofs).\nThe back curbs of penetration flashings where the minimum pitch is 1.5 deg . (See 9 External Moisture\nPenetrations).\nReroofing trough section roofs at less 3 deg , where satisfies the requirements and considerations of Building\nwork that does not require a building consent (Exemptions Guidance for Schedule 1 of the Building Act 2004)\nFifth edition August 2020. More information is available at Building work that does not require a\nbuilding consent, Section 1.1 General repair, maintenance and replacement of building parts (page22).\n7.1.2 \nRunoff Capacity \nRunoff capacity is the ability of the roof cladding to discharge maximum rainfall without water penetrating\nthrough side laps, end laps or flashings and depends on rainfall, the catchment area, the roof pitch, and the profile\ngeometry.\nThe roof pitch determines the rate of flow; steep slopes shed water faster than shallow slopes. The rib height and\nspacing of trapezoidal profiles also affects its shedding ability.\n For example: At a rainfall intensity of 200 mm/hour, a five-rib trapezoidal profile at 3 deg , with a rib height of\n27 mm, can have a run of 90 m.\nThe 7.1.4 Maximum Run Calculator can calculate capacities for any known profile.\n7.1.3 \nRoof Drainage Capacity \nThe capacity of a roof profile to drain water is determined by its geometry and the roof pitch. The catchment area\nis the distance between rib centres times the length, and the effective cross-section area and the wetted\nperimeter is taken to the height of the overlap on corrugate, or capillary bead on trapezoidal and trough section\nprofiles.\nThe 7.1.4 Maximum Run Calculator gives the maximum length that a roof can drain at a given pitch and\nrainfall intensity. The manufacturer's data can be accessed from the drop-down box; for other profiles, the data\ncan be entered manually into the worksheet.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n209\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[209]},{"number":"7.1.3A","title":"Trough Capacity","level":3,"content":"Rib Pitch\nCapillary Height\nPan Width\nRib Height\nCrest Width\nWhere the flow of water is concentrated by penetrations or spreaders, go to the 9.4.4 Maximum Area Above\nPenetration Calculator.\n7.1.3B Penetration Gutters\nFall\n7.1.4 \nMaximum Run Calculator \nMore information about 5.3 Roof Drainage Design can be found in this PDF Document. A responsive online\ntools for calculating maximum run of any given profile, pitch, and rainfall intensity is available\nat https://www.metalroofing.org.nz/maximum-run-calculator.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n210\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[210]},{"number":"7.1.3B","title":"Penetration Gutters","level":3,"content":"7.1.3A Trough Capacity\nRib Pitch\nCapillary Height\nPan Width\nRib Height\nCrest Width\nWhere the flow of water is concentrated by penetrations or spreaders, go to the 9.4.4 Maximum Area Above\nPenetration Calculator.\nFall\n7.1.4 \nMaximum Run Calculator \nMore information about 5.3 Roof Drainage Design can be found in this PDF Document. A responsive online\ntools for calculating maximum run of any given profile, pitch, and rainfall intensity is available\nat https://www.metalroofing.org.nz/maximum-run-calculator.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n210\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[210]},{"number":"7.1.4","title":"Maximum Run Calculator","level":3,"content":"7.1.3A Trough Capacity\nRib Pitch\nCapillary Height\nPan Width\nRib Height\nCrest Width\nWhere the flow of water is concentrated by penetrations or spreaders, go to the 9.4.4 Maximum Area Above\nPenetration Calculator.\n7.1.3B Penetration Gutters\nFall\n7.1.4 \nMaximum Run Calculator \nMore information about 5.3 Roof Drainage Design can be found in this PDF Document. A responsive online\ntools for calculating maximum run of any given profile, pitch, and rainfall intensity is available\nat https://www.metalroofing.org.nz/maximum-run-calculator.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.1 ROOF PITCH\n 1 \n 7 \n 7.1 \n210\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[210]}]},{"number":"7.2","title":"Fastening Roofing","level":2,"content":"7.2 \nFastening Roofing \nAll fastenings that pierce the sheeting should be provided with adequate sealing washers to prevent leakage.\nSealing washers should be made from Ethylene Propylene Diene Monomer (EPDM).\nFastenings should be tightened only enough to form a weatherproof seal without damaging the sealing washer\nor deforming the sheet profile. Deformed sheeting will cause water to pond around the seal.\nSwarf should be removed from under the sealing washer as it will not only cause staining but also interfere\nwith the seal.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 2 \n 7 \n 7.2 \n211\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[211]},{"number":"7.3","title":"Thermal Expansion And Contraction","level":2,"content":"7.3 \nThermal Expansion And Contraction \nAll metal cladding and flashings are subject to expansion and contraction caused by changes in temperature, and\ntheir design should allow for this movement. The energy produced should be absorbed without damage to the\ncladding, fixings or structure. The recommendations in this section are specific to preventing damage and leaks\nthrough thermal movement. Thermal movement can also cause disturbing noise levels in dwellings with shorter\nmember lengths than those recommended in this section. (See 12.1 Roof Noise.)\nThe ribs of metal trapezoidal or corrugated roof and wall cladding absorb expansion across the width of the\nsheets, but special provisions are needed over the sheets' length.\nMuch of the longitudinal expansion is taken up by the bowing of the sheet between fastened supports. The extent\nto which this happens depends on the profile strength and support spacings.\nFailure by thermal expansion normally results in shearing of the fastener. Fasteners into lightweight steel purlins\nup to 3 mm in thickness are less vulnerable as they tend to rotate rather than be subjected to repeated bending\nresulting in fatigue failure. Fasteners into hot rolled steel sections or timber are far more vulnerable to this mode\nof failure and in all run lengths over 20 metres provision for expansion must be made when fastening into such\nsupports.\nWhere overlapping sheets are fastened through the ends, they must be considered as one length to calculate\nthermal movement. Unfastened end laps are not recommended.\nWall cladding does not require the same provisions as roof cladding, because of solar radiation angle.\nOversized holes and washers give some room for expansion and contraction, but it is not enough to allow\nmovement without stress or distortion over long spans. In such cases, a step joint should be used. (See 8.5.4.3B\nStepped Roof Flashing)\n7.3.1 \nTemperature Range \nRanges of temperature likely to be experienced in NZ by different steel cladding are:\n7.3.1A Steel Cladding Temperature Ranges\nMax/Min Roof Temp deg C\n No Wind\nInsulated\nLight colour\n+60 deg -15 deg \n= 75 deg \nInsulated\nDark colour\n+80 deg -15 deg \n= 95 deg \nUninsulated\nLight colour\n+50 deg -10 deg \n= 60 deg \nUninsulated\nDark colour\n+65 deg -10 deg \n= 75 deg \nAluminium and zinc, which have twice the expansion rate of steel, do not necessarily expand to this\ndegree because of the different characteristics of mass, emittance, and radiance which affects\ntheir temperature range. Copper expands one and a half times as much as steel, and stainless steel\ncan expand up to 1.5 times as much as steel depending on composition.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 3 \n 7 \n 7.3 \n212\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\nThe theoretical expansion of steel roof cladding in mm is 12 x temperature change x length in\nmetres/1000.\nSteel expansion rates can be calculated as follows:\nGiven a length (e.g., 30 m) and that the material (e.g., a light-coloured uninsulated roof) moves\nthrough a 60 deg C range (e.g., + 50 deg C -10 deg C), the theoretical increase in length is 12 x 60 x 30/1000 =\n21.6 mm.\nThis amount of movement of roof cladding and components does not have to be provided for in\npractice, because:\nThe building also expands with the ambient temperature, although to a lesser degree.\nFasteners into light gauge purlins will roll rather than bend. The purlin flange may also roll to a\ndegree.\nThe roof cladding bows between purlins when it is constrained. Sighting down a corrugated steel\nroof on a warm sunny day will show an undulating line compared to a straight line when the roof\nis cool. The forces created by expansion and contraction are self-levelling, i.e., each component\nmoves under load until the resisting force is more than the expansion force.\nWhen a length of sheeting is solid fastened at the centre and unconstrained at either end, the\nmovement is towards the ends of the sheeting; meaning the actual expansion or contraction\nmovement is only half that of a full length of roof or wall cladding fastened at one end. Special\ndesign of the ridge or head barge flashing is required in these cases to allow free movement.\nAlternatively, sheets can be solidly fixed at the upper region, so all expansion takes place in the\nlower part of the sheet towards the eaves.\n7.3.2 \nRoof Cladding Expansion Provisions \nThe expansion of roof cladding depends on the materials, the constraints imposed by the fixing, the heat paths in\nthe building and the actual temperature. The following graphics are indicative of favourable and unfavourable\nconditions for thermal expansion and suggest what these are. They show the lengths under both sets of\nconditions above which special provision needs to be made to accommodate thermal expansion.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 3 \n 7 \n 7.3 \n213\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.3.2A Favourable Circumstances for Controlling Expansion\n30\n0\n5\n10\n15\n20\n25\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nFlexible light gauge steel \npurlins <3mm \nLight coloured roof cladding\nPurlin spacings greater than 1.5 m\nCrest FixingBuilding not insulated\nVentilated air space below \nroof cladding and underlay\nLow rib profile or corrugate\nNo special requirements\n9mm oversized holes and loa\nspreading washers\nSheet length (metres)\n*\n*\n*\n*\n*\n*\n7.3.2B Unfavourable Circumstances for Controlling Expansion\nNo special requirements\n9mm oversized holes and load\nspreading washers\n30\n0\n5\n10\n15\n20\n25\nPurlins made out of hot rolled stee\nor thicker than 3 mm.\nLaminated timber purlins\nPurlin spacings of less than 1.5 m\nDark coloured roof cladding\nSkillion Roof\nRigid profiles, e.g., high rib\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nSheet length (metres)\n*\n*\n*\n*\n*\n*\nNotes:\n1. Roofs requiring oversized holes are solid fixed towards the ridge and provision for expansion is made towards the gutter line.\n2. These are guidelines only and special engineering of the roof, fixing or ventilation may allow greater spans to\nbe used.\n3. These diagrams refer only to roof cladding screwed through the top. Secret or clip-fixed roofs can move more\nfreely if installed correctly and allow for greater run lengths.\n4. The recommendations are based on preventing damage to the fasteners and are not recommendations to\nprevent roof noise.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 3 \n 7 \n 7.3 \n214\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7 EXTERNAL MOISTURE ROOFING\n 7 \n 3 \n 7 \n 7.3 \n215\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[212,213,214,215],"subsections":[{"number":"7.3.1","title":"Temperature Range","level":3,"content":"7.3 \nThermal Expansion And Contraction \nAll metal cladding and flashings are subject to expansion and contraction caused by changes in temperature, and\ntheir design should allow for this movement. The energy produced should be absorbed without damage to the\ncladding, fixings or structure. The recommendations in this section are specific to preventing damage and leaks\nthrough thermal movement. Thermal movement can also cause disturbing noise levels in dwellings with shorter\nmember lengths than those recommended in this section. (See 12.1 Roof Noise.)\nThe ribs of metal trapezoidal or corrugated roof and wall cladding absorb expansion across the width of the\nsheets, but special provisions are needed over the sheets' length.\nMuch of the longitudinal expansion is taken up by the bowing of the sheet between fastened supports. The extent\nto which this happens depends on the profile strength and support spacings.\nFailure by thermal expansion normally results in shearing of the fastener. Fasteners into lightweight steel purlins\nup to 3 mm in thickness are less vulnerable as they tend to rotate rather than be subjected to repeated bending\nresulting in fatigue failure. Fasteners into hot rolled steel sections or timber are far more vulnerable to this mode\nof failure and in all run lengths over 20 metres provision for expansion must be made when fastening into such\nsupports.\nWhere overlapping sheets are fastened through the ends, they must be considered as one length to calculate\nthermal movement. Unfastened end laps are not recommended.\nWall cladding does not require the same provisions as roof cladding, because of solar radiation angle.\nOversized holes and washers give some room for expansion and contraction, but it is not enough to allow\nmovement without stress or distortion over long spans. In such cases, a step joint should be used. (See 8.5.4.3B\nStepped Roof Flashing)\n7.3.1 \nTemperature Range \nRanges of temperature likely to be experienced in NZ by different steel cladding are:\n7.3.1A Steel Cladding Temperature Ranges\nMax/Min Roof Temp deg C\n No Wind\nInsulated\nLight colour\n+60 deg -15 deg \n= 75 deg \nInsulated\nDark colour\n+80 deg -15 deg \n= 95 deg \nUninsulated\nLight colour\n+50 deg -10 deg \n= 60 deg \nUninsulated\nDark colour\n+65 deg -10 deg \n= 75 deg \nAluminium and zinc, which have twice the expansion rate of steel, do not necessarily expand to this\ndegree because of the different characteristics of mass, emittance, and radiance which affects\ntheir temperature range. Copper expands one and a half times as much as steel, and stainless steel\ncan expand up to 1.5 times as much as steel depending on composition.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n212\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[212]},{"number":"7.3.1A","title":"Steel Cladding Temperature Ranges","level":3,"content":"7.3 \nThermal Expansion And Contraction \nAll metal cladding and flashings are subject to expansion and contraction caused by changes in temperature, and\ntheir design should allow for this movement. The energy produced should be absorbed without damage to the\ncladding, fixings or structure. The recommendations in this section are specific to preventing damage and leaks\nthrough thermal movement. Thermal movement can also cause disturbing noise levels in dwellings with shorter\nmember lengths than those recommended in this section. (See 12.1 Roof Noise.)\nThe ribs of metal trapezoidal or corrugated roof and wall cladding absorb expansion across the width of the\nsheets, but special provisions are needed over the sheets' length.\nMuch of the longitudinal expansion is taken up by the bowing of the sheet between fastened supports. The extent\nto which this happens depends on the profile strength and support spacings.\nFailure by thermal expansion normally results in shearing of the fastener. Fasteners into lightweight steel purlins\nup to 3 mm in thickness are less vulnerable as they tend to rotate rather than be subjected to repeated bending\nresulting in fatigue failure. Fasteners into hot rolled steel sections or timber are far more vulnerable to this mode\nof failure and in all run lengths over 20 metres provision for expansion must be made when fastening into such\nsupports.\nWhere overlapping sheets are fastened through the ends, they must be considered as one length to calculate\nthermal movement. Unfastened end laps are not recommended.\nWall cladding does not require the same provisions as roof cladding, because of solar radiation angle.\nOversized holes and washers give some room for expansion and contraction, but it is not enough to allow\nmovement without stress or distortion over long spans. In such cases, a step joint should be used. (See 8.5.4.3B\nStepped Roof Flashing)\n7.3.1 \nTemperature Range \nRanges of temperature likely to be experienced in NZ by different steel cladding are:\nMax/Min Roof Temp deg C\n No Wind\nInsulated\nLight colour\n+60 deg -15 deg \n= 75 deg \nInsulated\nDark colour\n+80 deg -15 deg \n= 95 deg \nUninsulated\nLight colour\n+50 deg -10 deg \n= 60 deg \nUninsulated\nDark colour\n+65 deg -10 deg \n= 75 deg \nAluminium and zinc, which have twice the expansion rate of steel, do not necessarily expand to this\ndegree because of the different characteristics of mass, emittance, and radiance which affects\ntheir temperature range. Copper expands one and a half times as much as steel, and stainless steel\ncan expand up to 1.5 times as much as steel depending on composition.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n212\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[212]},{"number":"7.3.2","title":"Roof Cladding Expansion Provisions","level":3,"content":"The theoretical expansion of steel roof cladding in mm is 12 x temperature change x length in\nmetres/1000.\nSteel expansion rates can be calculated as follows:\nGiven a length (e.g., 30 m) and that the material (e.g., a light-coloured uninsulated roof) moves\nthrough a 60 deg C range (e.g., + 50 deg C -10 deg C), the theoretical increase in length is 12 x 60 x 30/1000 =\n21.6 mm.\nThis amount of movement of roof cladding and components does not have to be provided for in\npractice, because:\nThe building also expands with the ambient temperature, although to a lesser degree.\nFasteners into light gauge purlins will roll rather than bend. The purlin flange may also roll to a\ndegree.\nThe roof cladding bows between purlins when it is constrained. Sighting down a corrugated steel\nroof on a warm sunny day will show an undulating line compared to a straight line when the roof\nis cool. The forces created by expansion and contraction are self-levelling, i.e., each component\nmoves under load until the resisting force is more than the expansion force.\nWhen a length of sheeting is solid fastened at the centre and unconstrained at either end, the\nmovement is towards the ends of the sheeting; meaning the actual expansion or contraction\nmovement is only half that of a full length of roof or wall cladding fastened at one end. Special\ndesign of the ridge or head barge flashing is required in these cases to allow free movement.\nAlternatively, sheets can be solidly fixed at the upper region, so all expansion takes place in the\nlower part of the sheet towards the eaves.\n7.3.2 \nRoof Cladding Expansion Provisions \nThe expansion of roof cladding depends on the materials, the constraints imposed by the fixing, the heat paths in\nthe building and the actual temperature. The following graphics are indicative of favourable and unfavourable\nconditions for thermal expansion and suggest what these are. They show the lengths under both sets of\nconditions above which special provision needs to be made to accommodate thermal expansion.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n213\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[213]},{"number":"7.3.2A","title":"Favourable Circumstances for Controlling Expansion","level":3,"content":"30\n0\n5\n10\n15\n20\n25\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nFlexible light gauge steel \npurlins <3mm \nLight coloured roof cladding\nPurlin spacings greater than 1.5 m\nCrest FixingBuilding not insulated\nVentilated air space below \nroof cladding and underlay\nLow rib profile or corrugate\nNo special requirements\n9mm oversized holes and loa\nspreading washers\nSheet length (metres)\n*\n*\n*\n*\n*\n*\n7.3.2B Unfavourable Circumstances for Controlling Expansion\nNo special requirements\n9mm oversized holes and load\nspreading washers\n30\n0\n5\n10\n15\n20\n25\nPurlins made out of hot rolled stee\nor thicker than 3 mm.\nLaminated timber purlins\nPurlin spacings of less than 1.5 m\nDark coloured roof cladding\nSkillion Roof\nRigid profiles, e.g., high rib\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nSheet length (metres)\n*\n*\n*\n*\n*\n*\nNotes:\n1. Roofs requiring oversized holes are solid fixed towards the ridge and provision for expansion is made towards the gutter line.\n2. These are guidelines only and special engineering of the roof, fixing or ventilation may allow greater spans to\nbe used.\n3. These diagrams refer only to roof cladding screwed through the top. Secret or clip-fixed roofs can move more\nfreely if installed correctly and allow for greater run lengths.\n4. The recommendations are based on preventing damage to the fasteners and are not recommendations to\nprevent roof noise.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n214\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[214]},{"number":"7.3.2B","title":"Unfavourable Circumstances for Controlling Expansion","level":3,"content":"7.3.2A Favourable Circumstances for Controlling Expansion\n30\n0\n5\n10\n15\n20\n25\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nFlexible light gauge steel \npurlins <3mm \nLight coloured roof cladding\nPurlin spacings greater than 1.5 m\nCrest FixingBuilding not insulated\nVentilated air space below \nroof cladding and underlay\nLow rib profile or corrugate\nNo special requirements\n9mm oversized holes and loa\nspreading washers\nSheet length (metres)\n*\n*\n*\n*\n*\n*\nNo special requirements\n9mm oversized holes and load\nspreading washers\n30\n0\n5\n10\n15\n20\n25\nPurlins made out of hot rolled stee\nor thicker than 3 mm.\nLaminated timber purlins\nPurlin spacings of less than 1.5 m\nDark coloured roof cladding\nSkillion Roof\nRigid profiles, e.g., high rib\nLight Steel\nDark Steel\nLight Aluminium\nDark Aluminium\nSheet length (metres)\n*\n*\n*\n*\n*\n*\nNotes:\n1. Roofs requiring oversized holes are solid fixed towards the ridge and provision for expansion is made towards the gutter line.\n2. These are guidelines only and special engineering of the roof, fixing or ventilation may allow greater spans to\nbe used.\n3. These diagrams refer only to roof cladding screwed through the top. Secret or clip-fixed roofs can move more\nfreely if installed correctly and allow for greater run lengths.\n4. The recommendations are based on preventing damage to the fasteners and are not recommendations to\nprevent roof noise.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n214\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.3 THERMAL EXPANSION AND CONTRACTION\n 3 \n 7 \n 7.3 \n215\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[214,215]}]},{"number":"7.4","title":"End Laps","level":2,"content":"7.4 \nEnd Laps \nEnd laps should be avoided if possible when installing metal roof cladding, as an incorrectly sealed end lap may\nentrap water and cause corrosion. When the sheets are too long to be transported or exceed the longest\nrecommended length (see 7.3.2 Roof Cladding Expansion Provisions), the transverse or end lap joint can\nbe avoided by using a waterfall step. (See 8.5.4.3A Step Apron Details)\nWhen long lengths outside the capacity of available transport are required, secret-fixed roof cladding can be\nsupplied by using an onsite roll-forming machine.\nWhere end laps are unavoidable, a sealed joint should be made using sealant at both ends of the lap. The upper\nseal is critical as condensation entering the upper side of the lap from underneath can cause rapid corrosion.\n(See 14.11.1 Sealing End Laps.) The sheets are fixed to the purlin using screw fixings with a minimum lap of\n150 mm. For pitches less than 10 deg , a 200 mm lap is recommended.\nThe two lengths should be regarded as one length for expansion provisions.\n7.4.1 \nWall Cladding End Laps \nA printable bulletin is availble at: BEL01 End Laps in Wall Cladding.\nThe bulletin is identical to the content below.\nAs with roofing, wall cladding sheets should, wherever possible, be laid in a single continuous length. Where this\nis not feasible due to excessive length or other constraints, there are options for lapping.\nWhen the internal environment is dry and the wall is unlined, sheets can be simply end-lapped by approximately\n150 mm. In dwellings, lined buildings, and buildings with moist internal environments, the laps should be sealed at\nboth ends as per roof laps. The downside of end lapping is that there are four layers of material at the side\nlap/end lap junction. This often leads to an untidy join.\nThe preferred option where aesthetics must be considered is not to end-lap the sheets, but to have a zed flashing\nunder the upper sheet and over the lower, with cover as shown in 8.4F Barge Flashing Cover - Trapezoidal\nand Secret Fixed Table and 8.4J Transverse Apron Flashing Cover Table. This is both tidier and\nallows the sheets to thermally expand individually.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7 \n 7.4 \n216\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.\n7.4.1A Wall Cladding End Laps\nWall Cladding\nWall Cladding\nFastener\nFastener\n93 deg \nZed Flashing\nProfiled foam\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7 \n 7.4 \n217\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[216,217],"subsections":[{"number":"7.4.1","title":"Wall Cladding End Laps","level":3,"content":"7.4 \nEnd Laps \nEnd laps should be avoided if possible when installing metal roof cladding, as an incorrectly sealed end lap may\nentrap water and cause corrosion. When the sheets are too long to be transported or exceed the longest\nrecommended length (see 7.3.2 Roof Cladding Expansion Provisions), the transverse or end lap joint can\nbe avoided by using a waterfall step. (See 8.5.4.3A Step Apron Details)\nWhen long lengths outside the capacity of available transport are required, secret-fixed roof cladding can be\nsupplied by using an onsite roll-forming machine.\nWhere end laps are unavoidable, a sealed joint should be made using sealant at both ends of the lap. The upper\nseal is critical as condensation entering the upper side of the lap from underneath can cause rapid corrosion.\n(See 14.11.1 Sealing End Laps.) The sheets are fixed to the purlin using screw fixings with a minimum lap of\n150 mm. For pitches less than 10 deg , a 200 mm lap is recommended.\nThe two lengths should be regarded as one length for expansion provisions.\n7.4.1 \nWall Cladding End Laps \nA printable bulletin is availble at: BEL01 End Laps in Wall Cladding.\nThe bulletin is identical to the content below.\nAs with roofing, wall cladding sheets should, wherever possible, be laid in a single continuous length. Where this\nis not feasible due to excessive length or other constraints, there are options for lapping.\nWhen the internal environment is dry and the wall is unlined, sheets can be simply end-lapped by approximately\n150 mm. In dwellings, lined buildings, and buildings with moist internal environments, the laps should be sealed at\nboth ends as per roof laps. The downside of end lapping is that there are four layers of material at the side\nlap/end lap junction. This often leads to an untidy join.\nThe preferred option where aesthetics must be considered is not to end-lap the sheets, but to have a zed flashing\nunder the upper sheet and over the lower, with cover as shown in 8.4F Barge Flashing Cover - Trapezoidal\nand Secret Fixed Table and 8.4J Transverse Apron Flashing Cover Table. This is both tidier and\nallows the sheets to thermally expand individually.\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.4 END LAPS\n 7 \n 7.4 \n216\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[216]},{"number":"7.4.1A","title":"Wall Cladding End Laps","level":3,"content":"Wall Cladding\nWall Cladding\nFastener\nFastener\n93 deg \nZed Flashing\nProfiled foam\n 7 EXTERNAL MOISTURE ROOFING\n 7 \n 7.4 END LAPS\n 7 \n 7.4 \n217\nThis is a controlled document. This copy of the Code Of Practice was issued 1 December 2025, and the next issue is due 1 March 2026.\nThe Online version of this document is the most up-to-date and in the case of conict the Online version prevails over any saved or printed version.","pdfPages":[217]}]}]}]}